{
  "Reminder plugin for Obsidian. This plugin adds feature to manage TODOs with reminder.": "Erinnerungs-Plugin für Obsidian. Dieses Plugin fügt Funktionen zur Verwaltung von TODOs mit Erinnerungen hinzu.",
  "AidenLx's Folder Note": "AidenLx's Ordnernotiz",
  "Add description, summary and more info to folders with folder notes.": "Fügen Sie Ordnern mit Ordnernotizen Beschreibungen, Zusammenfassungen und weitere Informationen hinzu.",
  "AidenLx's Folder Note - folderv component": "AidenLx's Ordnernotiz - folderv Komponente",
  "Optional `folderv` Component for alx-folder-note": "Optionale `folderv` Komponente für alx-folder-note",
  "Auto Card Link": "Automatische Kartenverlinkung",
  "Automatically fetches metadata from a url and makes it as a card-styled link": "Ruft automatisch Metadaten von einer URL ab und erstellt daraus einen kartenförmigen Link",
  "Auto Link Title": "Automatischer Link-Titel",
  "This plugin automatically fetches the titles of links from the web": "Dieses Plugin ruft automatisch die Titel von Links aus dem Web ab",
  "BRAT": "BRAT",
  "Easily install a beta version of a plugin for testing.": "Installieren Sie einfach eine Beta-Version eines Plugins zum Testen.",
  "Editing Toolbar": "Bearbeitungsleiste",
  "The Obsidian Editing Toolbar is modified from cmenu, which provides more powerful customization settings and has many built-in editing commands to be a MS Word-like toolbar editing experience.": "Die Obsidian-Bearbeitungsleiste ist eine Modifikation von cmenu, die leistungsfähigere Anpassungseinstellungen bietet und viele integrierte Bearbeitungsbefehle für eine MS Word-ähnliche Symbolleistenbearbeitung enthält.",
  "Execute Code": "Code ausführen",
  "Allows to execute code snippets within a note. Supported programming languages:  C, CPP, Dart, Golang, Groovy, Kotlin, Java, JavaScript, TypeScript, Lean, Lua, CSharp, Prolog, Rust, Python, R, Ruby, Wolfram Mathematica, Haskell, Scala, Racket, F#, Batch, Shell & Powershell.": "Ermöglicht die Ausführung von Code-Snippets innerhalb einer Notiz. Unterstützte Programmiersprachen: C, CPP, Dart, Golang, Groovy, Kotlin, Java, JavaScript, TypeScript, Lean, Lua, CSharp, Prolog, Rust, Python, R, Ruby, Wolfram Mathematica, Haskell, Scala, Racket, F#, Batch, Shell & Powershell.",
  "Fast Image Cleaner": "Schneller Bildreiniger",
  "This plugin allows you to quickly remove image attachment and referenced link from your documents in both LIVE , READ mode by right-click menu": "Mit diesem Plugin können Sie schnell Bildanhänge und referenzierte Links aus Ihren Dokumenten sowohl im LIVE- als auch im LESE-Modus über das Kontextmenü entfernen",
  "Folder Note Core": "Ordnernotiz Kern",
  "Provide core features and API for folder notes": "Stellt Kernfunktionen und API für Ordnernotizen bereit",
  "Git": "Git",
  "Integrate Git version control with automatic backup and other advanced features.": "Integriert Git-Versionskontrolle mit automatischer Sicherung und anderen erweiterten Funktionen.",
  "Kanban": "Kanban",
  "Create markdown-backed Kanban boards in Obsidian.": "Erstellen Sie Markdown-basierte Kanban-Boards in Obsidian.",
  "Links": "Links",
  "Manipulate links": "Links bearbeiten",
  "MySnippets": "Meine Snippets",
  "MySnippets is a plugin that adds a status bar menu allowing the user to quickly toggle their snippets on and off 🖌.": "MySnippets ist ein Plugin, das ein Statusleistenmenü hinzufügt, mit dem der Benutzer seine Snippets schnell ein- und ausschalten kann 🖌.",
  "proxy github": "GitHub-Proxy",
  "Reminder": "Erinnerung",
  "Style Settings": "Stileinstellungen",
  "Offers controls for adjusting theme, plugin, and snippet CSS variables.": "Bietet Steuerelemente zum Anpassen von Theme-, Plugin- und Snippet-CSS-Variablen.",
  "Templater": "Vorlagenersteller",
  "Create and use templates": "Erstellen und verwenden Sie Vorlagen",
  "Inside Folder, Index File": "Im Ordner, Indexdatei",
  "Inside Folder, With Same Name": "Im Ordner, mit gleichem Namen",
  "Outside Folder, With Same Name": "Außerhalb des Ordners, mit gleichem Namen",
  "Icon Shortcodes v0.5.1+": "Icon-Kurzcodes v0.5.1+",
  "Ctrl (Cmd in macOS)": "Strg (Cmd unter macOS)",
  "Ctrl (Ctrl in macOS)": "Strg (Strg unter macOS)",
  "Alt": "Alt",
  "TRACE": "TRACE",
  "DEBUG": "DEBUG",
  "INFO": "INFO",
  "WARN": "WARNUNG",
  "ERROR": "FEHLER",
  "SILENT": "STUMM",
  "Notify if startup takes longer than expected": "Benachrichtigen, wenn der Start länger als erwartet dauert",
  "Diagnose issues with your app by seeing what is causing the app to load slowly.": "Diagnostizieren Sie Probleme mit Ihrer App, indem Sie sehen, was die App langsam laden lässt.",
  "Enhance Default Paste": "Standard-Einfügen verbessern",
  "Fetch the link title when pasting a link in the editor with the default paste command": "Ruft den Link-Titel ab, wenn ein Link im Editor mit dem Standard-Einfügebefehl eingefügt wird",
  "Enhance Drop Events": "Drop-Events verbessern",
  "Fetch the link title when drag and dropping a link from another program": "Ruft den Link-Titel ab, wenn ein Link aus einem anderen Programm per Drag & Drop eingefügt wird",
  "Maximum title length": "Maximale Titellänge",
  "Set the maximum length of the title. Set to 0 to disable.": "Legt die maximale Länge des Titels fest. Auf 0 setzen zum Deaktivieren.",
  "Preserve selection as title": "Auswahl als Titel beibehalten",
  "Whether to prefer selected text as title over fetched title when pasting": "Ob beim Einfügen der ausgewählte Text dem abgerufenen Titel vorgezogen werden soll",
  "Website Blacklist": "Website-Blacklist",
  "List of strings (comma separated) that disable autocompleting website titles. Can be URLs or arbitrary text.": "Liste von Zeichenketten (durch Kommas getrennt), die die automatische Vervollständigung von Website-Titeln deaktivieren. Können URLs oder beliebiger Text sein.",
  "Use New Scraper": "Neuen Scraper verwenden",
  "Use experimental new scraper, seems to work well on desktop but not mobile.": "Verwenden Sie den experimentellen neuen Scraper, der auf dem Desktop gut funktioniert, aber nicht auf Mobilgeräten.",
  "Use Better Fetching Placeholder": "Besseren Abruf-Platzhalter verwenden",
  "Use a more readable placeholder when fetching the title of a link.": "Verwenden Sie einen besser lesbaren Platzhalter beim Abrufen des Titels eines Links.",
  "LinkPreview API Key": "LinkPreview API-Schlüssel",
  "API key for the LinkPreview.net service. Get one at https://my.linkpreview.net/access_keys": "API-Schlüssel für den LinkPreview.net-Dienst. Holen Sie sich einen unter https://my.linkpreview.net/access_keys",
  "Auto-enable plugins after installation": "Plugins nach der Installation automatisch aktivieren",
  "If enabled beta plugins will be automatically enabled after installtion by default. Note: you can toggle this on and off for each plugin in the \"Add Plugin\" form.": "Wenn aktiviert, werden Beta-Plugins standardmäßig nach der Installation automatisch aktiviert. Hinweis: Sie können dies für jedes Plugin im Formular \"Plugin hinzufügen\" ein- und ausschalten.",
  "Auto-update plugins at startup": "Plugins beim Start automatisch aktualisieren",
  "If enabled all beta plugins will be checked for updates each time Obsidian starts. Note: this does not update frozen version plugins.": "Wenn aktiviert, werden alle Beta-Plugins bei jedem Start von Obsidian auf Updates überprüft. Hinweis: Dies aktualisiert keine eingefrorenen Versions-Plugins.",
  "Auto-update themes at startup": "Themes beim Start automatisch aktualisieren",
  "If enabled all beta themes will be checked for updates each time Obsidian starts.": "Wenn aktiviert, werden alle Beta-Themes bei jedem Start von Obsidian auf Updates überprüft.",
  "Learn more about my work at:": "Erfahren Sie mehr über meine Arbeit unter:",
  "Beta plugin list": "Beta-Plugin-Liste",
  "The following is a list of beta plugins added via the command palette \"Add a beta plugin for testing\" or \"Add a beta plugin with frozen version for testing\". A frozen version is a specific release of a plugin based on its release tag.": "Die folgende Liste enthält Beta-Plugins, die über die Befehlspalette \"Beta-Plugin zum Testen hinzufügen\" oder \"Beta-Plugin mit eingefrorener Version zum Testen hinzufügen\" hinzugefügt wurden. Eine eingefrorene Version ist eine bestimmte Version eines Plugins basierend auf seinem Release-Tag.",
  "Click the x button next to a plugin to remove it from the list.": "Klicken Sie auf die x-Schaltfläche neben einem Plugin, um es aus der Liste zu entfernen.",
  "Note:": "Hinweis:",
  "This does not delete the plugin, this should be done from the  Community Plugins tab in Settings.": "Dies löscht das Plugin nicht, dies sollte über die Registerkarte Community-Plugins in den Einstellungen erfolgen.",
  "Add Beta plugin": "Beta-Plugin hinzufügen",
  "obsidian-canzi/Enhanced-editing": "obsidian-canzi/Enhanced-editing",
  "Add Beta plugin with frozen version": "Beta-Plugin mit eingefrorener Version hinzufügen",
  "Beta themes list": "Beta-Themes-Liste",
  "Add Beta Theme": "Beta-Theme hinzufügen",
  "Monitoring": "Überwachung",
  "Enable Notifications": "Benachrichtigungen aktivieren",
  "BRAT will provide popup notifications for its various activities. Turn this off means  no notifications from BRAT.": "BRAT zeigt Popup-Benachrichtigungen für seine verschiedenen Aktivitäten an. Wenn Sie dies ausschalten, bedeutet das keine Benachrichtigungen von BRAT.",
  "Enable Logging": "Protokollierung aktivieren",
  "Plugin updates will be logged to a file in the log file.": "Plugin-Updates werden in einer Protokolldatei gespeichert.",
  "BRAT Log File Location": "BRAT-Protokolldatei-Speicherort",
  "Logs will be saved to this file. Don't add .md to the file name.": "Protokolle werden in dieser Datei gespeichert. Fügen Sie dem Dateinamen kein .md hinzu.",
  "Enable Verbose Logging": "Ausführliche Protokollierung aktivieren",
  "Get a lot  more information in  the log.": "Erhalten Sie viel mehr Informationen im Protokoll.",
  "Debugging Mode": "Debug-Modus",
  "Atomic Bomb level console logging. Can be used for troubleshoting and development.": "Konsolenprotokollierung auf Atombomben-Niveau. Kann für Fehlerbehebung und Entwicklung verwendet werden.",
  "Personal Access Token": "Persönlicher Zugangstoken",
  "If you need to access private repositories, enter the personal access token here.": "Wenn Sie auf private Repositories zugreifen müssen, geben Sie hier den persönlichen Zugangstoken ein.",
  "Obsidian Editing Toolbar": "Obsidian Bearbeitungsleiste",
  "body": "Hauptteil",
  "workspace": "Arbeitsbereich",
  "glass": "Glas",
  "default": "Standard",
  "tiny": "winzig",
  "fixed": "fixiert",
  "following": "folgend",
  "top": "oben",
  "undo editor": "Editor rückgängig machen",
  "redo editor": "Editor wiederherstellen",
  "Clear text formatting": "Textformatierung löschen",
  "Header 1": "Überschrift 1",
  "Header 2": "Überschrift 2",
  "Header 3": "Überschrift 3",
  "submenu": "Untermenü",
  "Header 4": "Überschrift 4",
  "Header 5": "Überschrift 5",
  "Header 6": "Überschrift 6",
  "Toggle bold": "Fett umschalten",
  "Toggle italics": "Kursiv umschalten",
  "Toggle strikethrough": "Durchgestrichen umschalten",
  "Toggle underline": "Unterstrichen umschalten",
  "==Toggle highlight ==": "==Hervorhebung umschalten ==",
  "Toggle blockquote": "Blockzitat umschalten",
  "Toggle superscript": "Hochgestellt umschalten",
  "Toggle subscript": "Tiefgestellt umschalten",
  "inline code": "Inline-Code",
  "Toggle codeblock": "Codeblock umschalten",
  "insert wikilink [[]]": "Wikilink [[]] einfügen",
  "insert link []()": "Link []() einfügen",
  "insert embed ![[]]": "Einbettung ![[]] einfügen",
  "Horizontal divider": "Horizontaler Trenner",
  "submenu-list": "Untermenü-Liste",
  "numbered list": "nummerierte Liste",
  "bullet list": "Aufzählungsliste",
  "unindent-list": "Liste ausrücken",
  "indent list": "Liste einrücken",
  "submenu-aligin": "Untermenü-Ausrichtung",
  "Settings for the Code Execution Plugin.": "Einstellungen für das Code-Ausführungs-Plugin.",
  "General Settings": "Allgemeine Einstellungen",
  "Timeout (in seconds)": "Zeitüberschreitung (in Sekunden)",
  "The time after which a program gets shut down automatically. This is to prevent infinite loops.": "Die Zeit, nach der ein Programm automatisch beendet wird. Dies verhindert Endlosschleifen.",
  "Allow Input": "Eingabe erlauben",
  "Whether or not to include a stdin input box when running blocks. In order to apply changes to this, Obsidian must be refreshed.": "Ob beim Ausführen von Blöcken ein stdin-Eingabefeld angezeigt werden soll. Um Änderungen zu übernehmen, muss Obsidian neu geladen werden.",
  "WSL Mode": "WSL-Modus",
  "Whether or not to run code in the Windows Subsystem for Linux. If you don't have WSL installed, don't turn this on!": "Ob Code im Windows Subsystem für Linux ausgeführt werden soll. Wenn Sie WSL nicht installiert haben, aktivieren Sie dies nicht!",
  "[Experimental] Persistent Output": "[Experimentell] Persistente Ausgabe",
  "If enabled, the output of the code block is written into the markdown file. This feature is experimental and may not work as expected.": "Wenn aktiviert, wird die Ausgabe des Codeblocks in die Markdown-Datei geschrieben. Diese Funktion ist experimentell und funktioniert möglicherweise nicht wie erwartet.",
  "Language-Specific Settings": "Sprachspezifische Einstellungen",
  "Pick a language to edit its language-specific settings": "Wählen Sie eine Sprache aus, um ihre sprachspezifischen Einstellungen zu bearbeiten",
  "JavaScript / Node Settings": "JavaScript / Node-Einstellungen",
  "Node path": "Node-Pfad",
  "Node arguments": "Node-Argumente",
  "Run Javascript blocks in Notebook Mode": "JavaScript-Blöcke im Notebook-Modus ausführen",
  "Inject Javascript code": "JavaScript-Code injizieren",
  "Code to add to the top of every Javascript code block before running.": "Code, der vor der Ausführung am Anfang jedes JavaScript-Codeblocks hinzugefügt wird.",
  "TypeScript Settings": "TypeScript-Einstellungen",
  "ts-node path": "ts-node-Pfad",
  "TypeScript arguments": "TypeScript-Argumente",
  "Inject Typescript code": "TypeScript-Code injizieren",
  "Code to add to the top of every Typescript code block before running.": "Code, der vor der Ausführung am Anfang jedes TypeScript-Codeblocks hinzugefügt wird.",
  "Lean Settings": "Lean-Einstellungen",
  "lean path": "Lean-Pfad",
  "Lean arguments": "Lean-Argumente",
  "Inject Lean code": "Lean-Code injizieren",
  "Code to add to the top of every Lean code block before running.": "Code, der vor der Ausführung am Anfang jedes Lean-Codeblocks hinzugefügt wird.",
  "Lua Settings": "Lua-Einstellungen",
  "lua path": "Lua-Pfad",
  "Lua arguments": "Lua-Argumente",
  "Inject Lua code": "Lua-Code injizieren",
  "Code to add to the top of every Lua code block before running.": "Code, der vor der Ausführung am Anfang jedes Lua-Codeblocks hinzugefügt wird.",
  "Dart Settings": "Dart-Einstellungen",
  "dart path": "Dart-Pfad",
  "Dart arguments": "Dart-Argumente",
  "Inject Dart code": "Dart-Code injizieren",
  "Code to add to the top of every Dart code block before running.": "Code, der vor der Ausführung am Anfang jedes Dart-Codeblocks hinzugefügt wird.",
  "CSharp Settings": "CSharp-Einstellungen",
  "dotnet path": "dotnet-Pfad",
  "CSharp arguments": "CSharp-Argumente",
  "Inject C# code": "C#-Code injizieren",
  "Code to add to the top of every C# code block before running.": "Code, der vor der Ausführung am Anfang jedes C#-Codeblocks hinzugefügt wird.",
  "Java Settings": "Java-Einstellungen",
  "Java path (Java 11 or higher)": "Java-Pfad (Java 11 oder höher)",
  "The path to your Java installation.": "Der Pfad zu Ihrer Java-Installation.",
  "Java arguments": "Java-Argumente",
  "Inject Java code": "Java-Code injizieren",
  "Code to add to the top of every Java code block before running.": "Code, der vor der Ausführung am Anfang jedes Java-Codeblocks hinzugefügt wird.",
  "Python Settings": "Python-Einstellungen",
  "Embed Python Plots": "Python-Plots einbetten",
  "Python path": "Python-Pfad",
  "The path to your Python installation.": "Der Pfad zu Ihrer Python-Installation.",
  "Python arguments": "Python-Argumente",
  "Run Python blocks in Notebook Mode": "Python-Blöcke im Notebook-Modus ausführen",
  "Inject Python code": "Python-Code injizieren",
  "Code to add to the top of every Python code block before running.": "Code, der vor der Ausführung am Anfang jedes Python-Codeblocks hinzugefügt wird.",
  "Golang Settings": "Golang-Einstellungen",
  "Golang Path": "Golang-Pfad",
  "The path to your Golang installation.": "Der Pfad zu Ihrer Golang-Installation.",
  "Inject Golang code": "Golang-Code injizieren",
  "Code to add to the top of every Golang code block before running.": "Code, der vor der Ausführung am Anfang jedes Golang-Codeblocks hinzugefügt wird.",
  "Rust Settings": "Rust-Einstellungen",
  "Cargo Path": "Cargo-Pfad",
  "The path to your Cargo installation.": "Der Pfad zu Ihrer Cargo-Installation.",
  "Inject Rust code": "Rust-Code injizieren",
  "Code to add to the top of every Rust code block before running.": "Code, der vor der Ausführung am Anfang jedes Rust-Codeblocks hinzugefügt wird.",
  "C++ Settings": "C++-Einstellungen",
  "Cling path": "Cling-Pfad",
  "The path to your Cling installation.": "Der Pfad zu Ihrer Cling-Installation.",
  "Cling arguments for C++": "Cling-Argumente für C++",
  "Cling std": "Cling-Standard",
  "C++ 98": "C++ 98",
  "C++ 11": "C++ 11",
  "C++ 14": "C++ 14",
  "C++ 17": "C++ 17",
  "C++ 20": "C++ 20",
  "Use main function": "Hauptfunktion verwenden",
  "If enabled, will use a main() function as the code block entrypoint.": "Wenn aktiviert, wird eine main()-Funktion als Einstiegspunkt des Codeblocks verwendet.",
  "Inject C++ code": "C++-Code injizieren",
  "Code to add to the top of every C++ code block before running.": "Code, der vor der Ausführung am Anfang jedes C++-Codeblocks hinzugefügt wird.",
  "C Settings": "C-Einstellungen",
  "gcc / Cling path": "gcc / Cling-Pfad",
  "The path to your gcc / Cling installation.": "Der Pfad zu Ihrer gcc / Cling-Installation.",
  "gcc / Cling arguments for C": "gcc / Cling-Argumente für C",
  "Cling std (ignored for gcc)": "Cling-Standard (wird für gcc ignoriert)",
  "Use main function (mandatory for gcc)": "Hauptfunktion verwenden (obligatorisch für gcc)",
  "Inject C code": "C-Code injizieren",
  "Code to add to the top of every C code block before running.": "Code, der vor der Ausführung am Anfang jedes C-Codeblocks hinzugefügt wird.",
  "Batch Settings": "Batch-Einstellungen",
  "Batch path": "Batch-Pfad",
  "The path to the terminal. Default is command prompt.": "Der Pfad zum Terminal. Standard ist die Eingabeaufforderung.",
  "Batch arguments": "Batch-Argumente",
  "Batch file extension": "Batch-Dateierweiterung",
  "Changes the file extension for generated batch scripts. Default is .bat": "Ändert die Dateierweiterung für generierte Batch-Skripte. Standard ist .bat",
  "Inject Batch code": "Batch-Code injizieren",
  "Code to add to the top of every Batch code block before running.": "Code, der vor der Ausführung am Anfang jedes Batch-Codeblocks hinzugefügt wird.",
  "Shell Settings": "Shell-Einstellungen",
  "Shell path": "Shell-Pfad",
  "The path to shell. Default is Bash but you can use any shell you want, e.g. bash, zsh, fish, ...": "Der Pfad zur Shell. Standard ist Bash, aber Sie können jede gewünschte Shell verwenden, z.B. bash, zsh, fish, ...",
  "Shell arguments": "Shell-Argumente",
  "Shell file extension": "Shell-Dateierweiterung",
  "Changes the file extension for generated shell scripts. This is useful if you want to use a shell other than bash.": "Ändert die Dateierweiterung für generierte Shell-Skripte. Dies ist nützlich, wenn Sie eine andere Shell als bash verwenden möchten.",
  "Shell WSL mode": "Shell-WSL-Modus",
  "Run the shell script in Windows Subsystem for Linux. This option is used if the global \"WSL Mode\" is disabled.": "Führt das Shell-Skript im Windows Subsystem für Linux aus. Diese Option wird verwendet, wenn der globale \"WSL-Modus\" deaktiviert ist.",
  "Inject Shell code": "Shell-Code injizieren",
  "Code to add to the top of every Shell code block before running.": "Code, der vor der Ausführung am Anfang jedes Shell-Codeblocks hinzugefügt wird.",
  "Powershell Settings": "Powershell-Einstellungen",
  "Powershell path": "Powershell-Pfad",
  "The path to Powershell.": "Der Pfad zu Powershell.",
  "Powershell arguments": "Powershell-Argumente",
  "Powershell file extension": "Powershell-Dateierweiterung",
  "Changes the file extension for generated shell scripts. This is useful if you don't want to use PowerShell.": "Ändert die Dateierweiterung für generierte Shell-Skripte. Dies ist nützlich, wenn Sie PowerShell nicht verwenden möchten.",
  "PowerShell script encoding": "PowerShell-Skript-Kodierung",
  "Windows still uses windows-1252 as default encoding on most systems for legacy reasons. If you change your encodings systemwide to UTF-8, you can change this setting to UTF-8 as well. Only use one of the following encodings: \"ascii\", \"utf8\", \"utf-8\", \"utf16le\", \"ucs2\", \"ucs-2\", \"base64\", \"latin1\", \"binary\", \"hex\" (default: \"latin1\")": "Windows verwendet aus Kompatibilitätsgründen auf den meisten Systemen noch windows-1252 als Standardkodierung. Wenn Sie Ihre Kodierungen systemweit auf UTF-8 umstellen, können Sie diese Einstellung ebenfalls auf UTF-8 ändern. Verwenden Sie nur eine der folgenden Kodierungen: \"ascii\", \"utf8\", \"utf-8\", \"utf16le\", \"ucs2\", \"ucs-2\", \"base64\", \"latin1\", \"binary\", \"hex\" (Standard: \"latin1\")",
  "Inject Powershell code": "Powershell-Code injizieren",
  "Code to add to the top of every Powershell code block before running.": "Code, der vor der Ausführung am Anfang jedes Powershell-Codeblocks hinzugefügt wird.",
  "Prolog Settings": "Prolog-Einstellungen",
  "Prolog Answer Limit": "Prolog-Antwortlimit",
  "Maximal number of answers to be returned by the Prolog engine. tab is to prevent creating too huge texts in the notebook.": "Maximale Anzahl von Antworten, die von der Prolog-Engine zurückgegeben werden sollen. Tab verhindert das Erstellen zu großer Texte im Notizbuch.",
  "Inject Prolog code": "Prolog-Code injizieren",
  "Code to add to the top of every Prolog code block before running.": "Code, der vor der Ausführung am Anfang jedes Prolog-Codeblocks hinzugefügt wird.",
  "Groovy Settings": "Groovy-Einstellungen",
  "Groovy path": "Groovy-Pfad",
  "The path to your Groovy installation.": "Der Pfad zu Ihrer Groovy-Installation.",
  "Groovy arguments": "Groovy-Argumente",
  "Inject Groovy code": "Groovy-Code injizieren",
  "Code to add to the top of every Groovy code block before running.": "Code, der vor der Ausführung am Anfang jedes Groovy-Codeblocks hinzugefügt wird.",
  "R Settings": "R-Einstellungen",
  "Embed R Plots created via `plot()` into Notes": "R-Plots, die über `plot()` erstellt wurden, in Notizen einbetten",
  "Rscript path": "Rscript-Pfad",
  "The path to your Rscript installation. Ensure you provide the Rscript binary instead of the ordinary R binary.": "Der Pfad zu Ihrer Rscript-Installation. Stellen Sie sicher, dass Sie die Rscript-Binärdatei anstelle der normalen R-Binärdatei angeben.",
  "R arguments": "R-Argumente",
  "Run R blocks in Notebook Mode": "R-Blöcke im Notizbuch-Modus ausführen",
  "Inject R code": "R-Code injizieren",
  "Code to add to the top of every R code block before running.": "Code, der vor der Ausführung am Anfang jedes R-Codeblocks hinzugefügt wird.",
  "Kotlin Settings": "Kotlin-Einstellungen",
  "Kotlin path": "Kotlin-Pfad",
  "The path to your Kotlin installation.": "Der Pfad zu Ihrer Kotlin-Installation.",
  "Kotlin arguments": "Kotlin-Argumente",
  "Inject Kotlin code": "Kotlin-Code injizieren",
  "Code to add to the top of every Kotlin code block before running.": "Code, der vor der Ausführung am Anfang jedes Kotlin-Codeblocks hinzugefügt wird.",
  "Wolfram Mathematica Settings": "Wolfram Mathematica-Einstellungen",
  "Mathematica path": "Mathematica-Pfad",
  "The path to your Mathematica installation.": "Der Pfad zu Ihrer Mathematica-Installation.",
  "Mathematica arguments": "Mathematica-Argumente",
  "Inject Mathematica code": "Mathematica-Code injizieren",
  "Code to add to the top of every Mathematica code block before running.": "Code, der vor der Ausführung am Anfang jedes Mathematica-Codeblocks hinzugefügt wird.",
  "Haskell Settings": "Haskell-Einstellungen",
  "Use Ghci": "Ghci verwenden",
  "Run haskell code with ghci instead of runghc": "Haskell-Code mit ghci anstelle von runghc ausführen",
  "Ghci path": "Ghci-Pfad",
  "The path to your ghci installation.": "Der Pfad zu Ihrer ghci-Installation.",
  "Rungch path": "Rungch-Pfad",
  "The path to your runghc installation.": "Der Pfad zu Ihrer runghc-Installation.",
  "Ghc path": "Ghc-Pfad",
  "The Ghc path your runghc installation will call.": "Der Ghc-Pfad, den Ihre runghc-Installation aufrufen wird.",
  "Inject Haskell code": "Haskell-Code injizieren",
  "Code to add to the top of every Haskell code block before running.": "Code, der vor der Ausführung am Anfang jedes Haskell-Codeblocks hinzugefügt wird.",
  "Scala Settings": "Scala-Einstellungen",
  "scala path": "Scala-Pfad",
  "Path to your scala installation": "Pfad zu Ihrer Scala-Installation",
  "Scala arguments": "Scala-Argumente",
  "Inject Scala code": "Scala-Code injizieren",
  "Code to add to the top of every Scala code block before running.": "Code, der vor der Ausführung am Anfang jedes Scala-Codeblocks hinzugefügt wird.",
  "Swift Settings": "Swift-Einstellungen",
  "Swift path": "Swift-Pfad",
  "The path to your Swift installation.": "Der Pfad zu Ihrer Swift-Installation.",
  "Swift arguments": "Swift-Argumente",
  "Inject Swift code": "Swift-Code injizieren",
  "Code to add to the top of every Swift code block before running.": "Code, der vor der Ausführung am Anfang jedes Swift-Codeblocks hinzugefügt wird.",
  "Racket Settings": "Racket-Einstellungen",
  "racket path": "Racket-Pfad",
  "Path to your racket installation": "Pfad zu Ihrer Racket-Installation",
  "Racket arguments": "Racket-Argumente",
  "Inject Racket code": "Racket-Code injizieren",
  "Code to add to the top of every Racket code block before running.": "Code, der vor der Ausführung am Anfang jedes Racket-Codeblocks hinzugefügt wird.",
  "F# Settings": "F#-Einstellungen",
  "F# path": "F#-Pfad",
  "The path to dotnet.": "Der Pfad zu dotnet.",
  "F# arguments": "F#-Argumente",
  "F# file extension": "F#-Dateierweiterung",
  "Changes the file extension for generated F# scripts.": "Ändert die Dateierweiterung für generierte F#-Skripte.",
  "Inject F# code": "F#-Code injizieren",
  "Code to add to the top of every F# code block before running.": "Code, der vor der Ausführung am Anfang jedes F#-Codeblocks hinzugefügt wird.",
  "Ruby Settings": "Ruby-Einstellungen",
  "ruby path": "Ruby-Pfad",
  "Path to your ruby installation": "Pfad zu Ihrer Ruby-Installation",
  "ruby arguments": "Ruby-Argumente",
  "Inject Ruby code": "Ruby-Code injizieren",
  "Code to add to the top of every Ruby code block before running.": "Code, der vor der Ausführung am Anfang jedes Ruby-Codeblocks hinzugefügt wird.",
  "SQL Settings": "SQL-Einstellungen",
  "SQL path": "SQL-Pfad",
  "Path to your SQL installation. You can select the SQL dialect you prefer but you need to set the right arguments by yourself.": "Pfad zu Ihrer SQL-Installation. Sie können den gewünschten SQL-Dialekt auswählen, müssen aber die richtigen Argumente selbst festlegen.",
  "SQL arguments": "SQL-Argumente",
  "Set the right arguments for your database.": "Legen Sie die richtigen Argumente für Ihre Datenbank fest.",
  "Inject SQL code": "SQL-Code injizieren",
  "Code to add to the top of every SQL code block before running.": "Code, der vor der Ausführung am Anfang jedes SQL-Codeblocks hinzugefügt wird.",
  "Octave Settings": "Octave-Einstellungen",
  "Octave path": "Octave-Pfad",
  "The path to your Octave installation.": "Der Pfad zu Ihrer Octave-Installation.",
  "Octave arguments": "Octave-Argumente",
  "Inject Octave code": "Octave-Code injizieren",
  "Code to add to the top of every Octave code block before running.": "Code, der vor der Ausführung am Anfang jedes Octave-Codeblocks hinzugefügt wird.",
  "Maxima Settings": "Maxima-Einstellungen",
  "Maxima path": "Maxima-Pfad",
  "The path to your Maxima installation.": "Der Pfad zu Ihrer Maxima-Installation.",
  "Maxima arguments": "Maxima-Argumente",
  "Inject Maxima code": "Maxima-Code injizieren",
  "Code to add to the top of every Maxima code block before running.": "Code, der vor der Ausführung am Anfang jedes Maxima-Codeblocks hinzugefügt wird.",
  "Applescript Settings": "Applescript-Einstellungen",
  "Osascript path": "Osascript-Pfad",
  "The path to your osascript installation (only available on MacOS).": "Der Pfad zu Ihrer osascript-Installation (nur verfügbar unter MacOS).",
  "Applescript arguments": "Applescript-Argumente",
  "Inject Applescript code": "Applescript-Code injizieren",
  "Code to add to the top of every Applescript code block before running.": "Code, der vor der Ausführung am Anfang jedes Applescript-Codeblocks hinzugefügt wird.",
  "Zig Settings": "Zig-Einstellungen",
  "zig path": "Zig-Pfad",
  "Path to your zig installation": "Pfad zu Ihrer Zig-Installation",
  "zig arguments": "Zig-Argumente",
  "Inject Zig code": "Zig-Code injizieren",
  "Code to add to the top of every Zig code block before running.": "Code, der vor der Ausführung am Anfang jedes Zig-Codeblocks hinzugefügt wird.",
  "OCaml Settings": "OCaml-Einstellungen",
  "ocaml path": "OCaml-Pfad",
  "Path to your ocaml installation": "Pfad zu Ihrer OCaml-Installation",
  "ocaml arguments": "OCaml-Argumente",
  "Inject OCaml code": "OCaml-Code injizieren",
  "Code to add to the top of every OCaml code block before running.": "Code, der vor der Ausführung am Anfang jedes OCaml-Codeblocks hinzugefügt wird.",
  "PHP Settings": "PHP-Einstellungen",
  "php path": "PHP-Pfad",
  "Path to your php installation": "Pfad zu Ihrer PHP-Installation",
  "php arguments": "PHP-Argumente",
  "Inject PHP code": "PHP-Code injizieren",
  "Code to add to the top of every PHP code block before running.": "Code, der vor der Ausführung am Anfang jedes PHP-Codeblocks hinzugefügt wird.",
  "Fast Attachment Cleaner Settings": "Schnelle Anhang-Bereiniger-Einstellungen",
  "Deleted Attachment Destination": "Ziel für gelöschte Anhänge",
  "Select where you want Attachments to be moved once they are deleted": "Wählen Sie aus, wohin Anhänge verschoben werden sollen, wenn sie gelöscht werden",
  "Delete Permanently": "Dauerhaft löschen",
  "Move to Obsidian Trash": "In den Obsidian-Papierkorb verschieben",
  "Move to System Trash": "In den System-Papierkorb verschieben",
  "Automatic": "Automatisch",
  "Split timers for automatic commit and sync": "Getrennte Timer für automatisches Commit und Sync",
  "Enable to use one interval for commit and another for sync.": "Aktivieren Sie dies, um ein Intervall für Commit und ein anderes für Sync zu verwenden.",
  "Auto commit interval (minutes)": "Automatisches Commit-Intervall (Minuten)",
  "Commit changes every X minutes. Set to 0 (default) to disable. (See below setting for further configuration!)": "Änderungen alle X Minuten committen. Auf 0 (Standard) setzen zum Deaktivieren. (Siehe Einstellung unten für weitere Konfiguration!)",
  "Auto commit after stopping file edits": "Automatisches Commit nach Beenden der Dateibearbeitung",
  "Requires the commit interval not to be 0.\n                        If turned on, do auto commit every 30 minutes after stopping file edits.\n                        This also prevents auto commit while editing a file. If turned off, it's independent from the last file edit.": "Erfordert, dass das Commit-Intervall nicht 0 ist.\n                        Wenn aktiviert, wird alle 30 Minuten nach Beenden der Dateibearbeitung ein automatisches Commit durchgeführt.\n                        Dies verhindert auch automatische Commits während der Bearbeitung einer Datei. Wenn deaktiviert, ist es unabhängig von der letzten Dateibearbeitung.",
  "Auto commit after latest commit": "Automatisches Commit nach dem letzten Commit",
  "If turned on, sets last auto commit timestamp to the latest commit timestamp. This reduces the frequency of auto commit when doing manual commits.": "Wenn aktiviert, wird der Zeitstempel des letzten automatischen Commits auf den Zeitstempel des neuesten Commits gesetzt. Dies reduziert die Häufigkeit automatischer Commits bei manuellen Commits.",
  "Auto push interval (minutes)": "Automatisches Push-Intervall (Minuten)",
  "Push commits every X minutes. Set to 0 (default) to disable.": "Commits alle X Minuten pushen. Auf 0 (Standard) setzen zum Deaktivieren.",
  "Auto pull interval (minutes)": "Automatisches Pull-Intervall (Minuten)",
  "Pull changes every X minutes. Set to 0 (default) to disable.": "Änderungen alle X Minuten pullen. Auf 0 (Standard) setzen zum Deaktivieren.",
  "Specify custom commit message on auto commit": "Benutzerdefinierte Commit-Nachricht bei automatischem Commit angeben",
  "You will get a pop up to specify your message.": "Sie erhalten ein Popup, um Ihre Nachricht anzugeben.",
  "Commit message on auto commit": "Commit-Nachricht bei automatischem Commit",
  "Available placeholders: {{date}} (see below), {{hostname}} (see below), {{numFiles}} (number of changed files in the commit) and {{files}} (changed files in commit message).": "Verfügbare Platzhalter: {{date}} (siehe unten), {{hostname}} (siehe unten), {{numFiles}} (Anzahl der geänderten Dateien im Commit) und {{files}} (geänderte Dateien in der Commit-Nachricht).",
  "Commit message": "Commit-Nachricht",
  "Commit message on manual commit": "Commit-Nachricht bei manuellem Commit",
  "{{date}} placeholder format": "{{date}} Platzhalter-Format",
  "Moment.js": "Moment.js",
  "{{hostname}} placeholder replacement": "{{hostname}} Platzhalter-Ersetzung",
  "Specify custom hostname for every device.": "Geben Sie für jedes Gerät einen benutzerdefinierten Hostnamen an.",
  "Preview commit message": "Commit-Nachricht Vorschau",
  "Preview": "Vorschau",
  "List filenames affected by commit in the commit body": "Dateinamen auflisten, die vom Commit im Commit-Text betroffen sind",
  "Pull": "Abrufen",
  "Merge strategy": "Merge-Strategie",
  "Decide how to integrate commits from your remote branch into your local branch.": "Entscheiden Sie, wie Commits aus Ihrem Remote-Branch in Ihren lokalen Branch integriert werden sollen.",
  "Merge": "Zusammenführen",
  "Rebase": "Rebase",
  "Other sync service (Only updates the HEAD without touching the working directory)": "Anderer Sync-Dienst (Aktualisiert nur den HEAD ohne das Arbeitsverzeichnis zu berühren)",
  "Pull on startup": "Pull beim Start",
  "Automatically pull commits when Obsidian starts.": "Automatisch Commits abrufen, wenn Obsidian startet.",
  "Commit-and-sync": "Commit und Sync",
  "Commit-and-sync with default settings means staging everything -> committing -> pulling -> pushing. Ideally this is a single action that you do regularly to keep your local and remote repository in sync.": "Commit-and-sync mit Standardeinstellungen bedeutet alles stagen -> committen -> pullen -> pushen. Idealerweise ist dies eine einzelne Aktion, die Sie regelmäßig ausführen, um Ihr lokales und Remote-Repository synchron zu halten.",
  "Push on commit-and-sync": "Push bei Commit-and-sync",
  "Most of the time you want to push after committing. Turning this off turns a commit-and-sync action into commit only. It will still be called commit-and-sync.": "Meistens möchten Sie nach dem Commit pushen. Wenn Sie dies deaktivieren, wird aus einer Commit-and-sync-Aktion nur ein Commit. Es wird weiterhin als Commit-and-sync bezeichnet.",
  "Pull on commit-and-sync": "Pull bei Commit-and-sync",
  "On commit-and-sync, pull commits as well. Turning this off turns a commit-and-sync action into commit only.": "Bei Commit-and-sync auch Commits pullen. Wenn Sie dies deaktivieren, wird aus einer Commit-and-sync-Aktion nur ein Commit.",
  "Line author information": "Zeilen-Autorinformationen",
  "Show commit authoring information next to each line": "Commit-Autorinformationen neben jeder Zeile anzeigen",
  "Feature guide and quick examples": "Funktionsanleitung und Schnellbeispiele",
  "History view": "Verlaufsansicht",
  "Show Author": "Autor anzeigen",
  "Show the author of the commit in the history view.": "Den Autor des Commits in der Verlaufsansicht anzeigen.",
  "Hide": "Ausblenden",
  "Full": "Vollständig",
  "Initials": "Initialen",
  "Show Date": "Datum anzeigen",
  "Show the date of the commit in the history view. The {{date}} placeholder format is used to display the date.": "Das Datum des Commits in der Verlaufsansicht anzeigen. Das {{date}} Platzhalterformat wird verwendet, um das Datum anzuzeigen.",
  "Source control view": "Quellcodeverwaltungsansicht",
  "Automatically refresh source control view on file changes": "Quellcodeverwaltungsansicht bei Dateiänderungen automatisch aktualisieren",
  "On slower machines this may cause lags. If so, just disable this option.": "Auf langsameren Maschinen kann dies zu Verzögerungen führen. Deaktivieren Sie in diesem Fall diese Option.",
  "Source control view refresh interval": "Aktualisierungsintervall der Quellcodeverwaltungsansicht",
  "Milliseconds to wait after file change before refreshing the Source Control View.": "Millisekunden, die nach einer Dateiänderung gewartet werden soll, bevor die Quellcodeverwaltungsansicht aktualisiert wird.",
  "Miscellaneous": "Verschiedenes",
  "Disable notifications": "Benachrichtigungen deaktivieren",
  "Disable notifications for git operations to minimize distraction (refer to status bar for updates). Errors are still shown as notifications even if you enable this setting.": "Benachrichtigungen für Git-Operationen deaktivieren, um Ablenkungen zu minimieren (siehe Statusleiste für Updates). Fehler werden weiterhin als Benachrichtigungen angezeigt, auch wenn Sie diese Einstellung aktivieren.",
  "Hide notifications for no changes": "Benachrichtigungen bei keinen Änderungen ausblenden",
  "Don't show notifications when there are no changes to commit or push.": "Keine Benachrichtigungen anzeigen, wenn es keine Änderungen zum Committen oder Pushen gibt.",
  "Show status bar": "Statusleiste anzeigen",
  "Obsidian must be restarted for the changes to take affect.": "Obsidian muss neu gestartet werden, damit die Änderungen wirksam werden.",
  "Show stage/unstage button in file menu": "Stage/Unstage-Button im Dateimenü anzeigen",
  "Show branch status bar": "Branch-Statusleiste anzeigen",
  "Show the count of modified files in the status bar": "Anzahl der geänderten Dateien in der Statusleiste anzeigen",
  "Commit author": "Commit-Autor",
  "Author name for commit": "Autorname für Commit",
  "Author email for commit": "Autor-E-Mail für Commit",
  "Advanced": "Erweitert",
  "These settings usually don't need to be changed, but may be requried for special setups.": "Diese Einstellungen müssen normalerweise nicht geändert werden, können aber für spezielle Setups erforderlich sein.",
  "Update submodules": "Submodule aktualisieren",
  "\"Commit-and-sync\" and \"pull\" takes care of submodules. Missing features: Conflicted files, count of pulled/pushed/committed files. Tracking branch needs to be set for each submodule.": "\"Commit-and-sync\" und \"pull\" kümmern sich um Submodule. Fehlende Funktionen: Konfliktdateien, Anzahl der gepullten/gepushten/committeten Dateien. Tracking-Branch muss für jedes Submodul eingestellt werden.",
  "Custom Git binary path": "Benutzerdefinierter Git-Binärpfad",
  "Additional environment variables": "Zusätzliche Umgebungsvariablen",
  "Use each line for a new environment variable in the format KEY=VALUE .": "Verwenden Sie jede Zeile für eine neue Umgebungsvariable im Format SCHLÜSSEL=WERT .",
  "Additional PATH environment variable paths": "Zusätzliche PATH-Umgebungsvariablenpfade",
  "Use each line for one path": "Verwenden Sie jede Zeile für einen Pfad",
  "Reload with new environment variables": "Mit neuen Umgebungsvariablen neu laden",
  "Removing previously added environment variables will not take effect until Obsidian is restarted.": "Das Entfernen zuvor hinzugefügter Umgebungsvariablen wird erst wirksam, wenn Obsidian neu gestartet wird.",
  "Reload": "Neu laden",
  "Custom base path (Git repository path)": "Benutzerdefinierter Basispfad (Git-Repository-Pfad)",
  "Sets the relative path to the vault from which the Git binary should be executed.\n             Mostly used to set the path to the Git repository, which is only required if the Git repository is below the vault root directory. Use \"\\\" instead of \"/\" on Windows.": "Legt den relativen Pfad zum Tresor fest, von dem aus die Git-Binärdatei ausgeführt werden soll.\n             Wird hauptsächlich verwendet, um den Pfad zum Git-Repository festzulegen, was nur erforderlich ist, wenn sich das Git-Repository unterhalb des Tresor-Stammverzeichnisses befindet. Verwenden Sie unter Windows \"\\\" anstelle von \"/\".",
  "Custom Git directory path (Instead of '.git')": "Benutzerdefinierter Git-Verzeichnispfad (Anstelle von '.git')",
  "Requires restart of Obsidian to take effect. Use \"\\\" instead of \"/\" on Windows.": "Erfordert einen Neustart von Obsidian, um wirksam zu werden. Verwenden Sie unter Windows \"\\\" anstelle von \"/\".",
  "Disable on this device": "Auf diesem Gerät deaktivieren",
  "Disables the plugin on this device. This setting is not synced.": "Deaktiviert das Plugin auf diesem Gerät. Diese Einstellung wird nicht synchronisiert.",
  "Support": "Unterstützung",
  "Donate": "Spenden",
  "If you like this Plugin, consider donating to support continued development.": "Wenn Ihnen dieses Plugin gefällt, erwägen Sie eine Spende zur Unterstützung der weiteren Entwicklung.",
  "Copy Debug Information": "Debug-Informationen kopieren",
  "Debugging and logging:\nYou can always see the logs of this and every other plugin by opening the console with": "Debugging und Protokollierung:\nSie können die Protokolle dieses und jedes anderen Plugins immer sehen, indem Sie die Konsole öffnen mit",
  "CTRL + SHIFT + I": "STRG + UMSCHALT + I",
  "Tags": "Tags",
  "Move tags to card footer": "Tags in die Kartenfußzeile verschieben",
  "When toggled, tags will be displayed in the card's footer instead of the card's body.": "Wenn aktiviert, werden Tags in der Kartenfußzeile anstatt im Karteninhalt angezeigt.",
  "Tag click action": "Tag-Klickaktion",
  "This setting controls whether clicking the tags displayed below the card title opens the Obsidian search or the Kanban board search.": "Diese Einstellung steuert, ob das Klicken auf die unter dem Kartentitel angezeigten Tags die Obsidian-Suche oder die Kanban-Board-Suche öffnet.",
  "Search Kanban Board": "Kanban-Board durchsuchen",
  "Search Obsidian Vault": "Obsidian-Tresor durchsuchen",
  "Tag sort order": "Tag-Sortierreihenfolge",
  "Set an explicit sort order for the specified tags.": "Legen Sie eine explizite Sortierreihenfolge für die angegebenen Tags fest.",
  "Add tag": "Tag hinzufügen",
  "Tag colors": "Tag-Farben",
  "Set colors for tags displayed in cards.": "Legen Sie Farben für Tags fest, die in Karten angezeigt werden.",
  "Add tag color": "Tag-Farbe hinzufügen",
  "Move dates to card footer": "Daten in die Kartenfußzeile verschieben",
  "When toggled, dates will be displayed in the card's footer instead of the card's body.": "Wenn aktiviert, werden Daten in der Kartenfußzeile anstatt im Karteninhalt angezeigt.",
  "When toggled, cards will display the distance between today and the card's date. eg. 'In 3 days', 'A month ago'. Relative dates will not be shown for dates from the Tasks and Dataview plugins.": "Wenn aktiviert, zeigen Karten den Abstand zwischen heute und dem Kartendatum an. z.B. 'In 3 Tagen', 'Vor einem Monat'. Relative Daten werden nicht für Daten aus den Tasks- und Dataview-Plugins angezeigt.",
  "Display date colors": "Datumsfarben anzeigen",
  "Set colors for dates displayed in cards based on the rules below.": "Legen Sie Farben für Daten fest, die in Karten basierend auf den untenstehenden Regeln angezeigt werden.",
  "Add date color": "Datumsfarbe hinzufügen",
  "Add archive date/time after card title": "Archivdatum/-zeit nach Kartentitel hinzufügen",
  "When toggled, the archived date/time will be added after the card title, e.g.- [ ] My card title 2021-05-14 10:00am. By default, it is inserted before the title.": "Wenn aktiviert, wird das Archivdatum/-zeit nach dem Kartentitel hinzugefügt, z.B.- [ ] Mein Kartentitel 2021-05-14 10:00. Standardmäßig wird es vor dem Titel eingefügt.",
  "Inline Metadata": "Inline-Metadaten",
  "Inline metadata position": "Position der Inline-Metadaten",
  "Controls where the inline metadata (from the Dataview plugin) will be displayed.": "Steuert, wo die Inline-Metadaten (vom Dataview-Plugin) angezeigt werden.",
  "Card body": "Karteninhalt",
  "Card footer": "Kartenfußzeile",
  "Merge with linked page metadata": "Mit verknüpften Seiten-Metadaten zusammenführen",
  "Move task data to card footer": "Aufgabendaten in die Kartenfußzeile verschieben",
  "When toggled, task data (from the Tasks plugin) will be displayed in the card's footer instead of the card's body.": "Wenn aktiviert, werden Aufgabendaten (vom Tasks-Plugin) in der Kartenfußzeile anstatt im Karteninhalt angezeigt.",
  "Board view": "Board-Ansicht",
  "Command settings": "Befehlseinstellungen",
  "General": "Allgemein",
  "Autoselect upon creating a link": "Automatische Auswahl beim Erstellen eines Links",
  "Autoselect a word under the cursor when creating a link.": "Ein Wort unter dem Cursor automatisch auswählen, wenn ein Link erstellt wird.",
  "Skip Frontmatter": "Frontmatter überspringen",
  "Skip Frontmatter in note wide commands.": "Frontmatter in notizweiten Befehlen überspringen.",
  "Title separator": "Titeltrenner",
  "String used as headings separator in 'Set link text' command.": "Zeichenkette, die als Überschriftentrenner im Befehl 'Link-Text festlegen' verwendet wird.",
  "Remove links from headings": "Links aus Überschriften entfernen",
  "Internal wikilink without text": "Interner Wikilink ohne Text",
  "Remove": "Entfernen",
  "Replace with destination": "Durch Ziel ersetzen",
  "Replace with lowest heading": "Durch niedrigste Überschrift ersetzen",
  "Delete link": "Link löschen",
  "Delete unreferenced link target": "Nicht referenziertes Link-Ziel löschen",
  "Convert to Markdown link": "In Markdown-Link umwandeln",
  "Append .md extension": ".md-Erweiterung anhängen",
  "docs": "Dokumentation",
  "Context menu": "Kontextmenü",
  "Edit link text": "Link-Text bearbeiten",
  "Set link text": "Link-Text festlegen",
  "Set link text from clipboard": "Link-Text aus Zwischenablage festlegen",
  "Edit link destination": "Link-Ziel bearbeiten",
  "Set link destination from clipboard": "Link-Ziel aus Zwischenablage festlegen",
  "Copy link": "Link kopieren",
  "Cut link": "Link ausschneiden",
  "Copy link destination": "Link-Ziel kopieren",
  "Copy link to element": "Link zum Element kopieren",
  "Unlink": "Link entfernen",
  "Convert to wikilink": "In Wikilink umwandeln",
  "Convert to autolink": "In Autolink umwandeln",
  "Convert to markdown link": "In Markdown-Link umwandeln",
  "Convert to HTML link": "In HTML-Link umwandeln",
  "Embed/Unembed": "Einbetten/Einbettung aufheben",
  "Delete": "Löschen",
  "Create link": "Link erstellen",
  "Create link from clipboard": "Link aus Zwischenablage erstellen",
  "Convert all links to Markdown links": "Alle Links in Markdown-Links umwandeln",
  "Convert Wikilinks to Markdown links": "Wikilinks in Markdown-Links umwandeln",
  "Convert URLs to Markdown links": "URLs in Markdown-Links umwandeln",
  "Convert Autolinks to Markdown links": "Autolinks in Markdown-Links umwandeln",
  "Convert HTML links to Markdown links": "HTML-Links in Markdown-Links umwandeln",
  "Extract section": "Abschnitt extrahieren",
  "Early access features": "Früher Zugriff auf Funktionen",
  "Almost finished features with some": "Fast fertige Funktionen mit einigen",
  "to be fixed.": "zu behebenden Problemen.",
  "Insider features": "Insider-Funktionen",
  "Incomplete features currently under development. Enable these features to": "Unvollständige Funktionen in Entwicklung. Aktivieren Sie diese Funktionen, um",
  "provide your input": "Ihre Eingabe bereitzustellen",
  "and influence the direction of development.": "und die Entwicklungsrichtung zu beeinflussen.",
  "Convert links in a folder": "Links in einem Ordner umwandeln",
  "Obsidian URL support": "Obsidian-URL-Unterstützung",
  "Chetachi 👩🏽‍💻": "Chetachi 👩🏽‍💻",
  "Notification Settings": "Benachrichtigungseinstellungen",
  "Reminder Time": "Erinnerungszeit",
  "Time when a reminder with no time part will show": "Zeit, zu der eine Erinnerung ohne Zeitangabe angezeigt wird",
  "Remind me later": "Später erinnern",
  "Line-separated list of remind me later items": "Zeilengetrennte Liste von 'Später erinnern'-Elementen",
  "Use system notification": "Systembenachrichtigung verwenden",
  "Use system notification for reminder notifications": "Systembenachrichtigung für Erinnerungsbenachrichtigungen verwenden",
  "Calendar popup trigger": "Kalender-Popup-Auslöser",
  "Trigger text to show calendar popup": "Auslösetext zum Anzeigen des Kalender-Popups",
  "Popup is enabled": "Popup ist aktiviert",
  "Primary reminder format": "Primäres Erinnerungsformat",
  "Reminder format for generated reminder by calendar popup": "Erinnerungsformat für generierte Erinnerungen durch Kalender-Popup",
  "Reminder plugin format - (@2021-09-08)": "Erinnerungs-Plugin-Format - (@2021-09-08)",
  "Tasks plugin format - 📅 2021-09-08": "Aufgaben-Plugin-Format - 📅 2021-09-08",
  "Kanban plugin format - @{2021-09-08}": "Kanban-Plugin-Format - @{2021-09-08}",
  "Reminder Format - Reminder Plugin": "Erinnerungsformat - Erinnerungs-Plugin",
  "Enable Reminder plugin format": "Erinnerungs-Plugin-Format aktivieren",
  "Example: - [ ] Task 1(@2025-01-05 12:21)": "Beispiel: - [ ] Aufgabe 1(@2025-01-05 12:21)",
  "Date format": "Datumsformat",
  "moment style date format: https://momentjs.com/docs/#/displaying/format/": "moment-Style Datumsformat: https://momentjs.com/docs/#/displaying/format/",
  "Date and time format": "Datums- und Zeitformat",
  "moment() style date time format: https://momentjs.com/docs/#/displaying/format/": "moment()-Style Datums- und Zeitformat: https://momentjs.com/docs/#/displaying/format/",
  "Strict Date format": "Striktes Datumsformat",
  "Strictly parse the date and time": "Datum und Zeit strikt analysieren",
  "Link dates to daily notes": "Daten mit Tagesnotizen verknüpfen",
  "When toggled, Dates link to daily notes.": "Wenn aktiviert, verlinken Daten zu Tagesnotizen.",
  "Reminder Format - Tasks Plugin": "Erinnerungsformat - Aufgaben-Plugin",
  "Enable Tasks plugin format": "Aufgaben-Plugin-Format aktivieren",
  "Example: - [ ] Task 1 📅 2025-01-05": "Beispiel: - [ ] Aufgabe 1 📅 2025-01-05",
  "Distinguish between reminder date and due date": "Zwischen Erinnerungsdatum und Fälligkeitsdatum unterscheiden",
  "Use custom emoji ⏰ instead of 📅 and distinguish between reminder date/time and Tasks Plugin's due date.": "Benutzerdefiniertes Emoji ⏰ anstelle von 📅 verwenden und zwischen Erinnerungsdatum/-zeit und Fälligkeitsdatum des Aufgaben-Plugins unterscheiden.",
  "Remove tags from reminder title": "Tags aus Erinnerungstitel entfernen",
  "If checked, tags(#xxx) are removed from the reminder list view and notification.": "Wenn aktiviert, werden Tags (#xxx) aus der Erinnerungslistenansicht und Benachrichtigung entfernt.",
  "Reminder Format - Kanban Plugin": "Erinnerungsformat - Kanban-Plugin",
  "Enable Kanban plugin format": "Kanban-Plugin-Format aktivieren",
  "Example: - [ ] Task 1 @{2025-01-05} @@{12:21}": "Beispiel: - [ ] Aufgabe 1 @{2025-01-05} @@{12:21}",
  "Edit Detection Time": "Bearbeitungserkennungszeit",
  "The minimum amount of time (in seconds) after a key is typed that it will be identified as notifiable.": "Die minimale Zeit (in Sekunden) nach der Eingabe eines Zeichens, bis es als benachrichtigungsfähig erkannt wird.",
  "Reminder check interval": "Erinnerungsprüfintervall",
  "Interval(in seconds) to periodically check whether or not you should be notified of reminders.  You will need to restart Obsidian for this setting to take effect.": "Intervall (in Sekunden) zur regelmäßigen Überprüfung, ob Sie über Erinnerungen benachrichtigt werden sollen. Sie müssen Obsidian neu starten, damit diese Einstellung wirksam wird.",
  "Import": "Importieren",
  "Export": "Exportieren",
  "Separate desktop/mobile configuration": "Separate Desktop-/Mobile-Konfiguration",
  "Enable this if you want to have different settings depending whether you're using a desktop or mobile device. All of the settings below can be configured differently on desktop and mobile. You're currently using the desktop/global settings.": "Aktivieren Sie dies, wenn Sie unterschiedliche Einstellungen haben möchten, je nachdem, ob Sie ein Desktop- oder Mobilgerät verwenden. Alle nachfolgenden Einstellungen können für Desktop und Mobile unterschiedlich konfiguriert werden. Sie verwenden derzeit die Desktop-/globalen Einstellungen.",
  "Lazy Loader settings": "Lazy-Loader-Einstellungen",
  "Short delay (seconds)": "Kurze Verzögerung (Sekunden)",
  "Long delay (seconds)": "Lange Verzögerung (Sekunden)",
  "Default startup type for new plugins": "Standard-Starttyp für neue Plugins",
  "Nothing configured": "Nichts konfiguriert",
  "⛔ Disable plugin": "⛔ Plugin deaktivieren",
  "⚡ Instant": "⚡ Sofort",
  "⌚ Short delay": "⌚ Kurze Verzögerung",
  "💤 Long delay": "💤 Lange Verzögerung",
  "Show plugin descriptions": "Plugin-Beschreibungen anzeigen",
  "Set the delay for all plugins at once": "Verzögerung für alle Plugins gleichzeitig festlegen",
  "Set all plugins to be:": "Alle Plugins einstellen auf:",
  "Plugins": "Plugins",
  "All": "Alle",
  "AttachFlow": "AttachFlow",
  "This nifty plugin enables seamless management of attachments and referenced links directly from your documents. Taking advantage of an intuitive right-click menu, you can efficiently handle resources in both LIVE and READ modes.": "Dieses praktische Plugin ermöglicht die nahtlose Verwaltung von Anhängen und referenzierten Links direkt aus Ihren Dokumenten. Mit Hilfe eines intuitiven Rechtsklick-Menüs können Sie Ressourcen sowohl im LIVE- als auch im LESE-Modus effizient verwalten.",
  "Right-click menu for attachments": "Rechtsklick-Menü für Anhänge",
  "Deleted attachment destination": "Ziel für gelöschte Anhänge",
  "Move file to...": "Datei verschieben nach...",
  "Add a \"Move to...\" option to the right-click menu for attachments": "Eine \"Verschieben nach...\"-Option zum Rechtsklick-Menü für Anhänge hinzufügen",
  "Click to view images": "Klicken zum Anzeigen von Bildern",
  "Click the right half of the image to view the image in detail.": "Klicken Sie auf die rechte Hälfte des Bildes, um es detailliert anzuzeigen.",
  "Adaptive image display ratio based on window size": "Adaptives Bildanzeigeverhältnis basierend auf der Fenstergröße",
  "When the image exceeds the window size, the image is displayed adaptively according to the window size.": "Wenn das Bild die Fenstergröße überschreitet, wird es adaptiv entsprechend der Fenstergröße angezeigt.",
  "Drag to resize images": "Ziehen zum Ändern der Bildgröße",
  "Turn on to enable drag to resize images.": "Aktivieren Sie diese Option, um die Bildgröße durch Ziehen ändern zu können.",
  "Resize interval": "Größenänderungsintervall",
  "Debug": "Debug",
  "Debug mode": "Debug-Modus",
  "Print debug information in console": "Debug-Informationen in der Konsole ausgeben",
  "Folder overview": "Ordnerübersicht",
  "Exclude folders": "Ordner ausschließen",
  "File explorer": "Datei-Explorer",
  "Path": "Pfad",
  "Folder note name": "Ordnernotizname",
  "{{folder_name}} will be replaced with the name of the folder": "{{folder_name}} wird durch den Namen des Ordners ersetzt",
  "Rename existing folder notes": "Bestehende Ordnernotizen umbenennen",
  "Default folder note type for new folder notes": "Standard-Ordnernotiztyp für neue Ordnernotizen",
  "Choose the default file type for new folder notes. (canvas, markdown, ...)": "Wählen Sie den Standard-Dateityp für neue Ordnernotizen. (Canvas, Markdown, ...)",
  "ask for file type": "nach Dateityp fragen",
  "Supported file types for folder notes": "Unterstützte Dateitypen für Ordnernotizen",
  "Custom extension": "Benutzerdefinierte Erweiterung",
  "Template path": "Vorlagenpfad",
  "Restart after changing the template path": "Nach Änderung des Vorlagenpfads neu starten",
  "Storage location": "Speicherort",
  "Choose where to store the folder notes": "Wählen Sie, wo die Ordnernotizen gespeichert werden sollen",
  "Inside the folder": "Im Ordner",
  "In the parent folder": "Im übergeordneten Ordner",
  "Switch to new storage location": "Zu neuem Speicherort wechseln",
  "Move all folder notes to the new storage location": "Alle Ordnernotizen zum neuen Speicherort verschieben",
  "Switch": "Wechseln",
  "Key for creating folder note": "Taste zum Erstellen einer Ordnernotiz",
  "The key combination to create a folder note": "Die Tastenkombination zum Erstellen einer Ordnernotiz",
  "Ctrl + Click": "Strg + Klick",
  "Alt + Click": "Alt + Klick",
  "Key for opening folder note": "Taste zum Öffnen einer Ordnernotiz",
  "Select the combination to open a folder note": "Wählen Sie die Kombination zum Öffnen einer Ordnernotiz",
  "Mouse Click": "Mausklick",
  "Sync folder name": "Ordnername synchronisieren",
  "Automatically rename the folder note when the folder name is changed": "Ordnernotiz automatisch umbenennen, wenn der Ordnername geändert wird",
  "Confirm folder note deletion": "Löschen von Ordnernotizen bestätigen",
  "Ask for confirmation before deleting a folder note": "Vor dem Löschen einer Ordnernotiz um Bestätigung bitten",
  "Deleted folder notes": "Gelöschte Ordnernotizen",
  "What happens to the folder note after you delete it": "Was mit der Ordnernotiz nach dem Löschen passiert",
  "Move to system trash": "In den Papierkorb verschieben",
  "Move to Obsidian trash (.trash folder)": "In den Obsidian-Papierkorb (.trash-Ordner) verschieben",
  "Delete permanently": "Dauerhaft löschen",
  "Open folder note in a new tab by default": "Ordnernotiz standardmäßig in neuem Tab öffnen",
  "Always open folder notes in a new tab (except when you try to open the same note) instead of having to use ctrl/cmd + click to open in a new tab": "Ordnernotizen immer in einem neuen Tab öffnen (außer wenn Sie versuchen, dieselbe Notiz zu öffnen), anstatt Strg/Cmd + Klick verwenden zu müssen",
  "Automatically create folder notes": "Ordnernotizen automatisch erstellen",
  "Automatically create a folder note when a new folder is created": "Automatisch eine Ordnernotiz erstellen, wenn ein neuer Ordner erstellt wird",
  "Enable front matter title plugin integration": "Integration des Front Matter Title Plugins aktivieren",
  "Automatically rename a folder name when the folder note is renamed": "Ordnernamen automatisch umbenennen, wenn die Ordnernotiz umbenannt wird",
  "Create folder note for every folder": "Ordnernotiz für jeden Ordner erstellen",
  "Create a folder note for every folder in the vault": "Eine Ordnernotiz für jeden Ordner im Tresor erstellen",
  "Manage folder overview defaults": "Standardeinstellungen für Ordnerübersicht verwalten",
  "Manage the default settings for the folder overview plugin": "Die Standardeinstellungen für das Ordnerübersichts-Plugin verwalten",
  "Manage": "Verwalten",
  "Manage excluded folders": "Ausgeschlossene Ordner verwalten",
  "Exclude folder default settings": "Standardeinstellungen für ausgeschlossene Ordner",
  "Exclude pattern default settings": "Standardeinstellungen für ausgeschlossene Muster",
  "Add excluded folder": "Ausgeschlossenen Ordner hinzufügen",
  "Hide folder note": "Ordnernotiz ausblenden",
  "Hide the folder note in the file explorer": "Ordnernotiz im Datei-Explorer ausblenden",
  "Don't open folder notes by clicking on the name (on mobile)": "Ordnernotizen nicht durch Klicken auf den Namen öffnen (auf Mobilgeräten)",
  "Folder notes don't open when clicking on the name of the folder (on mobile)": "Ordnernotizen öffnen sich nicht beim Klicken auf den Ordnernamen (auf Mobilgeräten)",
  "Only open folder notes through the name": "Ordnernotizen nur über den Namen öffnen",
  "Only open folder notes in the file explorer by clicking on the folder name": "Ordnernotizen im Datei-Explorer nur durch Klicken auf den Ordnernamen öffnen",
  "Disable folder collapsing": "Ordner-Einklappen deaktivieren",
  "Disable the ability to collapse folders by clicking exactly on the folder name": "Die Möglichkeit deaktivieren, Ordner durch genaues Klicken auf den Ordnernamen einzuklappen",
  "Use submenus": "Untermenüs verwenden",
  "Use submenus for file/folder commands": "Untermenüs für Datei-/Ordnerbefehle verwenden",
  "Style settings": "Stileinstellungen",
  "Hide collapse icon": "Einklapp-Symbol ausblenden",
  "Hide the collapse icon in the file explorer next to the name of a folder when a folder only contains a folder note": "Das Einklapp-Symbol im Datei-Explorer neben dem Namen eines Ordners ausblenden, wenn ein Ordner nur eine Ordnernotiz enthält",
  "Underline the name of folder notes": "Namen von Ordnernotizen unterstreichen",
  "Add an underline to folders that have a folder note in the file explorer": "Eine Unterstreichung zu Ordnern hinzufügen, die eine Ordnernotiz im Datei-Explorer haben",
  "Bold the name of folder notes": "Namen von Ordnernotizen fett darstellen",
  "Make the folder name bold in the file explorer": "Den Ordnernamen im Datei-Explorer fett darstellen",
  "Cursive the name of folder notes": "Namen von Ordnernotizen kursiv darstellen",
  "Make the folder name cursive in the file explorer": "Den Ordnernamen im Datei-Explorer kursiv darstellen",
  "Open folder note through path": "Ordnernotiz über Pfad öffnen",
  "Open a folder note when clicking on a folder name in the path if it is a folder note": "Eine Ordnernotiz öffnen, wenn auf einen Ordnernamen im Pfad geklickt wird, falls es eine Ordnernotiz ist",
  "Change folder name in the path": "Ordnernamen im Pfad ändern",
  "Automatically rename a folder name in the path above a note when the folder note is renamed": "Automatisch einen Ordnernamen im Pfad über einer Notiz umbenennen, wenn die Ordnernotiz umbenannt wird",
  "Underline folders in the path": "Ordner im Pfad unterstreichen",
  "Add an underline to folders that have a folder note in the path above a note": "Eine Unterstreichung zu Ordnern hinzufügen, die eine Ordnernotiz im Pfad über einer Notiz haben",
  "Bold folders in the path": "Ordner im Pfad fett darstellen",
  "Make the folder name bold in the path above a note": "Den Ordnernamen im Pfad über einer Notiz fett darstellen",
  "Cursive the name of folder notes in the path": "Namen von Ordnernotizen im Pfad kursiv darstellen",
  "Make the folder name cursive in the path above a note": "Den Ordnernamen im Pfad über einer Notiz kursiv darstellen",
  "Add {regex} at the beginning of the folder name to use a regex pattern.": "Fügen Sie {regex} am Anfang des Ordnernamens hinzu, um ein Regex-Muster zu verwenden.",
  "Use * before and after to exclude folders that include the name between the *s.": "Verwenden Sie * vor und nach dem Namen, um Ordner auszuschließen, die den Namen zwischen den *s enthalten.",
  "Use * before the folder name to exclude folders that end with the folder name.": "Verwenden Sie * vor dem Ordnernamen, um Ordner auszuschließen, die mit dem Ordnernamen enden.",
  "Use * after the folder name to exclude folders that start with the folder name.": "Verwenden Sie * nach dem Ordnernamen, um Ordner auszuschließen, die mit dem Ordnernamen beginnen.",
  "The regexes and wildcards are only for the folder name, not the path.": "Die Regex-Ausdrücke und Platzhalter gelten nur für den Ordnernamen, nicht für den Pfad.",
  "If you want to switch to a folder path delete the pattern first.": "Wenn Sie zu einem Ordnerpfad wechseln möchten, löschen Sie zuerst das Muster.",
  "Choose the file types that should be supported for folder notes. (e.g. if you click on a folder name it searches for all file extensions that are supported)": "Wählen Sie die Dateitypen aus, die für Ordnernotizen unterstützt werden sollen. (z.B. wenn Sie auf einen Ordnernamen klicken, sucht es nach allen unterstützten Dateierweiterungen)",
  "Adding more file types may cause performance issues becareful when adding more file types and don't add too many.": "Das Hinzufügen weiterer Dateitypen kann zu Leistungsproblemen führen. Seien Sie vorsichtig beim Hinzufügen weiterer Dateitypen und fügen Sie nicht zu viele hinzu.",
  "Requires a restart to take effect": "Erfordert einen Neustart, um wirksam zu werden",
  "Chameleon": "Chameleon",
  "Chameleon: A translation plugin for Obsidian that provides multilingual support.": "Chameleon: Ein Übersetzungs-Plugin für Obsidian, das mehrsprachige Unterstützung bietet.",
  "Folder notes": "Ordnernotizen",
  "Create notes within folders that can be accessed without collapsing the folder, similar to the functionality offered in Notion.": "Erstellen Sie Notizen innerhalb von Ordnern, auf die zugegriffen werden kann, ohne den Ordner einzuklappen, ähnlich der Funktionalität in Notion.",
  "Smart Second Brain": "Smart Second Brain",
  "Interact with your privacy focused assistant, leveraging Ollama or OpenAI, making your second brain even smarter.": "Interagieren Sie mit Ihrem datenschutzorientierten Assistenten, der Ollama oder OpenAI nutzt, um Ihr zweites Gehirn noch intelligenter zu machen.",
  "Expand lists to full width in list view": "Listen in der Listenansicht auf volle Breite erweitern",
  "Lazy Plugin Loader": "Lazy Plugin Loader",
  "Load plugins with a delay on startup, so that you can get your app startup down into the sub-second loading time.": "Laden Sie Plugins mit einer Verzögerung beim Start, damit Sie die Startzeit Ihrer App auf unter eine Sekunde reduzieren können.",
  "Specify custom date format. E.g. \"YYYY-MM-DD HH:mm:ss. See": "Geben Sie ein benutzerdefiniertes Datumsformat an. Z.B. \"YYYY-MM-DD HH:mm:ss. Siehe",
  "for more formats.": "für weitere Formate.",
  "The commit hash, author name and authoring date can all be individually toggled.": "Der Commit-Hash, Autorname und Erstellungsdatum können alle einzeln ein- und ausgeschaltet werden.",
  "Hide everything, to only show the age-colored sidebar.": "Alles ausblenden, um nur die altersfarbencodierte Seitenleiste anzuzeigen.",
  "Diff view style": "Diff-Ansichtsstil",
  "Split": "Geteilt",
  "Unified": "Vereinheitlicht",
  "Set the style for the diff view. Note that the actual diff in \"Split\" mode is not generated by Git, but the editor itself instead so it may differ from the diff generated by Git. One advantage of this is that you can edit the text in that view.": "Legen Sie den Stil für die Diff-Ansicht fest. Beachten Sie, dass die tatsächliche Diff im \"Geteilten\" Modus nicht von Git generiert wird, sondern vom Editor selbst, sodass sie sich von der von Git generierten Diff unterscheiden kann. Ein Vorteil davon ist, dass Sie den Text in dieser Ansicht bearbeiten können.",
  "Theme Info": "Theme-Info",
  "Components": "Komponenten",
  "Appearance (light mode)": "Erscheinungsbild (heller Modus)",
  "Appearance (dark mode)": "Erscheinungsbild (dunkler Modus)",
  "Mobile": "Mobil",
  "Plugin": "Plugin",
  "Editor": "Editor"
}