{
  "Reminder plugin for Obsidian. This plugin adds feature to manage TODOs with reminder.": "Plugin de recordatorio para Obsidian. Este complemento agrega funciones para administrar TODOs con recordatorio.",
  "AidenLx's Folder Note": "Nota de carpeta de AidenLx",
  "Add description, summary and more info to folders with folder notes.": "Agregar descripci贸n, resumen y m谩s informaci贸n a las carpetas con notas de carpeta.",
  "AidenLx's Folder Note - folderv component": "Nota de carpeta de AidenLx - componente folderv",
  "Optional `folderv` Component for alx-folder-note": "Componente `folderv` opcional para alx-folder-note",
  "Auto Card Link": "Enlace de tarjeta autom谩tico",
  "Automatically fetches metadata from a url and makes it as a card-styled link": "Obtiene autom谩ticamente metadatos de una URL y lo convierte en un enlace con estilo de tarjeta",
  "Auto Link Title": "T铆tulo de enlace autom谩tico",
  "This plugin automatically fetches the titles of links from the web": "Este complemento obtiene autom谩ticamente los t铆tulos de los enlaces de la web",
  "BRAT": "BRAT",
  "Easily install a beta version of a plugin for testing.": "Instala f谩cilmente una versi贸n beta de un complemento para pruebas.",
  "Editing Toolbar": "Barra de herramientas de edici贸n",
  "The Obsidian Editing Toolbar is modified from cmenu, which provides more powerful customization settings and has many built-in editing commands to be a MS Word-like toolbar editing experience.": "La barra de herramientas de edici贸n de Obsidian est谩 modificada de cmenu, que proporciona configuraciones de personalizaci贸n m谩s potentes y tiene muchos comandos de edici贸n incorporados para una experiencia de edici贸n similar a MS Word.",
  "Execute Code": "Ejecutar c贸digo",
  "Allows to execute code snippets within a note. Supported programming languages:  C, CPP, Dart, Golang, Groovy, Kotlin, Java, JavaScript, TypeScript, Lean, Lua, CSharp, Prolog, Rust, Python, R, Ruby, Wolfram Mathematica, Haskell, Scala, Racket, F#, Batch, Shell & Powershell.": "Permite ejecutar fragmentos de c贸digo dentro de una nota. Lenguajes de programaci贸n soportados: C, CPP, Dart, Golang, Groovy, Kotlin, Java, JavaScript, TypeScript, Lean, Lua, CSharp, Prolog, Rust, Python, R, Ruby, Wolfram Mathematica, Haskell, Scala, Racket, F#, Batch, Shell y Powershell.",
  "Fast Image Cleaner": "Limpiador r谩pido de im谩genes",
  "This plugin allows you to quickly remove image attachment and referenced link from your documents in both LIVE , READ mode by right-click menu": "Este complemento te permite eliminar r谩pidamente archivos adjuntos de im谩genes y enlaces referenciados de tus documentos tanto en modo LIVE como READ mediante el men煤 contextual",
  "Folder Note Core": "N煤cleo de notas de carpeta",
  "Provide core features and API for folder notes": "Proporciona caracter铆sticas principales y API para notas de carpeta",
  "Git": "Git",
  "Integrate Git version control with automatic backup and other advanced features.": "Integra el control de versiones Git con respaldo autom谩tico y otras caracter铆sticas avanzadas.",
  "Kanban": "Kanban",
  "Create markdown-backed Kanban boards in Obsidian.": "Crea tableros Kanban respaldados por markdown en Obsidian.",
  "Links": "Enlaces",
  "Manipulate links": "Manipular enlaces",
  "MySnippets": "Mis fragmentos",
  "MySnippets is a plugin that adds a status bar menu allowing the user to quickly toggle their snippets on and off .": "MySnippets es un complemento que agrega un men煤 en la barra de estado que permite al usuario activar y desactivar r谩pidamente sus fragmentos .",
  "proxy github": "proxy github",
  "Reminder": "Recordatorio",
  "Style Settings": "Configuraci贸n de estilo",
  "Offers controls for adjusting theme, plugin, and snippet CSS variables.": "Ofrece controles para ajustar variables CSS de temas, complementos y fragmentos.",
  "Templater": "Plantillador",
  "Create and use templates": "Crear y usar plantillas",
  "Inside Folder, Index File": "Dentro de la carpeta, archivo 铆ndice",
  "Inside Folder, With Same Name": "Dentro de la carpeta, con el mismo nombre",
  "Outside Folder, With Same Name": "Fuera de la carpeta, con el mismo nombre",
  "Icon Shortcodes v0.5.1+": "C贸digos cortos de iconos v0.5.1+",
  "Ctrl (Cmd in macOS)": "Ctrl (Cmd en macOS)",
  "Ctrl (Ctrl in macOS)": "Ctrl (Ctrl en macOS)",
  "Alt": "Alt",
  "TRACE": "TRAZA",
  "DEBUG": "DEPURACIN",
  "INFO": "INFORMACIN",
  "WARN": "ADVERTENCIA",
  "ERROR": "ERROR",
  "SILENT": "SILENCIOSO",
  "Notify if startup takes longer than expected": "Notificar si el inicio tarda m谩s de lo esperado",
  "Diagnose issues with your app by seeing what is causing the app to load slowly.": "Diagnostica problemas con tu aplicaci贸n viendo qu茅 est谩 causando que la aplicaci贸n cargue lentamente.",
  "Enhance Default Paste": "Mejorar pegado predeterminado",
  "Fetch the link title when pasting a link in the editor with the default paste command": "Obtener el t铆tulo del enlace al pegar un enlace en el editor con el comando de pegado predeterminado",
  "Enhance Drop Events": "Mejorar eventos de arrastre",
  "Fetch the link title when drag and dropping a link from another program": "Obtener el t铆tulo del enlace al arrastrar y soltar un enlace desde otro programa",
  "Maximum title length": "Longitud m谩xima del t铆tulo",
  "Set the maximum length of the title. Set to 0 to disable.": "Establece la longitud m谩xima del t铆tulo. Establece 0 para desactivar.",
  "Preserve selection as title": "Preservar selecci贸n como t铆tulo",
  "Whether to prefer selected text as title over fetched title when pasting": "Si se prefiere el texto seleccionado como t铆tulo sobre el t铆tulo obtenido al pegar",
  "Website Blacklist": "Lista negra de sitios web",
  "List of strings (comma separated) that disable autocompleting website titles. Can be URLs or arbitrary text.": "Lista de cadenas (separadas por comas) que desactivan el autocompletado de t铆tulos de sitios web. Pueden ser URLs o texto arbitrario.",
  "Use New Scraper": "Usar nuevo extractor",
  "Use experimental new scraper, seems to work well on desktop but not mobile.": "Usar nuevo extractor experimental, parece funcionar bien en escritorio pero no en m贸vil.",
  "Use Better Fetching Placeholder": "Usar mejor marcador de posici贸n de obtenci贸n",
  "Use a more readable placeholder when fetching the title of a link.": "Usar un marcador de posici贸n m谩s legible al obtener el t铆tulo de un enlace.",
  "LinkPreview API Key": "Clave API de LinkPreview",
  "API key for the LinkPreview.net service. Get one at https://my.linkpreview.net/access_keys": "Clave API para el servicio LinkPreview.net. Obt茅n una en https://my.linkpreview.net/access_keys",
  "Auto-enable plugins after installation": "Activar autom谩ticamente complementos despu茅s de la instalaci贸n",
  "If enabled beta plugins will be automatically enabled after installtion by default. Note: you can toggle this on and off for each plugin in the \"Add Plugin\" form.": "Si est谩 activado, los complementos beta se activar谩n autom谩ticamente despu茅s de la instalaci贸n por defecto. Nota: puedes activar y desactivar esto para cada complemento en el formulario \"Agregar complemento\".",
  "Auto-update plugins at startup": "Actualizar autom谩ticamente complementos al inicio",
  "If enabled all beta plugins will be checked for updates each time Obsidian starts. Note: this does not update frozen version plugins.": "Si est谩 activado, se buscar谩n actualizaciones para todos los complementos beta cada vez que Obsidian inicie. Nota: esto no actualiza los complementos de versi贸n congelada.",
  "Auto-update themes at startup": "Actualizar autom谩ticamente temas al inicio",
  "If enabled all beta themes will be checked for updates each time Obsidian starts.": "Si est谩 activado, se buscar谩n actualizaciones para todos los temas beta cada vez que Obsidian inicie.",
  "Learn more about my work at:": "Aprende m谩s sobre mi trabajo en:",
  "Beta plugin list": "Lista de complementos beta",
  "The following is a list of beta plugins added via the command palette \"Add a beta plugin for testing\" or \"Add a beta plugin with frozen version for testing\". A frozen version is a specific release of a plugin based on its release tag.": "La siguiente es una lista de complementos beta agregados a trav茅s de la paleta de comandos \"Agregar un complemento beta para pruebas\" o \"Agregar un complemento beta con versi贸n congelada para pruebas\". Una versi贸n congelada es una versi贸n espec铆fica de un complemento basada en su etiqueta de lanzamiento.",
  "Click the x button next to a plugin to remove it from the list.": "Haz clic en el bot贸n x junto a un complemento para eliminarlo de la lista.",
  "Note:": "Nota:",
  "This does not delete the plugin, this should be done from the  Community Plugins tab in Settings.": "Esto no elimina el complemento, esto debe hacerse desde la pesta帽a Complementos de la comunidad en Configuraci贸n.",
  "Add Beta plugin": "Agregar complemento beta",
  "obsidian-canzi/Enhanced-editing": "obsidian-canzi/Enhanced-editing",
  "Add Beta plugin with frozen version": "Agregar complemento beta con versi贸n congelada",
  "Beta themes list": "Lista de temas beta",
  "Add Beta Theme": "Agregar tema beta",
  "Monitoring": "Monitoreo",
  "Enable Notifications": "Activar notificaciones",
  "BRAT will provide popup notifications for its various activities. Turn this off means  no notifications from BRAT.": "BRAT proporcionar谩 notificaciones emergentes para sus diversas actividades. Desactivar esto significa no recibir notificaciones de BRAT.",
  "Enable Logging": "Activar registro",
  "Plugin updates will be logged to a file in the log file.": "Las actualizaciones de complementos se registrar谩n en un archivo en el archivo de registro.",
  "BRAT Log File Location": "Ubicaci贸n del archivo de registro de BRAT",
  "Logs will be saved to this file. Don't add .md to the file name.": "Los registros se guardar谩n en este archivo. No agregues .md al nombre del archivo.",
  "Enable Verbose Logging": "Activar registro detallado",
  "Get a lot  more information in  the log.": "Obtener mucha m谩s informaci贸n en el registro.",
  "Debugging Mode": "Modo de depuraci贸n",
  "Atomic Bomb level console logging. Can be used for troubleshoting and development.": "Registro de consola nivel bomba at贸mica. Puede usarse para soluci贸n de problemas y desarrollo.",
  "Personal Access Token": "Token de acceso personal",
  "If you need to access private repositories, enter the personal access token here.": "Si necesitas acceder a repositorios privados, ingresa el token de acceso personal aqu铆.",
  "Obsidian Editing Toolbar": "Barra de herramientas de edici贸n de Obsidian",
  "body": "cuerpo",
  "workspace": "espacio de trabajo",
  "glass": "cristal",
  "default": "predeterminado",
  "tiny": "peque帽o",
  "fixed": "fijo",
  "following": "siguiente",
  "top": "superior",
  "undo editor": "deshacer editor",
  "redo editor": "rehacer editor",
  "Clear text formatting": "Limpiar formato de texto",
  "Header 1": "Encabezado 1",
  "Header 2": "Encabezado 2",
  "Header 3": "Encabezado 3",
  "submenu": "submen煤",
  "Header 4": "Encabezado 4",
  "Header 5": "Encabezado 5",
  "Header 6": "Encabezado 6",
  "Toggle bold": "Alternar negrita",
  "Toggle italics": "Alternar cursiva",
  "Toggle strikethrough": "Alternar tachado",
  "Toggle underline": "Alternar subrayado",
  "==Toggle highlight ==": "==Alternar resaltado ==",
  "Toggle blockquote": "Alternar cita",
  "Toggle superscript": "Alternar super铆ndice",
  "Toggle subscript": "Alternar sub铆ndice",
  "inline code": "c贸digo en l铆nea",
  "Toggle codeblock": "Alternar bloque de c贸digo",
  "insert wikilink [[]]": "insertar wikilink [[]]",
  "insert link []()": "insertar enlace []()",
  "insert embed ![[]]": "insertar incrustaci贸n ![[]]",
  "Horizontal divider": "Divisor horizontal",
  "submenu-list": "submen煤-lista",
  "numbered list": "lista numerada",
  "bullet list": "lista con vi帽etas",
  "unindent-list": "desidentar lista",
  "indent list": "identar lista",
  "submenu-aligin": "submen煤-alineaci贸n",
  "Settings for the Code Execution Plugin.": "Configuraci贸n del complemento de ejecuci贸n de c贸digo.",
  "General Settings": "Configuraci贸n general",
  "Timeout (in seconds)": "Tiempo de espera (en segundos)",
  "The time after which a program gets shut down automatically. This is to prevent infinite loops.": "El tiempo despu茅s del cual un programa se cierra autom谩ticamente. Esto es para prevenir bucles infinitos.",
  "Allow Input": "Permitir entrada",
  "Whether or not to include a stdin input box when running blocks. In order to apply changes to this, Obsidian must be refreshed.": "Si se debe incluir o no una caja de entrada stdin al ejecutar bloques. Para aplicar cambios a esto, Obsidian debe ser actualizado.",
  "WSL Mode": "Modo WSL",
  "Whether or not to run code in the Windows Subsystem for Linux. If you don't have WSL installed, don't turn this on!": "Si ejecutar o no c贸digo en el Subsistema de Windows para Linux. Si no tienes WSL instalado, 隆no actives esto!",
  "[Experimental] Persistent Output": "[Experimental] Salida persistente",
  "If enabled, the output of the code block is written into the markdown file. This feature is experimental and may not work as expected.": "Si est谩 habilitado, la salida del bloque de c贸digo se escribe en el archivo markdown. Esta funci贸n es experimental y puede no funcionar como se espera.",
  "Language-Specific Settings": "Configuraci贸n espec铆fica de lenguaje",
  "Pick a language to edit its language-specific settings": "Elige un lenguaje para editar su configuraci贸n espec铆fica",
  "JavaScript / Node Settings": "Configuraci贸n de JavaScript / Node",
  "Node path": "Ruta de Node",
  "Node arguments": "Argumentos de Node",
  "Run Javascript blocks in Notebook Mode": "Ejecutar bloques de Javascript en modo Notebook",
  "Inject Javascript code": "Inyectar c贸digo Javascript",
  "Code to add to the top of every Javascript code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Javascript antes de ejecutar.",
  "TypeScript Settings": "Configuraci贸n de TypeScript",
  "ts-node path": "Ruta de ts-node",
  "TypeScript arguments": "Argumentos de TypeScript",
  "Inject Typescript code": "Inyectar c贸digo TypeScript",
  "Code to add to the top of every Typescript code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo TypeScript antes de ejecutar.",
  "Lean Settings": "Configuraci贸n de Lean",
  "lean path": "Ruta de Lean",
  "Lean arguments": "Argumentos de Lean",
  "Inject Lean code": "Inyectar c贸digo Lean",
  "Code to add to the top of every Lean code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Lean antes de ejecutar.",
  "Lua Settings": "Configuraci贸n de Lua",
  "lua path": "Ruta de Lua",
  "Lua arguments": "Argumentos de Lua",
  "Inject Lua code": "Inyectar c贸digo Lua",
  "Code to add to the top of every Lua code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Lua antes de ejecutar.",
  "Dart Settings": "Configuraci贸n de Dart",
  "dart path": "Ruta de Dart",
  "Dart arguments": "Argumentos de Dart",
  "Inject Dart code": "Inyectar c贸digo Dart",
  "Code to add to the top of every Dart code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Dart antes de ejecutar.",
  "CSharp Settings": "Configuraci贸n de CSharp",
  "dotnet path": "Ruta de dotnet",
  "CSharp arguments": "Argumentos de CSharp",
  "Inject C# code": "Inyectar c贸digo C#",
  "Code to add to the top of every C# code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo C# antes de ejecutar.",
  "Java Settings": "Configuraci贸n de Java",
  "Java path (Java 11 or higher)": "Ruta de Java (Java 11 o superior)",
  "The path to your Java installation.": "La ruta a tu instalaci贸n de Java.",
  "Java arguments": "Argumentos de Java",
  "Inject Java code": "Inyectar c贸digo Java",
  "Code to add to the top of every Java code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Java antes de ejecutar.",
  "Python Settings": "Configuraci贸n de Python",
  "Embed Python Plots": "Incrustar gr谩ficos de Python",
  "Python path": "Ruta de Python",
  "The path to your Python installation.": "La ruta a tu instalaci贸n de Python.",
  "Python arguments": "Argumentos de Python",
  "Run Python blocks in Notebook Mode": "Ejecutar bloques de Python en modo Notebook",
  "Inject Python code": "Inyectar c贸digo Python",
  "Code to add to the top of every Python code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Python antes de ejecutar.",
  "Golang Settings": "Configuraci贸n de Golang",
  "Golang Path": "Ruta de Golang",
  "The path to your Golang installation.": "La ruta a tu instalaci贸n de Golang.",
  "Inject Golang code": "Inyectar c贸digo Golang",
  "Code to add to the top of every Golang code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Golang antes de ejecutar.",
  "Rust Settings": "Configuraci贸n de Rust",
  "Cargo Path": "Ruta de Cargo",
  "The path to your Cargo installation.": "La ruta a tu instalaci贸n de Cargo.",
  "Inject Rust code": "Inyectar c贸digo Rust",
  "Code to add to the top of every Rust code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Rust antes de ejecutar.",
  "C++ Settings": "Configuraci贸n de C++",
  "Cling path": "Ruta de Cling",
  "The path to your Cling installation.": "La ruta a tu instalaci贸n de Cling.",
  "Cling arguments for C++": "Argumentos de Cling para C++",
  "Cling std": "Est谩ndar de Cling",
  "C++ 98": "C++ 98",
  "C++ 11": "C++ 11",
  "C++ 14": "C++ 14",
  "C++ 17": "C++ 17",
  "C++ 20": "C++ 20",
  "Use main function": "Usar funci贸n main",
  "If enabled, will use a main() function as the code block entrypoint.": "Si est谩 habilitado, usar谩 una funci贸n main() como punto de entrada del bloque de c贸digo.",
  "Inject C++ code": "Inyectar c贸digo C++",
  "Code to add to the top of every C++ code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo C++ antes de ejecutar.",
  "C Settings": "Configuraci贸n de C",
  "gcc / Cling path": "Ruta de gcc / Cling",
  "The path to your gcc / Cling installation.": "La ruta a tu instalaci贸n de gcc / Cling.",
  "gcc / Cling arguments for C": "Argumentos de gcc / Cling para C",
  "Cling std (ignored for gcc)": "Est谩ndar de Cling (ignorado para gcc)",
  "Use main function (mandatory for gcc)": "Usar funci贸n main (obligatorio para gcc)",
  "Inject C code": "Inyectar c贸digo C",
  "Code to add to the top of every C code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo C antes de ejecutar.",
  "Batch Settings": "Configuraci贸n de Batch",
  "Batch path": "Ruta de Batch",
  "The path to the terminal. Default is command prompt.": "La ruta al terminal. Por defecto es el s铆mbolo del sistema.",
  "Batch arguments": "Argumentos de Batch",
  "Batch file extension": "Extensi贸n de archivo Batch",
  "Changes the file extension for generated batch scripts. Default is .bat": "Cambia la extensi贸n de archivo para los scripts batch generados. Por defecto es .bat",
  "Inject Batch code": "Inyectar c贸digo Batch",
  "Code to add to the top of every Batch code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Batch antes de ejecutar.",
  "Shell Settings": "Configuraci贸n de Shell",
  "Shell path": "Ruta de Shell",
  "The path to shell. Default is Bash but you can use any shell you want, e.g. bash, zsh, fish, ...": "La ruta al shell. Por defecto es Bash pero puedes usar cualquier shell que desees, por ejemplo bash, zsh, fish, ...",
  "Shell arguments": "Argumentos de Shell",
  "Shell file extension": "Extensi贸n de archivo Shell",
  "Changes the file extension for generated shell scripts. This is useful if you want to use a shell other than bash.": "Cambia la extensi贸n de archivo para los scripts shell generados. Esto es 煤til si quieres usar un shell diferente a bash.",
  "Shell WSL mode": "Modo WSL de Shell",
  "Run the shell script in Windows Subsystem for Linux. This option is used if the global \"WSL Mode\" is disabled.": "Ejecutar el script shell en el Subsistema de Windows para Linux. Esta opci贸n se usa si el \"Modo WSL\" global est谩 desactivado.",
  "Inject Shell code": "Inyectar c贸digo Shell",
  "Code to add to the top of every Shell code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Shell antes de ejecutar.",
  "Powershell Settings": "Configuraci贸n de Powershell",
  "Powershell path": "Ruta de Powershell",
  "The path to Powershell.": "La ruta a Powershell.",
  "Powershell arguments": "Argumentos de Powershell",
  "Powershell file extension": "Extensi贸n de archivo Powershell",
  "Changes the file extension for generated shell scripts. This is useful if you don't want to use PowerShell.": "Cambia la extensi贸n de archivo para los scripts shell generados. Esto es 煤til si no quieres usar PowerShell.",
  "PowerShell script encoding": "Codificaci贸n de script PowerShell",
  "Windows still uses windows-1252 as default encoding on most systems for legacy reasons. If you change your encodings systemwide to UTF-8, you can change this setting to UTF-8 as well. Only use one of the following encodings: \"ascii\", \"utf8\", \"utf-8\", \"utf16le\", \"ucs2\", \"ucs-2\", \"base64\", \"latin1\", \"binary\", \"hex\" (default: \"latin1\")": "Windows todav铆a usa windows-1252 como codificaci贸n predeterminada en la mayor铆a de los sistemas por razones de compatibilidad. Si cambias tus codificaciones a nivel del sistema a UTF-8, tambi茅n puedes cambiar esta configuraci贸n a UTF-8. Solo usa una de las siguientes codificaciones: \"ascii\", \"utf8\", \"utf-8\", \"utf16le\", \"ucs2\", \"ucs-2\", \"base64\", \"latin1\", \"binary\", \"hex\" (predeterminado: \"latin1\")",
  "Inject Powershell code": "Inyectar c贸digo Powershell",
  "Code to add to the top of every Powershell code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Powershell antes de ejecutar.",
  "Prolog Settings": "Configuraci贸n de Prolog",
  "Prolog Answer Limit": "L铆mite de respuestas de Prolog",
  "Maximal number of answers to be returned by the Prolog engine. tab is to prevent creating too huge texts in the notebook.": "N煤mero m谩ximo de respuestas que devolver谩 el motor de Prolog. La pesta帽a es para evitar crear textos demasiado grandes en el cuaderno.",
  "Inject Prolog code": "Inyectar c贸digo Prolog",
  "Code to add to the top of every Prolog code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Prolog antes de ejecutar.",
  "Groovy Settings": "Configuraci贸n de Groovy",
  "Groovy path": "Ruta de Groovy",
  "The path to your Groovy installation.": "La ruta a tu instalaci贸n de Groovy.",
  "Groovy arguments": "Argumentos de Groovy",
  "Inject Groovy code": "Inyectar c贸digo Groovy",
  "Code to add to the top of every Groovy code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Groovy antes de ejecutar.",
  "R Settings": "Configuraci贸n de R",
  "Embed R Plots created via `plot()` into Notes": "Incrustar gr谩ficos R creados mediante `plot()` en las notas",
  "Rscript path": "Ruta de Rscript",
  "The path to your Rscript installation. Ensure you provide the Rscript binary instead of the ordinary R binary.": "La ruta a tu instalaci贸n de Rscript. Aseg煤rate de proporcionar el binario de Rscript en lugar del binario R ordinario.",
  "R arguments": "Argumentos de R",
  "Run R blocks in Notebook Mode": "Ejecutar bloques R en modo Cuaderno",
  "Inject R code": "Inyectar c贸digo R",
  "Code to add to the top of every R code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo R antes de ejecutar.",
  "Kotlin Settings": "Configuraci贸n de Kotlin",
  "Kotlin path": "Ruta de Kotlin",
  "The path to your Kotlin installation.": "La ruta a tu instalaci贸n de Kotlin.",
  "Kotlin arguments": "Argumentos de Kotlin",
  "Inject Kotlin code": "Inyectar c贸digo Kotlin",
  "Code to add to the top of every Kotlin code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Kotlin antes de ejecutar.",
  "Wolfram Mathematica Settings": "Configuraci贸n de Wolfram Mathematica",
  "Mathematica path": "Ruta de Mathematica",
  "The path to your Mathematica installation.": "La ruta a tu instalaci贸n de Mathematica.",
  "Mathematica arguments": "Argumentos de Mathematica",
  "Inject Mathematica code": "Inyectar c贸digo Mathematica",
  "Code to add to the top of every Mathematica code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Mathematica antes de ejecutar.",
  "Haskell Settings": "Configuraci贸n de Haskell",
  "Use Ghci": "Usar Ghci",
  "Run haskell code with ghci instead of runghc": "Ejecutar c贸digo Haskell con ghci en lugar de runghc",
  "Ghci path": "Ruta de Ghci",
  "The path to your ghci installation.": "La ruta a tu instalaci贸n de ghci.",
  "Rungch path": "Ruta de Rungch",
  "The path to your runghc installation.": "La ruta a tu instalaci贸n de runghc.",
  "Ghc path": "Ruta de Ghc",
  "The Ghc path your runghc installation will call.": "La ruta de Ghc que llamar谩 tu instalaci贸n de runghc.",
  "Inject Haskell code": "Inyectar c贸digo Haskell",
  "Code to add to the top of every Haskell code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Haskell antes de ejecutar.",
  "Scala Settings": "Configuraci贸n de Scala",
  "scala path": "Ruta de Scala",
  "Path to your scala installation": "Ruta a tu instalaci贸n de Scala",
  "Scala arguments": "Argumentos de Scala",
  "Inject Scala code": "Inyectar c贸digo Scala",
  "Code to add to the top of every Scala code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Scala antes de ejecutar.",
  "Swift Settings": "Configuraci贸n de Swift",
  "Swift path": "Ruta de Swift",
  "The path to your Swift installation.": "La ruta a tu instalaci贸n de Swift.",
  "Swift arguments": "Argumentos de Swift",
  "Inject Swift code": "Inyectar c贸digo Swift",
  "Code to add to the top of every Swift code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Swift antes de ejecutar.",
  "Racket Settings": "Configuraci贸n de Racket",
  "racket path": "Ruta de Racket",
  "Path to your racket installation": "Ruta a tu instalaci贸n de Racket",
  "Racket arguments": "Argumentos de Racket",
  "Inject Racket code": "Inyectar c贸digo Racket",
  "Code to add to the top of every Racket code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Racket antes de ejecutar.",
  "F# Settings": "Configuraci贸n de F#",
  "F# path": "Ruta de F#",
  "The path to dotnet.": "La ruta a dotnet.",
  "F# arguments": "Argumentos de F#",
  "F# file extension": "Extensi贸n de archivo F#",
  "Changes the file extension for generated F# scripts.": "Cambia la extensi贸n de archivo para los scripts F# generados.",
  "Inject F# code": "Inyectar c贸digo F#",
  "Code to add to the top of every F# code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo F# antes de ejecutar.",
  "Ruby Settings": "Configuraci贸n de Ruby",
  "ruby path": "Ruta de Ruby",
  "Path to your ruby installation": "Ruta a tu instalaci贸n de Ruby",
  "ruby arguments": "Argumentos de Ruby",
  "Inject Ruby code": "Inyectar c贸digo Ruby",
  "Code to add to the top of every Ruby code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Ruby antes de ejecutar.",
  "SQL Settings": "Configuraci贸n de SQL",
  "SQL path": "Ruta de SQL",
  "Path to your SQL installation. You can select the SQL dialect you prefer but you need to set the right arguments by yourself.": "Ruta a tu instalaci贸n de SQL. Puedes seleccionar el dialecto SQL que prefieras pero necesitas establecer los argumentos correctos por ti mismo.",
  "SQL arguments": "Argumentos de SQL",
  "Set the right arguments for your database.": "Establece los argumentos correctos para tu base de datos.",
  "Inject SQL code": "Inyectar c贸digo SQL",
  "Code to add to the top of every SQL code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo SQL antes de ejecutar.",
  "Octave Settings": "Configuraci贸n de Octave",
  "Octave path": "Ruta de Octave",
  "The path to your Octave installation.": "La ruta a tu instalaci贸n de Octave.",
  "Octave arguments": "Argumentos de Octave",
  "Inject Octave code": "Inyectar c贸digo Octave",
  "Code to add to the top of every Octave code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Octave antes de ejecutar.",
  "Maxima Settings": "Configuraci贸n de Maxima",
  "Maxima path": "Ruta de Maxima",
  "The path to your Maxima installation.": "La ruta a tu instalaci贸n de Maxima.",
  "Maxima arguments": "Argumentos de Maxima",
  "Inject Maxima code": "Inyectar c贸digo Maxima",
  "Code to add to the top of every Maxima code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Maxima antes de ejecutar.",
  "Applescript Settings": "Configuraci贸n de Applescript",
  "Osascript path": "Ruta de Osascript",
  "The path to your osascript installation (only available on MacOS).": "La ruta a tu instalaci贸n de osascript (solo disponible en MacOS).",
  "Applescript arguments": "Argumentos de Applescript",
  "Inject Applescript code": "Inyectar c贸digo Applescript",
  "Code to add to the top of every Applescript code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Applescript antes de ejecutar.",
  "Zig Settings": "Configuraci贸n de Zig",
  "zig path": "Ruta de Zig",
  "Path to your zig installation": "Ruta a tu instalaci贸n de Zig",
  "zig arguments": "Argumentos de Zig",
  "Inject Zig code": "Inyectar c贸digo Zig",
  "Code to add to the top of every Zig code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo Zig antes de ejecutar.",
  "OCaml Settings": "Configuraci贸n de OCaml",
  "ocaml path": "Ruta de OCaml",
  "Path to your ocaml installation": "Ruta a tu instalaci贸n de OCaml",
  "ocaml arguments": "Argumentos de OCaml",
  "Inject OCaml code": "Inyectar c贸digo OCaml",
  "Code to add to the top of every OCaml code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo OCaml antes de ejecutar.",
  "PHP Settings": "Configuraci贸n de PHP",
  "php path": "Ruta de PHP",
  "Path to your php installation": "Ruta a tu instalaci贸n de PHP",
  "php arguments": "Argumentos de PHP",
  "Inject PHP code": "Inyectar c贸digo PHP",
  "Code to add to the top of every PHP code block before running.": "C贸digo para agregar al principio de cada bloque de c贸digo PHP antes de ejecutar.",
  "Fast Attachment Cleaner Settings": "Configuraci贸n del limpiador r谩pido de archivos adjuntos",
  "Deleted Attachment Destination": "Destino de archivos adjuntos eliminados",
  "Select where you want Attachments to be moved once they are deleted": "Selecciona d贸nde quieres que se muevan los archivos adjuntos una vez eliminados",
  "Delete Permanently": "Eliminar permanentemente",
  "Move to Obsidian Trash": "Mover a la papelera de Obsidian",
  "Move to System Trash": "Mover a la papelera del sistema",
  "Automatic": "Autom谩tico",
  "Split timers for automatic commit and sync": "Temporizadores separados para commit y sincronizaci贸n autom谩ticos",
  "Enable to use one interval for commit and another for sync.": "Habilitar para usar un intervalo para commit y otro para sincronizaci贸n.",
  "Auto commit interval (minutes)": "Intervalo de commit autom谩tico (minutos)",
  "Commit changes every X minutes. Set to 0 (default) to disable. (See below setting for further configuration!)": "Realizar commit de cambios cada X minutos. Establecer a 0 (predeterminado) para deshabilitar. (隆Ver configuraci贸n siguiente para m谩s detalles!)",
  "Auto commit after stopping file edits": "Commit autom谩tico despu茅s de detener ediciones de archivos",
  "Requires the commit interval not to be 0.\n                        If turned on, do auto commit every 30 minutes after stopping file edits.\n                        This also prevents auto commit while editing a file. If turned off, it's independent from the last file edit.": "Requiere que el intervalo de commit no sea 0.\n                        Si est谩 activado, realiza commit autom谩tico cada 30 minutos despu茅s de detener las ediciones de archivos.\n                        Esto tambi茅n previene el commit autom谩tico mientras se edita un archivo. Si est谩 desactivado, es independiente de la 煤ltima edici贸n de archivo.",
  "Auto commit after latest commit": "Commit autom谩tico despu茅s del 煤ltimo commit",
  "If turned on, sets last auto commit timestamp to the latest commit timestamp. This reduces the frequency of auto commit when doing manual commits.": "Si est谩 activado, establece la marca de tiempo del 煤ltimo commit autom谩tico a la marca de tiempo del commit m谩s reciente. Esto reduce la frecuencia de commits autom谩ticos al realizar commits manuales.",
  "Auto push interval (minutes)": "Intervalo de push autom谩tico (minutos)",
  "Push commits every X minutes. Set to 0 (default) to disable.": "Realizar push de commits cada X minutos. Establecer a 0 (predeterminado) para deshabilitar.",
  "Auto pull interval (minutes)": "Intervalo de pull autom谩tico (minutos)",
  "Pull changes every X minutes. Set to 0 (default) to disable.": "Realizar pull de cambios cada X minutos. Establecer a 0 (predeterminado) para deshabilitar.",
  "Specify custom commit message on auto commit": "Especificar mensaje personalizado de commit en commit autom谩tico",
  "You will get a pop up to specify your message.": "Obtendr谩s una ventana emergente para especificar tu mensaje.",
  "Commit message on auto commit": "Mensaje de commit en commit autom谩tico",
  "Available placeholders: {{date}} (see below), {{hostname}} (see below), {{numFiles}} (number of changed files in the commit) and {{files}} (changed files in commit message).": "Marcadores disponibles: {{date}} (ver abajo), {{hostname}} (ver abajo), {{numFiles}} (n煤mero de archivos cambiados en el commit) y {{files}} (archivos cambiados en el mensaje de commit).",
  "Commit message": "Mensaje de commit",
  "Commit message on manual commit": "Mensaje de commit en commit manual",
  "{{date}} placeholder format": "Formato del marcador {{date}}",
  "Moment.js": "Moment.js",
  "{{hostname}} placeholder replacement": "Reemplazo del marcador {{hostname}}",
  "Specify custom hostname for every device.": "Especificar nombre de host personalizado para cada dispositivo.",
  "Preview commit message": "Vista previa del mensaje de commit",
  "Preview": "Vista previa",
  "List filenames affected by commit in the commit body": "Listar nombres de archivos afectados por el commit en el cuerpo del commit",
  "Pull": "Pull",
  "Merge strategy": "Estrategia de fusi贸n",
  "Decide how to integrate commits from your remote branch into your local branch.": "Decide c贸mo integrar commits desde tu rama remota a tu rama local.",
  "Merge": "Fusionar",
  "Rebase": "Rebase",
  "Other sync service (Only updates the HEAD without touching the working directory)": "Otro servicio de sincronizaci贸n (Solo actualiza el HEAD sin tocar el directorio de trabajo)",
  "Pull on startup": "Pull al inicio",
  "Automatically pull commits when Obsidian starts.": "Realizar pull de commits autom谩ticamente cuando Obsidian inicia.",
  "Commit-and-sync": "Commit y sincronizaci贸n",
  "Commit-and-sync with default settings means staging everything -> committing -> pulling -> pushing. Ideally this is a single action that you do regularly to keep your local and remote repository in sync.": "Commit y sincronizaci贸n con configuraci贸n predeterminada significa preparar todo -> hacer commit -> hacer pull -> hacer push. Idealmente esta es una acci贸n 煤nica que realizas regularmente para mantener sincronizados tus repositorios local y remoto.",
  "Push on commit-and-sync": "Push en commit y sincronizaci贸n",
  "Most of the time you want to push after committing. Turning this off turns a commit-and-sync action into commit only. It will still be called commit-and-sync.": "La mayor铆a de las veces querr谩s hacer push despu茅s de hacer commit. Desactivar esto convierte una acci贸n de commit y sincronizaci贸n en solo commit. A煤n se llamar谩 commit y sincronizaci贸n.",
  "Pull on commit-and-sync": "Pull en commit y sincronizaci贸n",
  "On commit-and-sync, pull commits as well. Turning this off turns a commit-and-sync action into commit only.": "En commit y sincronizaci贸n, tambi茅n hacer pull de commits. Desactivar esto convierte una acci贸n de commit y sincronizaci贸n en solo commit.",
  "Line author information": "Informaci贸n del autor de la l铆nea",
  "Show commit authoring information next to each line": "Mostrar informaci贸n de autor铆a del commit junto a cada l铆nea",
  "Feature guide and quick examples": "Gu铆a de funciones y ejemplos r谩pidos",
  "History view": "Vista de historial",
  "Show Author": "Mostrar autor",
  "Show the author of the commit in the history view.": "Mostrar el autor del commit en la vista de historial.",
  "Hide": "Ocultar",
  "Full": "Completo",
  "Initials": "Iniciales",
  "Show Date": "Mostrar fecha",
  "Show the date of the commit in the history view. The {{date}} placeholder format is used to display the date.": "Mostrar la fecha del commit en la vista de historial. El formato del marcador {{date}} se usa para mostrar la fecha.",
  "Source control view": "Vista de control de fuente",
  "Automatically refresh source control view on file changes": "Actualizar autom谩ticamente la vista de control de fuente en cambios de archivo",
  "On slower machines this may cause lags. If so, just disable this option.": "En m谩quinas m谩s lentas esto puede causar retrasos. Si es as铆, simplemente deshabilita esta opci贸n.",
  "Source control view refresh interval": "Intervalo de actualizaci贸n de la vista de control de fuente",
  "Milliseconds to wait after file change before refreshing the Source Control View.": "Milisegundos a esperar despu茅s del cambio de archivo antes de actualizar la Vista de Control de Fuente.",
  "Miscellaneous": "Miscel谩neos",
  "Disable notifications": "Deshabilitar notificaciones",
  "Disable notifications for git operations to minimize distraction (refer to status bar for updates). Errors are still shown as notifications even if you enable this setting.": "Deshabilitar notificaciones para operaciones git para minimizar distracciones (consultar la barra de estado para actualizaciones). Los errores a煤n se muestran como notificaciones incluso si habilitas esta configuraci贸n.",
  "Hide notifications for no changes": "Ocultar notificaciones sin cambios",
  "Don't show notifications when there are no changes to commit or push.": "No mostrar notificaciones cuando no hay cambios para hacer commit o push.",
  "Show status bar": "Mostrar barra de estado",
  "Obsidian must be restarted for the changes to take affect.": "Obsidian debe reiniciarse para que los cambios surtan efecto.",
  "Show stage/unstage button in file menu": "Mostrar bot贸n de preparar/deshacer preparaci贸n en men煤 de archivo",
  "Show branch status bar": "Mostrar barra de estado de rama",
  "Show the count of modified files in the status bar": "Mostrar el conteo de archivos modificados en la barra de estado",
  "Commit author": "Autor del commit",
  "Author name for commit": "Nombre del autor para el commit",
  "Author email for commit": "Correo electr贸nico del autor para el commit",
  "Advanced": "Avanzado",
  "These settings usually don't need to be changed, but may be requried for special setups.": "Estas configuraciones generalmente no necesitan cambiarse, pero pueden ser requeridas para configuraciones especiales.",
  "Update submodules": "Actualizar subm贸dulos",
  "\"Commit-and-sync\" and \"pull\" takes care of submodules. Missing features: Conflicted files, count of pulled/pushed/committed files. Tracking branch needs to be set for each submodule.": "\"Commit y sincronizaci贸n\" y \"pull\" se encargan de los subm贸dulos. Caracter铆sticas faltantes: Archivos en conflicto, conteo de archivos pulled/pushed/committed. La rama de seguimiento debe establecerse para cada subm贸dulo.",
  "Custom Git binary path": "Ruta binaria personalizada de Git",
  "Additional environment variables": "Variables de entorno adicionales",
  "Use each line for a new environment variable in the format KEY=VALUE .": "Usar cada l铆nea para una nueva variable de entorno en el formato CLAVE=VALOR .",
  "Additional PATH environment variable paths": "Rutas adicionales de variable de entorno PATH",
  "Use each line for one path": "Usar cada l铆nea para una ruta",
  "Reload with new environment variables": "Recargar con nuevas variables de entorno",
  "Removing previously added environment variables will not take effect until Obsidian is restarted.": "Eliminar variables de entorno previamente agregadas no surtir谩 efecto hasta que Obsidian se reinicie.",
  "Reload": "Recargar",
  "Custom base path (Git repository path)": "Ruta base personalizada (ruta del repositorio Git)",
  "Sets the relative path to the vault from which the Git binary should be executed.\n             Mostly used to set the path to the Git repository, which is only required if the Git repository is below the vault root directory. Use \"\\\" instead of \"/\" on Windows.": "Establece la ruta relativa a la b贸veda desde la cual debe ejecutarse el binario Git.\n             Principalmente usado para establecer la ruta al repositorio Git, que solo se requiere si el repositorio Git est谩 debajo del directorio ra铆z de la b贸veda. Usar \"\\\" en lugar de \"/\" en Windows.",
  "Custom Git directory path (Instead of '.git')": "Ruta de directorio Git personalizada (En lugar de '.git')",
  "Requires restart of Obsidian to take effect. Use \"\\\" instead of \"/\" on Windows.": "Requiere reiniciar Obsidian para que surta efecto. Usar \"\\\" en lugar de \"/\" en Windows.",
  "Disable on this device": "Deshabilitar en este dispositivo",
  "Disables the plugin on this device. This setting is not synced.": "Deshabilita el complemento en este dispositivo. Esta configuraci贸n no se sincroniza.",
  "Support": "Soporte",
  "Donate": "Donar",
  "If you like this Plugin, consider donating to support continued development.": "Si te gusta este complemento, considera donar para apoyar el desarrollo continuo.",
  "Copy Debug Information": "Copiar informaci贸n de depuraci贸n",
  "Debugging and logging:\nYou can always see the logs of this and every other plugin by opening the console with": "Depuraci贸n y registro:\nSiempre puedes ver los registros de este y todos los dem谩s complementos abriendo la consola con",
  "CTRL + SHIFT + I": "CTRL + SHIFT + I",
  "Tags": "Etiquetas",
  "Move tags to card footer": "Mover etiquetas al pie de tarjeta",
  "When toggled, tags will be displayed in the card's footer instead of the card's body.": "Cuando se activa, las etiquetas se mostrar谩n en el pie de la tarjeta en lugar del cuerpo de la tarjeta.",
  "Tag click action": "Acci贸n al hacer clic en etiqueta",
  "This setting controls whether clicking the tags displayed below the card title opens the Obsidian search or the Kanban board search.": "Esta configuraci贸n controla si al hacer clic en las etiquetas mostradas debajo del t铆tulo de la tarjeta se abre la b煤squeda de Obsidian o la b煤squeda del tablero Kanban.",
  "Search Kanban Board": "Buscar en tablero Kanban",
  "Search Obsidian Vault": "Buscar en b贸veda de Obsidian",
  "Tag sort order": "Orden de clasificaci贸n de etiquetas",
  "Set an explicit sort order for the specified tags.": "Establecer un orden de clasificaci贸n expl铆cito para las etiquetas especificadas.",
  "Add tag": "Agregar etiqueta",
  "Tag colors": "Colores de etiquetas",
  "Set colors for tags displayed in cards.": "Establecer colores para etiquetas mostradas en tarjetas.",
  "Add tag color": "Agregar color de etiqueta",
  "Move dates to card footer": "Mover fechas al pie de tarjeta",
  "When toggled, dates will be displayed in the card's footer instead of the card's body.": "Cuando se activa, las fechas se mostrar谩n en el pie de la tarjeta en lugar del cuerpo de la tarjeta.",
  "When toggled, cards will display the distance between today and the card's date. eg. 'In 3 days', 'A month ago'. Relative dates will not be shown for dates from the Tasks and Dataview plugins.": "Cuando se activa, las tarjetas mostrar谩n la distancia entre hoy y la fecha de la tarjeta. ej. 'En 3 d铆as', 'Hace un mes'. Las fechas relativas no se mostrar谩n para fechas de los complementos Tasks y Dataview.",
  "Display date colors": "Mostrar colores de fechas",
  "Set colors for dates displayed in cards based on the rules below.": "Establecer colores para fechas mostradas en tarjetas seg煤n las reglas siguientes.",
  "Add date color": "Agregar color de fecha",
  "Add archive date/time after card title": "Agregar fecha/hora de archivo despu茅s del t铆tulo de la tarjeta",
  "When toggled, the archived date/time will be added after the card title, e.g.- [ ] My card title 2021-05-14 10:00am. By default, it is inserted before the title.": "Cuando se activa, la fecha/hora de archivo se agregar谩 despu茅s del t铆tulo de la tarjeta, ej.- [ ] Mi t铆tulo de tarjeta 2021-05-14 10:00am. Por defecto, se inserta antes del t铆tulo.",
  "Inline Metadata": "Metadatos en l铆nea",
  "Inline metadata position": "Posici贸n de metadatos en l铆nea",
  "Controls where the inline metadata (from the Dataview plugin) will be displayed.": "Controla d贸nde se mostrar谩n los metadatos en l铆nea (del complemento Dataview).",
  "Card body": "Cuerpo de tarjeta",
  "Card footer": "Pie de tarjeta",
  "Merge with linked page metadata": "Fusionar con metadatos de p谩gina vinculada",
  "Move task data to card footer": "Mover datos de tarea al pie de tarjeta",
  "When toggled, task data (from the Tasks plugin) will be displayed in the card's footer instead of the card's body.": "Cuando se activa, los datos de tarea (del complemento Tasks) se mostrar谩n en el pie de la tarjeta en lugar del cuerpo de la tarjeta.",
  "Board view": "Vista de tablero",
  "Command settings": "Configuraci贸n de comandos",
  "General": "General",
  "Autoselect upon creating a link": "Autoseleccionar al crear un enlace",
  "Autoselect a word under the cursor when creating a link.": "Autoseleccionar una palabra bajo el cursor al crear un enlace.",
  "Skip Frontmatter": "Omitir Frontmatter",
  "Skip Frontmatter in note wide commands.": "Omitir Frontmatter en comandos amplios de nota.",
  "Title separator": "Separador de t铆tulo",
  "String used as headings separator in 'Set link text' command.": "Cadena usada como separador de encabezados en el comando 'Establecer texto de enlace'.",
  "Remove links from headings": "Eliminar enlaces de encabezados",
  "Internal wikilink without text": "Wikilink interno sin texto",
  "Remove": "Eliminar",
  "Replace with destination": "Reemplazar con destino",
  "Replace with lowest heading": "Reemplazar con encabezado m谩s bajo",
  "Delete link": "Eliminar enlace",
  "Delete unreferenced link target": "Eliminar destino de enlace no referenciado",
  "Convert to Markdown link": "Convertir a enlace Markdown",
  "Append .md extension": "Agregar extensi贸n .md",
  "docs": "documentos",
  "Context menu": "Men煤 contextual",
  "Edit link text": "Editar texto de enlace",
  "Set link text": "Establecer texto de enlace",
  "Set link text from clipboard": "Establecer texto de enlace desde portapapeles",
  "Edit link destination": "Editar destino de enlace",
  "Set link destination from clipboard": "Establecer destino de enlace desde portapapeles",
  "Copy link": "Copiar enlace",
  "Cut link": "Cortar enlace",
  "Copy link destination": "Copiar destino de enlace",
  "Copy link to element": "Copiar enlace al elemento",
  "Unlink": "Desvincular",
  "Convert to wikilink": "Convertir a wikilink",
  "Convert to autolink": "Convertir a autoenlace",
  "Convert to markdown link": "Convertir a enlace markdown",
  "Convert to HTML link": "Convertir a enlace HTML",
  "Embed/Unembed": "Incrustar/Desincrustar",
  "Delete": "Eliminar",
  "Create link": "Crear enlace",
  "Create link from clipboard": "Crear enlace desde portapapeles",
  "Convert all links to Markdown links": "Convertir todos los enlaces a enlaces Markdown",
  "Convert Wikilinks to Markdown links": "Convertir Wikilinks a enlaces Markdown",
  "Convert URLs to Markdown links": "Convertir URLs a enlaces Markdown", 
  "Convert Autolinks to Markdown links": "Convertir Autoenlaces a enlaces Markdown",
  "Convert HTML links to Markdown links": "Convertir enlaces HTML a enlaces Markdown",
  "Extract section": "Extraer secci贸n",
  "Early access features": "Funciones de acceso anticipado",
  "Almost finished features with some": "Funciones casi terminadas con algunos",
  "to be fixed.": "por arreglar.",
  "Insider features": "Funciones internas",
  "Incomplete features currently under development. Enable these features to": "Funciones incompletas actualmente en desarrollo. Habilita estas funciones para",
  "provide your input": "proporcionar tu opini贸n",
  "and influence the direction of development.": "e influir en la direcci贸n del desarrollo.",
  "Convert links in a folder": "Convertir enlaces en una carpeta",
  "Obsidian URL support": "Soporte de URL de Obsidian",
  "Chetachi 解": "Chetachi 解",
  "Notification Settings": "Configuraci贸n de notificaciones",
  "Reminder Time": "Hora del recordatorio",
  "Time when a reminder with no time part will show": "Hora en que se mostrar谩 un recordatorio sin parte de tiempo",
  "Remind me later": "Recordarme m谩s tarde",
  "Line-separated list of remind me later items": "Lista separada por l铆neas de elementos para recordar m谩s tarde",
  "Use system notification": "Usar notificaci贸n del sistema",
  "Use system notification for reminder notifications": "Usar notificaci贸n del sistema para notificaciones de recordatorio",
  "Calendar popup trigger": "Disparador de ventana emergente de calendario",
  "Trigger text to show calendar popup": "Texto disparador para mostrar ventana emergente de calendario",
  "Popup is enabled": "Ventana emergente est谩 habilitada",
  "Primary reminder format": "Formato principal de recordatorio",
  "Reminder format for generated reminder by calendar popup": "Formato de recordatorio para recordatorio generado por ventana emergente de calendario",
  "Reminder plugin format - (@2021-09-08)": "Formato de complemento de recordatorio - (@2021-09-08)",
  "Tasks plugin format -  2021-09-08": "Formato de complemento de tareas -  2021-09-08",
  "Kanban plugin format - @{2021-09-08}": "Formato de complemento Kanban - @{2021-09-08}",
  "Reminder Format - Reminder Plugin": "Formato de recordatorio - Complemento de recordatorio",
  "Enable Reminder plugin format": "Habilitar formato de complemento de recordatorio",
  "Example: - [ ] Task 1(@2025-01-05 12:21)": "Ejemplo: - [ ] Tarea 1(@2025-01-05 12:21)",
  "Date format": "Formato de fecha",
  "moment style date format: https://momentjs.com/docs/#/displaying/format/": "formato de fecha estilo moment: https://momentjs.com/docs/#/displaying/format/",
  "Date and time format": "Formato de fecha y hora",
  "moment() style date time format: https://momentjs.com/docs/#/displaying/format/": "formato de fecha y hora estilo moment(): https://momentjs.com/docs/#/displaying/format/",
  "Strict Date format": "Formato de fecha estricto",
  "Strictly parse the date and time": "Analizar estrictamente la fecha y hora",
  "Link dates to daily notes": "Vincular fechas a notas diarias",
  "When toggled, Dates link to daily notes.": "Cuando est谩 activado, las fechas se vinculan a notas diarias.",
  "Reminder Format - Tasks Plugin": "Formato de recordatorio - Complemento de tareas",
  "Enable Tasks plugin format": "Habilitar formato de complemento de tareas",
  "Example: - [ ] Task 1  2025-01-05": "Ejemplo: - [ ] Tarea 1  2025-01-05",
  "Distinguish between reminder date and due date": "Distinguir entre fecha de recordatorio y fecha de vencimiento",
  "Use custom emoji  instead of  and distinguish between reminder date/time and Tasks Plugin's due date.": "Usar emoji personalizado  en lugar de  y distinguir entre fecha/hora de recordatorio y fecha de vencimiento del complemento de tareas.",
  "Remove tags from reminder title": "Eliminar etiquetas del t铆tulo del recordatorio",
  "If checked, tags(#xxx) are removed from the reminder list view and notification.": "Si est谩 marcado, las etiquetas(#xxx) se eliminan de la vista de lista de recordatorios y notificaci贸n.",
  "Reminder Format - Kanban Plugin": "Formato de recordatorio - Complemento Kanban",
  "Enable Kanban plugin format": "Habilitar formato de complemento Kanban",
  "Example: - [ ] Task 1 @{2025-01-05} @@{12:21}": "Ejemplo: - [ ] Tarea 1 @{2025-01-05} @@{12:21}",
  "Edit Detection Time": "Tiempo de detecci贸n de edici贸n",
  "The minimum amount of time (in seconds) after a key is typed that it will be identified as notifiable.": "La cantidad m铆nima de tiempo (en segundos) despu茅s de que se escribe una tecla para que sea identificada como notificable.",
  "Reminder check interval": "Intervalo de verificaci贸n de recordatorio",
  "Interval(in seconds) to periodically check whether or not you should be notified of reminders.  You will need to restart Obsidian for this setting to take effect.": "Intervalo (en segundos) para verificar peri贸dicamente si debes ser notificado de recordatorios. Necesitar谩s reiniciar Obsidian para que esta configuraci贸n surta efecto.",
  "Import": "Importar",
  "Export": "Exportar",
  "Separate desktop/mobile configuration": "Configuraci贸n separada de escritorio/m贸vil",
  "Enable this if you want to have different settings depending whether you're using a desktop or mobile device. All of the settings below can be configured differently on desktop and mobile. You're currently using the desktop/global settings.": "Habilita esto si quieres tener diferentes configuraciones dependiendo de si est谩s usando un dispositivo de escritorio o m贸vil. Todas las configuraciones siguientes pueden configurarse de manera diferente en escritorio y m贸vil. Actualmente est谩s usando la configuraci贸n de escritorio/global.",
  "Lazy Loader settings": "Configuraci贸n de cargador perezoso",
  "Short delay (seconds)": "Retraso corto (segundos)",
  "Long delay (seconds)": "Retraso largo (segundos)",
  "Default startup type for new plugins": "Tipo de inicio predeterminado para nuevos complementos",
  "Nothing configured": "Nada configurado",
  " Disable plugin": " Deshabilitar complemento",
  " Instant": " Instant谩neo",
  " Short delay": " Retraso corto",
  " Long delay": " Retraso largo",
  "Show plugin descriptions": "Mostrar descripciones de complementos",
  "Set the delay for all plugins at once": "Establecer el retraso para todos los complementos a la vez",
  "Set all plugins to be:": "Establecer todos los complementos como:",
  "Plugins": "Complementos",
  "All": "Todos",
  "AttachFlow": "AttachFlow",
  "This nifty plugin enables seamless management of attachments and referenced links directly from your documents. Taking advantage of an intuitive right-click menu, you can efficiently handle resources in both LIVE and READ modes.": "Este 煤til complemento permite la gesti贸n perfecta de archivos adjuntos y enlaces referenciados directamente desde tus documentos. Aprovechando un men煤 contextual intuitivo, puedes manejar eficientemente los recursos tanto en modo LIVE como READ.",
  "Right-click menu for attachments": "Men煤 contextual para archivos adjuntos",
  "Deleted attachment destination": "Destino de archivo adjunto eliminado",
  "Move file to...": "Mover archivo a...",
  "Add a \"Move to...\" option to the right-click menu for attachments": "Agregar una opci贸n \"Mover a...\" al men煤 contextual para archivos adjuntos",
  "Click to view images": "Clic para ver im谩genes",
  "Click the right half of the image to view the image in detail.": "Haz clic en la mitad derecha de la imagen para ver la imagen en detalle.",
  "Adaptive image display ratio based on window size": "Relaci贸n de visualizaci贸n de imagen adaptativa basada en el tama帽o de la ventana",
  "When the image exceeds the window size, the image is displayed adaptively according to the window size.": "Cuando la imagen excede el tama帽o de la ventana, la imagen se muestra de manera adaptativa seg煤n el tama帽o de la ventana.",
  "Drag to resize images": "Arrastrar para redimensionar im谩genes",
  "Turn on to enable drag to resize images.": "Activar para habilitar arrastrar para redimensionar im谩genes.",
  "Resize interval": "Intervalo de redimensionamiento",
  "Debug": "Depuraci贸n",
  "Debug mode": "Modo de depuraci贸n",
  "Print debug information in console": "Imprimir informaci贸n de depuraci贸n en consola",
  "Folder overview": "Vista general de carpeta",
  "Exclude folders": "Excluir carpetas",
  "File explorer": "Explorador de archivos",
  "Path": "Ruta",
  "Folder note name": "Nombre de nota de carpeta",
  "{{folder_name}} will be replaced with the name of the folder": "{{folder_name}} ser谩 reemplazado con el nombre de la carpeta",
  "Rename existing folder notes": "Renombrar notas de carpeta existentes",
  "Default folder note type for new folder notes": "Tipo de nota de carpeta predeterminado para nuevas notas de carpeta",
  "Choose the default file type for new folder notes. (canvas, markdown, ...)": "Elige el tipo de archivo predeterminado para nuevas notas de carpeta. (lienzo, markdown, ...)",
  "ask for file type": "preguntar por tipo de archivo",
  "Supported file types for folder notes": "Tipos de archivo soportados para notas de carpeta",
  "Custom extension": "Extensi贸n personalizada",
  "Template path": "Ruta de plantilla",
  "Restart after changing the template path": "Reiniciar despu茅s de cambiar la ruta de plantilla",
  "Storage location": "Ubicaci贸n de almacenamiento",
  "Choose where to store the folder notes": "Elige d贸nde almacenar las notas de carpeta",
  "Inside the folder": "Dentro de la carpeta",
  "In the parent folder": "En la carpeta principal",
  "Switch to new storage location": "Cambiar a nueva ubicaci贸n de almacenamiento",
  "Move all folder notes to the new storage location": "Mover todas las notas de carpeta a la nueva ubicaci贸n de almacenamiento",
  "Switch": "Cambiar",
  "Key for creating folder note": "Tecla para crear nota de carpeta",
  "The key combination to create a folder note": "La combinaci贸n de teclas para crear una nota de carpeta",
  "Ctrl + Click": "Ctrl + Clic",
  "Alt + Click": "Alt + Clic", 
  "Key for opening folder note": "Tecla para abrir nota de carpeta",
  "Select the combination to open a folder note": "Seleccionar la combinaci贸n para abrir una nota de carpeta",
  "Mouse Click": "Clic del rat贸n",
  "Sync folder name": "Sincronizar nombre de carpeta",
  "Automatically rename the folder note when the folder name is changed": "Renombrar autom谩ticamente la nota de carpeta cuando se cambia el nombre de la carpeta",
  "Confirm folder note deletion": "Confirmar eliminaci贸n de nota de carpeta",
  "Ask for confirmation before deleting a folder note": "Pedir confirmaci贸n antes de eliminar una nota de carpeta",
  "Deleted folder notes": "Notas de carpeta eliminadas",
  "What happens to the folder note after you delete it": "Qu茅 sucede con la nota de carpeta despu茅s de eliminarla",
  "Move to system trash": "Mover a la papelera del sistema",
  "Move to Obsidian trash (.trash folder)": "Mover a la papelera de Obsidian (carpeta .trash)",
  "Delete permanently": "Eliminar permanentemente",
  "Open folder note in a new tab by default": "Abrir nota de carpeta en una nueva pesta帽a por defecto",
  "Always open folder notes in a new tab (except when you try to open the same note) instead of having to use ctrl/cmd + click to open in a new tab": "Siempre abrir notas de carpeta en una nueva pesta帽a (excepto cuando intentas abrir la misma nota) en lugar de tener que usar ctrl/cmd + clic para abrir en una nueva pesta帽a",
  "Automatically create folder notes": "Crear notas de carpeta autom谩ticamente",
  "Automatically create a folder note when a new folder is created": "Crear autom谩ticamente una nota de carpeta cuando se crea una nueva carpeta",
  "Enable front matter title plugin integration": "Habilitar integraci贸n del complemento de t铆tulo front matter",
  "Automatically rename a folder name when the folder note is renamed": "Renombrar autom谩ticamente el nombre de una carpeta cuando se renombra la nota de carpeta",
  "Create folder note for every folder": "Crear nota de carpeta para cada carpeta",
  "Create a folder note for every folder in the vault": "Crear una nota de carpeta para cada carpeta en la b贸veda",
  "Manage folder overview defaults": "Gestionar valores predeterminados de vista general de carpeta",
  "Manage the default settings for the folder overview plugin": "Gestionar la configuraci贸n predeterminada para el complemento de vista general de carpeta",
  "Manage": "Gestionar",
  "Manage excluded folders": "Gestionar carpetas excluidas",
  "Exclude folder default settings": "Excluir configuraci贸n predeterminada de carpeta",
  "Exclude pattern default settings": "Excluir configuraci贸n predeterminada de patr贸n",
  "Add excluded folder": "Agregar carpeta excluida",
  "Hide folder note": "Ocultar nota de carpeta",
  "Hide the folder note in the file explorer": "Ocultar la nota de carpeta en el explorador de archivos",
  "Don't open folder notes by clicking on the name (on mobile)": "No abrir notas de carpeta al hacer clic en el nombre (en m贸vil)",
  "Folder notes don't open when clicking on the name of the folder (on mobile)": "Las notas de carpeta no se abren al hacer clic en el nombre de la carpeta (en m贸vil)",
  "Only open folder notes through the name": "Solo abrir notas de carpeta a trav茅s del nombre",
  "Only open folder notes in the file explorer by clicking on the folder name": "Solo abrir notas de carpeta en el explorador de archivos haciendo clic en el nombre de la carpeta",
  "Disable folder collapsing": "Deshabilitar colapso de carpetas",
  "Disable the ability to collapse folders by clicking exactly on the folder name": "Deshabilitar la capacidad de colapsar carpetas haciendo clic exactamente en el nombre de la carpeta",
  "Use submenus": "Usar submen煤s",
  "Use submenus for file/folder commands": "Usar submen煤s para comandos de archivo/carpeta",
  "Style settings": "Configuraci贸n de estilo",
  "Hide collapse icon": "Ocultar icono de colapso",
  "Hide the collapse icon in the file explorer next to the name of a folder when a folder only contains a folder note": "Ocultar el icono de colapso en el explorador de archivos junto al nombre de una carpeta cuando una carpeta solo contiene una nota de carpeta",
  "Underline the name of folder notes": "Subrayar el nombre de las notas de carpeta",
  "Add an underline to folders that have a folder note in the file explorer": "Agregar un subrayado a las carpetas que tienen una nota de carpeta en el explorador de archivos",
  "Bold the name of folder notes": "Poner en negrita el nombre de las notas de carpeta",
  "Make the folder name bold in the file explorer": "Hacer que el nombre de la carpeta est茅 en negrita en el explorador de archivos",
  "Cursive the name of folder notes": "Poner en cursiva el nombre de las notas de carpeta",
  "Make the folder name cursive in the file explorer": "Hacer que el nombre de la carpeta est茅 en cursiva en el explorador de archivos",
  "Open folder note through path": "Abrir nota de carpeta a trav茅s de la ruta",
  "Open a folder note when clicking on a folder name in the path if it is a folder note": "Abrir una nota de carpeta al hacer clic en un nombre de carpeta en la ruta si es una nota de carpeta",
  "Change folder name in the path": "Cambiar nombre de carpeta en la ruta",
  "Automatically rename a folder name in the path above a note when the folder note is renamed": "Renombrar autom谩ticamente un nombre de carpeta en la ruta sobre una nota cuando se renombra la nota de carpeta",
  "Underline folders in the path": "Subrayar carpetas en la ruta",
  "Add an underline to folders that have a folder note in the path above a note": "Agregar un subrayado a las carpetas que tienen una nota de carpeta en la ruta sobre una nota",
  "Bold folders in the path": "Carpetas en negrita en la ruta",
  "Make the folder name bold in the path above a note": "Hacer que el nombre de la carpeta est茅 en negrita en la ruta sobre una nota",
  "Cursive the name of folder notes in the path": "Poner en cursiva el nombre de las notas de carpeta en la ruta",
  "Make the folder name cursive in the path above a note": "Hacer que el nombre de la carpeta est茅 en cursiva en la ruta sobre una nota",
  "Add {regex} at the beginning of the folder name to use a regex pattern.": "Agregar {regex} al principio del nombre de la carpeta para usar un patr贸n regex.",
  "Use * before and after to exclude folders that include the name between the *s.": "Usar * antes y despu茅s para excluir carpetas que incluyen el nombre entre los *s.",
  "Use * before the folder name to exclude folders that end with the folder name.": "Usar * antes del nombre de la carpeta para excluir carpetas que terminan con el nombre de la carpeta.",
  "Use * after the folder name to exclude folders that start with the folder name.": "Usar * despu茅s del nombre de la carpeta para excluir carpetas que comienzan con el nombre de la carpeta.",
  "The regexes and wildcards are only for the folder name, not the path.": "Las expresiones regulares y comodines son solo para el nombre de la carpeta, no para la ruta.",
  "If you want to switch to a folder path delete the pattern first.": "Si deseas cambiar a una ruta de carpeta, elimina primero el patr贸n.",
  "Choose the file types that should be supported for folder notes. (e.g. if you click on a folder name it searches for all file extensions that are supported)": "Elige los tipos de archivo que deben ser soportados para notas de carpeta. (por ejemplo, si haces clic en un nombre de carpeta busca todas las extensiones de archivo que son soportadas)",
  "Adding more file types may cause performance issues becareful when adding more file types and don't add too many.": "Agregar m谩s tipos de archivo puede causar problemas de rendimiento, ten cuidado al agregar m谩s tipos de archivo y no agregues demasiados.",
  "Requires a restart to take effect": "Requiere reiniciar para que surta efecto",
  "Chameleon": "Camale贸n",
  "Chameleon: A translation plugin for Obsidian that provides multilingual support.": "Camale贸n: Un complemento de traducci贸n para Obsidian que proporciona soporte multiling眉e.",
  "Folder notes": "Notas de carpeta",
  "Create notes within folders that can be accessed without collapsing the folder, similar to the functionality offered in Notion.": "Crear notas dentro de carpetas que pueden ser accedidas sin colapsar la carpeta, similar a la funcionalidad ofrecida en Notion.",
  "Smart Second Brain": "Segundo Cerebro Inteligente",
  "Interact with your privacy focused assistant, leveraging Ollama or OpenAI, making your second brain even smarter.": "Interact煤a con tu asistente enfocado en la privacidad, aprovechando Ollama o OpenAI, haciendo tu segundo cerebro a煤n m谩s inteligente.",
  "Expand lists to full width in list view": "Expandir listas a ancho completo en vista de lista",
  "Lazy Plugin Loader": "Cargador Perezoso de Complementos",
  "Load plugins with a delay on startup, so that you can get your app startup down into the sub-second loading time.": "Cargar complementos con un retraso al inicio, para que puedas reducir el tiempo de inicio de tu aplicaci贸n a menos de un segundo.",
  "Specify custom date format. E.g. \"YYYY-MM-DD HH:mm:ss. See": "Especificar formato de fecha personalizado. Por ejemplo \"YYYY-MM-DD HH:mm:ss. Ver",
  "for more formats.": "para m谩s formatos.",
  "The commit hash, author name and authoring date can all be individually toggled.": "El hash del commit, nombre del autor y fecha de autor铆a pueden alternarse individualmente.",
  "Hide everything, to only show the age-colored sidebar.": "Ocultar todo, para mostrar solo la barra lateral coloreada por edad.",
  "Diff view style": "Estilo de vista de diferencias",
  "Split": "Dividido",
  "Unified": "Unificado",
  "Set the style for the diff view. Note that the actual diff in \"Split\" mode is not generated by Git, but the editor itself instead so it may differ from the diff generated by Git. One advantage of this is that you can edit the text in that view.": "Establecer el estilo para la vista de diferencias. Ten en cuenta que la diferencia real en modo \"Dividido\" no es generada por Git, sino por el editor mismo, por lo que puede diferir de la diferencia generada por Git. Una ventaja de esto es que puedes editar el texto en esa vista.",
  "Theme Info": "Informaci贸n del tema",
  "Components": "Componentes",
  "Appearance (light mode)": "Apariencia (modo claro)",
  "Appearance (dark mode)": "Apariencia (modo oscuro)",
  "Mobile": "M贸vil",
  "Plugin": "Complemento",
  "Editor": "Editor"
}