{
  "Reminder plugin for Obsidian. This plugin adds feature to manage TODOs with reminder.": "Plugin de rappel pour Obsidian. Ce plugin ajoute une fonctionnalité pour gérer les TODOs avec rappel.",
  "AidenLx's Folder Note": "Note de dossier d'AidenLx",
  "Add description, summary and more info to folders with folder notes.": "Ajoutez des descriptions, des résumés et plus d'informations aux dossiers avec les notes de dossier.",
  "AidenLx's Folder Note - folderv component": "Note de dossier d'AidenLx - composant folderv",
  "Optional `folderv` Component for alx-folder-note": "Composant `folderv` optionnel pour alx-folder-note",
  "Auto Card Link": "Lien de carte automatique",
  "Automatically fetches metadata from a url and makes it as a card-styled link": "Récupère automatiquement les métadonnées d'une URL et les transforme en lien de style carte",
  "Auto Link Title": "Titre de lien automatique",
  "This plugin automatically fetches the titles of links from the web": "Ce plugin récupère automatiquement les titres des liens depuis le web",
  "BRAT": "BRAT",
  "Easily install a beta version of a plugin for testing.": "Installez facilement une version bêta d'un plugin pour les tests.",
  "Editing Toolbar": "Barre d'outils d'édition",
  "The Obsidian Editing Toolbar is modified from cmenu, which provides more powerful customization settings and has many built-in editing commands to be a MS Word-like toolbar editing experience.": "La barre d'outils d'édition Obsidian est modifiée à partir de cmenu, qui fournit des paramètres de personnalisation plus puissants et de nombreuses commandes d'édition intégrées pour une expérience d'édition similaire à MS Word.",
  "Execute Code": "Exécuter le code",
  "Allows to execute code snippets within a note. Supported programming languages:  C, CPP, Dart, Golang, Groovy, Kotlin, Java, JavaScript, TypeScript, Lean, Lua, CSharp, Prolog, Rust, Python, R, Ruby, Wolfram Mathematica, Haskell, Scala, Racket, F#, Batch, Shell & Powershell.": "Permet d'exécuter des extraits de code dans une note. Langages de programmation pris en charge : C, CPP, Dart, Golang, Groovy, Kotlin, Java, JavaScript, TypeScript, Lean, Lua, CSharp, Prolog, Rust, Python, R, Ruby, Wolfram Mathematica, Haskell, Scala, Racket, F#, Batch, Shell & Powershell.",
  "Fast Image Cleaner": "Nettoyeur d'images rapide",
  "This plugin allows you to quickly remove image attachment and referenced link from your documents in both LIVE , READ mode by right-click menu": "Ce plugin vous permet de supprimer rapidement les pièces jointes d'images et les liens référencés de vos documents en mode LIVE et READ via le menu contextuel",
  "Folder Note Core": "Core de note de dossier",
  "Provide core features and API for folder notes": "Fournit des fonctionnalités de base et une API pour les notes de dossier",
  "Git": "Git",
  "Integrate Git version control with automatic backup and other advanced features.": "Intègre le contrôle de version Git avec sauvegarde automatique et autres fonctionnalités avancées.",
  "Kanban": "Kanban",
  "Create markdown-backed Kanban boards in Obsidian.": "Créez des tableaux Kanban basés sur Markdown dans Obsidian.",
  "Links": "Liens",
  "Manipulate links": "Manipuler les liens",
  "MySnippets": "Mes extraits",
  "MySnippets is a plugin that adds a status bar menu allowing the user to quickly toggle their snippets on and off 🖌.": "MySnippets est un plugin qui ajoute un menu dans la barre d'état permettant à l'utilisateur d'activer et de désactiver rapidement ses extraits 🖌.",
  "proxy github": "proxy github",
  "Reminder": "Rappel",
  "Style Settings": "Paramètres de style",
  "Offers controls for adjusting theme, plugin, and snippet CSS variables.": "Offre des contrôles pour ajuster les variables CSS du thème, des plugins et des extraits.",
  "Templater": "Templater",
  "Create and use templates": "Créer et utiliser des modèles",
  "Inside Folder, Index File": "Dans le dossier, fichier d'index",
  "Inside Folder, With Same Name": "Dans le dossier, avec le même nom",
  "Outside Folder, With Same Name": "En dehors du dossier, avec le même nom",
  "Icon Shortcodes v0.5.1+": "Codes courts d'icônes v0.5.1+",
  "Ctrl (Cmd in macOS)": "Ctrl (Cmd sous macOS)",
  "Ctrl (Ctrl in macOS)": "Ctrl (Ctrl sous macOS)",
  "Alt": "Alt",
  "TRACE": "TRACE",
  "DEBUG": "DEBUG",
  "INFO": "INFO",
  "WARN": "AVERTISSEMENT",
  "ERROR": "ERREUR",
  "SILENT": "SILENCIEUX",
  "Notify if startup takes longer than expected": "Notifier si le démarrage prend plus de temps que prévu",
  "Diagnose issues with your app by seeing what is causing the app to load slowly.": "Diagnostiquez les problèmes de votre application en voyant ce qui cause le chargement lent.",
  "Enhance Default Paste": "Améliorer le collage par défaut",
  "Fetch the link title when pasting a link in the editor with the default paste command": "Récupérer le titre du lien lors du collage d'un lien dans l'éditeur avec la commande de collage par défaut",
  "Enhance Drop Events": "Améliorer les événements de glisser-déposer",
  "Fetch the link title when drag and dropping a link from another program": "Récupérer le titre du lien lors du glisser-déposer d'un lien depuis un autre programme",
  "Maximum title length": "Longueur maximale du titre",
  "Set the maximum length of the title. Set to 0 to disable.": "Définir la longueur maximale du titre. Mettre à 0 pour désactiver.",
  "Preserve selection as title": "Conserver la sélection comme titre",
  "Whether to prefer selected text as title over fetched title when pasting": "Préférer ou non le texte sélectionné comme titre plutôt que le titre récupéré lors du collage",
  "Website Blacklist": "Liste noire des sites web",
  "List of strings (comma separated) that disable autocompleting website titles. Can be URLs or arbitrary text.": "Liste de chaînes (séparées par des virgules) qui désactivent l'autocomplétion des titres de sites web. Peut être des URLs ou du texte arbitraire.",
  "Use New Scraper": "Utiliser le nouveau scraper",
  "Use experimental new scraper, seems to work well on desktop but not mobile.": "Utiliser le nouveau scraper expérimental, semble bien fonctionner sur ordinateur mais pas sur mobile.",
  "Use Better Fetching Placeholder": "Utiliser un meilleur placeholder de récupération",
  "Use a more readable placeholder when fetching the title of a link.": "Utiliser un placeholder plus lisible lors de la récupération du titre d'un lien.",
  "LinkPreview API Key": "Clé API LinkPreview",
  "API key for the LinkPreview.net service. Get one at https://my.linkpreview.net/access_keys": "Clé API pour le service LinkPreview.net. Obtenez-en une sur https://my.linkpreview.net/access_keys",
  "Auto-enable plugins after installation": "Activer automatiquement les plugins après l'installation",
  "If enabled beta plugins will be automatically enabled after installtion by default. Note: you can toggle this on and off for each plugin in the \"Add Plugin\" form.": "Si activé, les plugins bêta seront automatiquement activés après l'installation par défaut. Note : vous pouvez activer et désactiver cela pour chaque plugin dans le formulaire \"Ajouter un plugin\".",
  "Auto-update plugins at startup": "Mise à jour automatique des plugins au démarrage",
  "If enabled all beta plugins will be checked for updates each time Obsidian starts. Note: this does not update frozen version plugins.": "Si activé, tous les plugins bêta seront vérifiés pour les mises à jour à chaque démarrage d'Obsidian. Note : cela ne met pas à jour les plugins en version gelée.",
  "Auto-update themes at startup": "Mise à jour automatique des thèmes au démarrage",
  "If enabled all beta themes will be checked for updates each time Obsidian starts.": "Si activé, tous les thèmes bêta seront vérifiés pour les mises à jour à chaque démarrage d'Obsidian.",
  "Learn more about my work at:": "En savoir plus sur mon travail sur :",
  "Beta plugin list": "Liste des plugins bêta",
  "The following is a list of beta plugins added via the command palette \"Add a beta plugin for testing\" or \"Add a beta plugin with frozen version for testing\". A frozen version is a specific release of a plugin based on its release tag.": "Voici une liste des plugins bêta ajoutés via la palette de commandes \"Ajouter un plugin bêta pour test\" ou \"Ajouter un plugin bêta avec version gelée pour test\". Une version gelée est une version spécifique d'un plugin basée sur son tag de version.",
  "Click the x button next to a plugin to remove it from the list.": "Cliquez sur le bouton x à côté d'un plugin pour le retirer de la liste.",
  "Note:": "Note :",
  "This does not delete the plugin, this should be done from the  Community Plugins tab in Settings.": "Cela ne supprime pas le plugin, cela doit être fait depuis l'onglet Plugins communautaires dans les Paramètres.",
  "Add Beta plugin": "Ajouter un plugin bêta",
  "obsidian-canzi/Enhanced-editing": "obsidian-canzi/Enhanced-editing",
  "Add Beta plugin with frozen version": "Ajouter un plugin bêta avec version gelée",
  "Beta themes list": "Liste des thèmes bêta",
  "Add Beta Theme": "Ajouter un thème bêta",
  "Monitoring": "Surveillance",
  "Enable Notifications": "Activer les notifications",
  "BRAT will provide popup notifications for its various activities. Turn this off means  no notifications from BRAT.": "BRAT fournira des notifications popup pour ses diverses activités. Désactiver cela signifie pas de notifications de BRAT.",
  "Enable Logging": "Activer la journalisation",
  "Plugin updates will be logged to a file in the log file.": "Les mises à jour des plugins seront enregistrées dans un fichier journal.",
  "BRAT Log File Location": "Emplacement du fichier journal BRAT",
  "Logs will be saved to this file. Don't add .md to the file name.": "Les journaux seront sauvegardés dans ce fichier. N'ajoutez pas .md au nom du fichier.",
  "Enable Verbose Logging": "Activer la journalisation détaillée",
  "Get a lot  more information in  the log.": "Obtenir beaucoup plus d'informations dans le journal.",
  "Debugging Mode": "Mode débogage",
  "Atomic Bomb level console logging. Can be used for troubleshoting and development.": "Journalisation console niveau bombe atomique. Peut être utilisé pour le dépannage et le développement.",
  "Personal Access Token": "Jeton d'accès personnel",
  "If you need to access private repositories, enter the personal access token here.": "Si vous devez accéder à des dépôts privés, entrez le jeton d'accès personnel ici.",
  "Obsidian Editing Toolbar": "Barre d'outils d'édition Obsidian",
  "body": "corps",
  "workspace": "espace de travail",
  "glass": "verre",
  "default": "par défaut",
  "tiny": "minuscule",
  "fixed": "fixe",
  "following": "suivant",
  "top": "haut",
  "undo editor": "annuler l'éditeur",
  "redo editor": "refaire l'éditeur",
  "Clear text formatting": "Effacer la mise en forme du texte",
  "Header 1": "Titre 1",
  "Header 2": "Titre 2", 
  "Header 3": "Titre 3",
  "submenu": "sous-menu",
  "Header 4": "Titre 4",
  "Header 5": "Titre 5",
  "Header 6": "Titre 6",
  "Toggle bold": "Basculer en gras",
  "Toggle italics": "Basculer en italique",
  "Toggle strikethrough": "Basculer en barré",
  "Toggle underline": "Basculer en souligné",
  "==Toggle highlight ==": "==Basculer en surligné==",
  "Toggle blockquote": "Basculer en citation",
  "Toggle superscript": "Basculer en exposant",
  "Toggle subscript": "Basculer en indice",
  "inline code": "code en ligne",
  "Toggle codeblock": "Basculer en bloc de code",
  "insert wikilink [[]]": "insérer un lien wiki [[]]",
  "insert link []()": "insérer un lien []()",
  "insert embed ![[]]": "insérer un contenu intégré ![[]]",
  "Horizontal divider": "Séparateur horizontal",
  "submenu-list": "sous-menu-liste",
  "numbered list": "liste numérotée",
  "bullet list": "liste à puces",
  "unindent-list": "désindenter la liste",
  "indent list": "indenter la liste",
  "submenu-aligin": "sous-menu-alignement",
  "Settings for the Code Execution Plugin.": "Paramètres du plugin d'exécution de code.",
  "General Settings": "Paramètres généraux",
  "Timeout (in seconds)": "Délai d'expiration (en secondes)",
  "The time after which a program gets shut down automatically. This is to prevent infinite loops.": "Le délai après lequel un programme s'arrête automatiquement. Cela permet d'éviter les boucles infinies.",
  "Allow Input": "Autoriser l'entrée",
  "Whether or not to include a stdin input box when running blocks. In order to apply changes to this, Obsidian must be refreshed.": "Inclure ou non une zone de saisie stdin lors de l'exécution des blocs. Pour appliquer les modifications, Obsidian doit être actualisé.",
  "WSL Mode": "Mode WSL",
  "Whether or not to run code in the Windows Subsystem for Linux. If you don't have WSL installed, don't turn this on!": "Exécuter ou non le code dans le sous-système Windows pour Linux. Si vous n'avez pas installé WSL, n'activez pas cette option !",
  "[Experimental] Persistent Output": "[Expérimental] Sortie persistante",
  "If enabled, the output of the code block is written into the markdown file. This feature is experimental and may not work as expected.": "Si activé, la sortie du bloc de code est écrite dans le fichier markdown. Cette fonctionnalité est expérimentale et peut ne pas fonctionner comme prévu.",
  "Language-Specific Settings": "Paramètres spécifiques aux langages",
  "Pick a language to edit its language-specific settings": "Choisissez un langage pour modifier ses paramètres spécifiques",
  "JavaScript / Node Settings": "Paramètres JavaScript / Node",
  "Node path": "Chemin Node",
  "Node arguments": "Arguments Node",
  "Run Javascript blocks in Notebook Mode": "Exécuter les blocs Javascript en mode Notebook",
  "Inject Javascript code": "Injecter du code Javascript",
  "Code to add to the top of every Javascript code block before running.": "Code à ajouter en haut de chaque bloc de code Javascript avant l'exécution.",
  "TypeScript Settings": "Paramètres TypeScript",
  "ts-node path": "Chemin ts-node",
  "TypeScript arguments": "Arguments TypeScript",
  "Inject Typescript code": "Injecter du code Typescript",
  "Code to add to the top of every Typescript code block before running.": "Code à ajouter en haut de chaque bloc de code Typescript avant l'exécution.",
  "Lean Settings": "Paramètres Lean",
  "lean path": "Chemin Lean",
  "Lean arguments": "Arguments Lean",
  "Inject Lean code": "Injecter du code Lean",
  "Code to add to the top of every Lean code block before running.": "Code à ajouter en haut de chaque bloc de code Lean avant l'exécution.",
  "Lua Settings": "Paramètres Lua",
  "lua path": "Chemin Lua",
  "Lua arguments": "Arguments Lua",
  "Inject Lua code": "Injecter du code Lua",
  "Code to add to the top of every Lua code block before running.": "Code à ajouter en haut de chaque bloc de code Lua avant l'exécution.",
  "Dart Settings": "Paramètres Dart",
  "dart path": "Chemin Dart",
  "Dart arguments": "Arguments Dart",
  "Inject Dart code": "Injecter du code Dart",
  "Code to add to the top of every Dart code block before running.": "Code à ajouter en haut de chaque bloc de code Dart avant l'exécution.",
  "CSharp Settings": "Paramètres C#",
  "dotnet path": "Chemin dotnet",
  "CSharp arguments": "Arguments C#",
  "Inject C# code": "Injecter du code C#",
  "Code to add to the top of every C# code block before running.": "Code à ajouter en haut de chaque bloc de code C# avant l'exécution.",
  "Java Settings": "Paramètres Java",
  "Java path (Java 11 or higher)": "Chemin Java (Java 11 ou supérieur)",
  "The path to your Java installation.": "Le chemin vers votre installation Java.",
  "Java arguments": "Arguments Java",
  "Inject Java code": "Injecter du code Java",
  "Code to add to the top of every Java code block before running.": "Code à ajouter en haut de chaque bloc de code Java avant l'exécution.",
  "Python Settings": "Paramètres Python",
  "Embed Python Plots": "Intégrer les graphiques Python",
  "Python path": "Chemin Python",
  "The path to your Python installation.": "Le chemin vers votre installation Python.",
  "Python arguments": "Arguments Python",
  "Run Python blocks in Notebook Mode": "Exécuter les blocs Python en mode Notebook",
  "Inject Python code": "Injecter du code Python",
  "Code to add to the top of every Python code block before running.": "Code à ajouter en haut de chaque bloc de code Python avant l'exécution.",
  "Golang Settings": "Paramètres Golang",
  "Golang Path": "Chemin Golang",
  "The path to your Golang installation.": "Le chemin vers votre installation Golang.",
  "Inject Golang code": "Injecter du code Golang",
  "Code to add to the top of every Golang code block before running.": "Code à ajouter en haut de chaque bloc de code Golang avant l'exécution.",
  "Rust Settings": "Paramètres Rust",
  "Cargo Path": "Chemin Cargo",
  "The path to your Cargo installation.": "Le chemin vers votre installation Cargo.",
  "Inject Rust code": "Injecter du code Rust",
  "Code to add to the top of every Rust code block before running.": "Code à ajouter en haut de chaque bloc de code Rust avant l'exécution.",
  "C++ Settings": "Paramètres C++",
  "Cling path": "Chemin Cling",
  "The path to your Cling installation.": "Le chemin vers votre installation Cling.",
  "Cling arguments for C++": "Arguments Cling pour C++",
  "Cling std": "Standard Cling",
  "C++ 98": "C++ 98",
  "C++ 11": "C++ 11", 
  "C++ 14": "C++ 14",
  "C++ 17": "C++ 17",
  "C++ 20": "C++ 20",
  "Use main function": "Utiliser la fonction main",
  "If enabled, will use a main() function as the code block entrypoint.": "Si activé, utilisera une fonction main() comme point d'entrée du bloc de code.",
  "Inject C++ code": "Injecter du code C++",
  "Code to add to the top of every C++ code block before running.": "Code à ajouter en haut de chaque bloc de code C++ avant l'exécution.",
  "C Settings": "Paramètres C",
  "gcc / Cling path": "Chemin gcc / Cling",
  "The path to your gcc / Cling installation.": "Le chemin vers votre installation gcc / Cling.",
  "gcc / Cling arguments for C": "Arguments gcc / Cling pour C",
  "Cling std (ignored for gcc)": "Standard Cling (ignoré pour gcc)",
  "Use main function (mandatory for gcc)": "Utiliser la fonction main (obligatoire pour gcc)",
  "Inject C code": "Injecter du code C",
  "Code to add to the top of every C code block before running.": "Code à ajouter en haut de chaque bloc de code C avant l'exécution.",
  "Batch Settings": "Paramètres Batch",
  "Batch path": "Chemin Batch",
  "The path to the terminal. Default is command prompt.": "Le chemin vers le terminal. Par défaut c'est l'invite de commandes.",
  "Batch arguments": "Arguments Batch",
  "Batch file extension": "Extension de fichier Batch",
  "Changes the file extension for generated batch scripts. Default is .bat": "Change l'extension de fichier pour les scripts batch générés. Par défaut c'est .bat",
  "Inject Batch code": "Injecter du code Batch",
  "Code to add to the top of every Batch code block before running.": "Code à ajouter en haut de chaque bloc de code Batch avant l'exécution.",
  "Shell Settings": "Paramètres Shell",
  "Shell path": "Chemin Shell",
  "The path to shell. Default is Bash but you can use any shell you want, e.g. bash, zsh, fish, ...": "Le chemin vers le shell. Par défaut c'est Bash mais vous pouvez utiliser n'importe quel shell, par ex. bash, zsh, fish, ...",
  "Shell arguments": "Arguments Shell",
  "Shell file extension": "Extension de fichier Shell",
  "Changes the file extension for generated shell scripts. This is useful if you want to use a shell other than bash.": "Change l'extension de fichier pour les scripts shell générés. C'est utile si vous voulez utiliser un shell autre que bash.",
  "Shell WSL mode": "Mode WSL Shell",
  "Run the shell script in Windows Subsystem for Linux. This option is used if the global \"WSL Mode\" is disabled.": "Exécute le script shell dans le sous-système Windows pour Linux. Cette option est utilisée si le \"Mode WSL\" global est désactivé.",
  "Inject Shell code": "Injecter du code Shell",
  "Code to add to the top of every Shell code block before running.": "Code à ajouter en haut de chaque bloc de code Shell avant l'exécution.",
  "Powershell Settings": "Paramètres Powershell",
  "Powershell path": "Chemin Powershell",
  "The path to Powershell.": "Le chemin vers Powershell.",
  "Powershell arguments": "Arguments Powershell",
  "Powershell file extension": "Extension de fichier Powershell",
  "Changes the file extension for generated shell scripts. This is useful if you don't want to use PowerShell.": "Change l'extension de fichier pour les scripts shell générés. C'est utile si vous ne voulez pas utiliser PowerShell.",
  "PowerShell script encoding": "Encodage de script PowerShell",
  "Windows still uses windows-1252 as default encoding on most systems for legacy reasons. If you change your encodings systemwide to UTF-8, you can change this setting to UTF-8 as well. Only use one of the following encodings: \"ascii\", \"utf8\", \"utf-8\", \"utf16le\", \"ucs2\", \"ucs-2\", \"base64\", \"latin1\", \"binary\", \"hex\" (default: \"latin1\")": "Windows utilise toujours windows-1252 comme encodage par défaut sur la plupart des systèmes pour des raisons de compatibilité. Si vous changez vos encodages système en UTF-8, vous pouvez également changer ce paramètre en UTF-8. Utilisez uniquement l'un des encodages suivants : \"ascii\", \"utf8\", \"utf-8\", \"utf16le\", \"ucs2\", \"ucs-2\", \"base64\", \"latin1\", \"binary\", \"hex\" (par défaut : \"latin1\")",
  "Inject Powershell code": "Injecter du code Powershell",
  "Code to add to the top of every Powershell code block before running.": "Code à ajouter en haut de chaque bloc de code Powershell avant l'exécution.",
  "Prolog Settings": "Paramètres Prolog",
  "Prolog Answer Limit": "Limite de réponses Prolog",
  "Maximal number of answers to be returned by the Prolog engine. tab is to prevent creating too huge texts in the notebook.": "Nombre maximal de réponses à retourner par le moteur Prolog. L'onglet permet d'éviter de créer des textes trop volumineux dans le carnet.",
  "Inject Prolog code": "Injecter du code Prolog",
  "Code to add to the top of every Prolog code block before running.": "Code à ajouter en haut de chaque bloc de code Prolog avant l'exécution.",
  "Groovy Settings": "Paramètres Groovy",
  "Groovy path": "Chemin Groovy",
  "The path to your Groovy installation.": "Le chemin vers votre installation Groovy.",
  "Groovy arguments": "Arguments Groovy",
  "Inject Groovy code": "Injecter du code Groovy",
  "Code to add to the top of every Groovy code block before running.": "Code à ajouter en haut de chaque bloc de code Groovy avant l'exécution.",
  "R Settings": "Paramètres R",
  "Embed R Plots created via `plot()` into Notes": "Intégrer les graphiques R créés via `plot()` dans les notes",
  "Rscript path": "Chemin Rscript",
  "The path to your Rscript installation. Ensure you provide the Rscript binary instead of the ordinary R binary.": "Le chemin vers votre installation Rscript. Assurez-vous de fournir le binaire Rscript au lieu du binaire R ordinaire.",
  "R arguments": "Arguments R",
  "Run R blocks in Notebook Mode": "Exécuter les blocs R en mode Notebook",
  "Inject R code": "Injecter du code R",
  "Code to add to the top of every R code block before running.": "Code à ajouter en haut de chaque bloc de code R avant l'exécution.",
  "Kotlin Settings": "Paramètres Kotlin",
  "Kotlin path": "Chemin Kotlin",
  "The path to your Kotlin installation.": "Le chemin vers votre installation Kotlin.",
  "Kotlin arguments": "Arguments Kotlin",
  "Inject Kotlin code": "Injecter du code Kotlin",
  "Code to add to the top of every Kotlin code block before running.": "Code à ajouter en haut de chaque bloc de code Kotlin avant l'exécution.",
  "Wolfram Mathematica Settings": "Paramètres Wolfram Mathematica",
  "Mathematica path": "Chemin Mathematica",
  "The path to your Mathematica installation.": "Le chemin vers votre installation Mathematica.",
  "Mathematica arguments": "Arguments Mathematica",
  "Inject Mathematica code": "Injecter du code Mathematica",
  "Code to add to the top of every Mathematica code block before running.": "Code à ajouter en haut de chaque bloc de code Mathematica avant l'exécution.",
  "Haskell Settings": "Paramètres Haskell",
  "Use Ghci": "Utiliser Ghci",
  "Run haskell code with ghci instead of runghc": "Exécuter le code Haskell avec ghci au lieu de runghc",
  "Ghci path": "Chemin Ghci",
  "The path to your ghci installation.": "Le chemin vers votre installation ghci.",
  "Rungch path": "Chemin Runghc",
  "The path to your runghc installation.": "Le chemin vers votre installation runghc.",
  "Ghc path": "Chemin Ghc",
  "The Ghc path your runghc installation will call.": "Le chemin Ghc que votre installation runghc appellera.",
  "Inject Haskell code": "Injecter du code Haskell",
  "Code to add to the top of every Haskell code block before running.": "Code à ajouter en haut de chaque bloc de code Haskell avant l'exécution.",
  "Scala Settings": "Paramètres Scala",
  "scala path": "Chemin Scala",
  "Path to your scala installation": "Chemin vers votre installation Scala",
  "Scala arguments": "Arguments Scala",
  "Inject Scala code": "Injecter du code Scala",
  "Code to add to the top of every Scala code block before running.": "Code à ajouter en haut de chaque bloc de code Scala avant l'exécution.",
  "Swift Settings": "Paramètres Swift",
  "Swift path": "Chemin Swift",
  "The path to your Swift installation.": "Le chemin vers votre installation Swift.",
  "Swift arguments": "Arguments Swift",
  "Inject Swift code": "Injecter du code Swift",
  "Code to add to the top of every Swift code block before running.": "Code à ajouter en haut de chaque bloc de code Swift avant l'exécution.",
  "Racket Settings": "Paramètres Racket",
  "racket path": "Chemin Racket",
  "Path to your racket installation": "Chemin vers votre installation Racket",
  "Racket arguments": "Arguments Racket",
  "Inject Racket code": "Injecter du code Racket",
  "Code to add to the top of every Racket code block before running.": "Code à ajouter en haut de chaque bloc de code Racket avant l'exécution.",
  "F# Settings": "Paramètres F#",
  "F# path": "Chemin F#",
  "The path to dotnet.": "Le chemin vers dotnet.",
  "F# arguments": "Arguments F#",
  "F# file extension": "Extension de fichier F#",
  "Changes the file extension for generated F# scripts.": "Change l'extension de fichier pour les scripts F# générés.",
  "Inject F# code": "Injecter du code F#",
  "Code to add to the top of every F# code block before running.": "Code à ajouter en haut de chaque bloc de code F# avant l'exécution.",
  "Ruby Settings": "Paramètres Ruby",
  "ruby path": "Chemin Ruby",
  "Path to your ruby installation": "Chemin vers votre installation Ruby",
  "ruby arguments": "Arguments Ruby",
  "Inject Ruby code": "Injecter du code Ruby",
  "Code to add to the top of every Ruby code block before running.": "Code à ajouter en haut de chaque bloc de code Ruby avant l'exécution.",
  "SQL Settings": "Paramètres SQL",
  "SQL path": "Chemin SQL",
  "Path to your SQL installation. You can select the SQL dialect you prefer but you need to set the right arguments by yourself.": "Chemin vers votre installation SQL. Vous pouvez sélectionner le dialecte SQL que vous préférez mais vous devez définir les bons arguments vous-même.",
  "SQL arguments": "Arguments SQL",
  "Set the right arguments for your database.": "Définissez les bons arguments pour votre base de données.",
  "Inject SQL code": "Injecter du code SQL",
  "Code to add to the top of every SQL code block before running.": "Code à ajouter en haut de chaque bloc de code SQL avant l'exécution.",
  "Octave Settings": "Paramètres Octave",
  "Octave path": "Chemin Octave",
  "The path to your Octave installation.": "Le chemin vers votre installation Octave.",
  "Octave arguments": "Arguments Octave",
  "Inject Octave code": "Injecter du code Octave",
  "Code to add to the top of every Octave code block before running.": "Code à ajouter en haut de chaque bloc de code Octave avant l'exécution.",
  "Maxima Settings": "Paramètres Maxima",
  "Maxima path": "Chemin Maxima",
  "The path to your Maxima installation.": "Le chemin vers votre installation Maxima.",
  "Maxima arguments": "Arguments Maxima",
  "Inject Maxima code": "Injecter du code Maxima",
  "Code to add to the top of every Maxima code block before running.": "Code à ajouter en haut de chaque bloc de code Maxima avant l'exécution.",
  "Applescript Settings": "Paramètres Applescript",
  "Osascript path": "Chemin Osascript",
  "The path to your osascript installation (only available on MacOS).": "Le chemin vers votre installation osascript (uniquement disponible sur MacOS).",
  "Applescript arguments": "Arguments Applescript",
  "Inject Applescript code": "Injecter du code Applescript",
  "Code to add to the top of every Applescript code block before running.": "Code à ajouter en haut de chaque bloc de code Applescript avant l'exécution.",
  "Zig Settings": "Paramètres Zig",
  "zig path": "Chemin Zig",
  "Path to your zig installation": "Chemin vers votre installation Zig",
  "zig arguments": "Arguments Zig",
  "Inject Zig code": "Injecter du code Zig",
  "Code to add to the top of every Zig code block before running.": "Code à ajouter en haut de chaque bloc de code Zig avant l'exécution.",
  "OCaml Settings": "Paramètres OCaml",
  "ocaml path": "Chemin OCaml",
  "Path to your ocaml installation": "Chemin vers votre installation OCaml",
  "ocaml arguments": "Arguments OCaml",
  "Inject OCaml code": "Injecter du code OCaml",
  "Code to add to the top of every OCaml code block before running.": "Code à ajouter en haut de chaque bloc de code OCaml avant l'exécution.",
  "PHP Settings": "Paramètres PHP",
  "php path": "Chemin PHP",
  "Path to your php installation": "Chemin vers votre installation PHP",
  "php arguments": "Arguments PHP",
  "Inject PHP code": "Injecter du code PHP",
  "Code to add to the top of every PHP code block before running.": "Code à ajouter en haut de chaque bloc de code PHP avant l'exécution.",
  "Fast Attachment Cleaner Settings": "Paramètres du nettoyeur rapide de pièces jointes",
  "Deleted Attachment Destination": "Destination des pièces jointes supprimées",
  "Select where you want Attachments to be moved once they are deleted": "Sélectionnez où vous voulez que les pièces jointes soient déplacées une fois supprimées",
  "Delete Permanently": "Supprimer définitivement",
  "Move to Obsidian Trash": "Déplacer vers la corbeille d'Obsidian",
  "Move to System Trash": "Déplacer vers la corbeille système",
  "Automatic": "Automatique",
  "Split timers for automatic commit and sync": "Minuteurs séparés pour la validation et la synchronisation automatiques",
  "Enable to use one interval for commit and another for sync.": "Activer pour utiliser un intervalle pour la validation et un autre pour la synchronisation.",
  "Auto commit interval (minutes)": "Intervalle de validation automatique (minutes)",
  "Commit changes every X minutes. Set to 0 (default) to disable. (See below setting for further configuration!)": "Valider les changements toutes les X minutes. Mettre à 0 (par défaut) pour désactiver. (Voir le paramètre ci-dessous pour plus de configuration !)",
  "Auto commit after stopping file edits": "Validation automatique après l'arrêt des modifications de fichiers",
  "Requires the commit interval not to be 0.\n                        If turned on, do auto commit every 30 minutes after stopping file edits.\n                        This also prevents auto commit while editing a file. If turned off, it's independent from the last file edit.": "Nécessite que l'intervalle de validation ne soit pas 0.\n                        Si activé, effectue une validation automatique toutes les 30 minutes après l'arrêt des modifications de fichiers.\n                        Cela empêche également la validation automatique pendant l'édition d'un fichier. Si désactivé, c'est indépendant de la dernière modification de fichier.",
  "Auto commit after latest commit": "Validation automatique après la dernière validation",
  "If turned on, sets last auto commit timestamp to the latest commit timestamp. This reduces the frequency of auto commit when doing manual commits.": "Si activé, définit l'horodatage de la dernière validation automatique sur celui de la dernière validation. Cela réduit la fréquence des validations automatiques lors des validations manuelles.",
  "Auto push interval (minutes)": "Intervalle de poussée automatique (minutes)",
  "Push commits every X minutes. Set to 0 (default) to disable.": "Pousser les validations toutes les X minutes. Mettre à 0 (par défaut) pour désactiver.",
  "Auto pull interval (minutes)": "Intervalle de tirage automatique (minutes)",
  "Pull changes every X minutes. Set to 0 (default) to disable.": "Tirer les changements toutes les X minutes. Mettre à 0 (par défaut) pour désactiver.",
  "Specify custom commit message on auto commit": "Spécifier un message de validation personnalisé pour la validation automatique",
  "You will get a pop up to specify your message.": "Vous aurez une fenêtre pop-up pour spécifier votre message.",
  "Commit message on auto commit": "Message de validation pour la validation automatique",
  "Available placeholders: {{date}} (see below), {{hostname}} (see below), {{numFiles}} (number of changed files in the commit) and {{files}} (changed files in commit message).": "Placeholders disponibles : {{date}} (voir ci-dessous), {{hostname}} (voir ci-dessous), {{numFiles}} (nombre de fichiers modifiés dans la validation) et {{files}} (fichiers modifiés dans le message de validation).",
  "Commit message": "Message de validation",
  "Commit message on manual commit": "Message de validation pour la validation manuelle",
  "{{date}} placeholder format": "Format du placeholder {{date}}",
  "Moment.js": "Moment.js",
  "{{hostname}} placeholder replacement": "Remplacement du placeholder {{hostname}}",
  "Specify custom hostname for every device.": "Spécifier un nom d'hôte personnalisé pour chaque appareil.",
  "Preview commit message": "Aperçu du message de validation",
  "Preview": "Aperçu",
  "List filenames affected by commit in the commit body": "Lister les noms de fichiers affectés par la validation dans le corps de la validation",
  "Pull": "Tirer",
  "Merge strategy": "Stratégie de fusion",
  "Decide how to integrate commits from your remote branch into your local branch.": "Décidez comment intégrer les commits de votre branche distante dans votre branche locale.",
  "Merge": "Fusionner",
  "Rebase": "Rebase",
  "Other sync service (Only updates the HEAD without touching the working directory)": "Autre service de synchronisation (Met à jour uniquement HEAD sans toucher au répertoire de travail)",
  "Pull on startup": "Tirer au démarrage",
  "Automatically pull commits when Obsidian starts.": "Tire automatiquement les commits au démarrage d'Obsidian.",
  "Commit-and-sync": "Valider-et-synchroniser",
  "Commit-and-sync with default settings means staging everything -> committing -> pulling -> pushing. Ideally this is a single action that you do regularly to keep your local and remote repository in sync.": "Valider-et-synchroniser avec les paramètres par défaut signifie indexer tout -> valider -> tirer -> pousser. Idéalement, c'est une action unique que vous effectuez régulièrement pour garder vos dépôts local et distant synchronisés.",
  "Push on commit-and-sync": "Pousser lors de la validation-et-synchronisation",
  "Most of the time you want to push after committing. Turning this off turns a commit-and-sync action into commit only. It will still be called commit-and-sync.": "La plupart du temps, vous voulez pousser après avoir validé. Désactiver ceci transforme une action de validation-et-synchronisation en validation uniquement. Elle sera toujours appelée validation-et-synchronisation.",
  "Pull on commit-and-sync": "Tirer lors de la validation-et-synchronisation",
  "On commit-and-sync, pull commits as well. Turning this off turns a commit-and-sync action into commit only.": "Lors de la validation-et-synchronisation, tire également les commits. Désactiver ceci transforme une action de validation-et-synchronisation en validation uniquement.",
  "Line author information": "Informations sur l'auteur de la ligne",
  "Show commit authoring information next to each line": "Afficher les informations d'auteur du commit à côté de chaque ligne",
  "Feature guide and quick examples": "Guide des fonctionnalités et exemples rapides",
  "History view": "Vue historique",
  "Show Author": "Afficher l'auteur",
  "Show the author of the commit in the history view.": "Afficher l'auteur du commit dans la vue historique.",
  "Hide": "Masquer",
  "Full": "Complet",
  "Initials": "Initiales",
  "Show Date": "Afficher la date",
  "Show the date of the commit in the history view. The {{date}} placeholder format is used to display the date.": "Afficher la date du commit dans la vue historique. Le format d'espace réservé {{date}} est utilisé pour afficher la date.",
  "Source control view": "Vue contrôle de source",
  "Automatically refresh source control view on file changes": "Actualiser automatiquement la vue contrôle de source lors des modifications de fichiers",
  "On slower machines this may cause lags. If so, just disable this option.": "Sur les machines plus lentes, cela peut causer des ralentissements. Si c'est le cas, désactivez simplement cette option.",
  "Source control view refresh interval": "Intervalle d'actualisation de la vue contrôle de source",
  "Milliseconds to wait after file change before refreshing the Source Control View.": "Millisecondes à attendre après un changement de fichier avant d'actualiser la vue contrôle de source.",
  "Miscellaneous": "Divers",
  "Disable notifications": "Désactiver les notifications",
  "Disable notifications for git operations to minimize distraction (refer to status bar for updates). Errors are still shown as notifications even if you enable this setting.": "Désactiver les notifications pour les opérations git pour minimiser les distractions (référez-vous à la barre d'état pour les mises à jour). Les erreurs sont toujours affichées comme notifications même si vous activez ce paramètre.",
  "Hide notifications for no changes": "Masquer les notifications sans changements",
  "Don't show notifications when there are no changes to commit or push.": "Ne pas afficher de notifications quand il n'y a pas de changements à valider ou pousser.",
  "Show status bar": "Afficher la barre d'état",
  "Obsidian must be restarted for the changes to take affect.": "Obsidian doit être redémarré pour que les changements prennent effet.",
  "Show stage/unstage button in file menu": "Afficher le bouton indexer/désindexer dans le menu fichier",
  "Show branch status bar": "Afficher la barre d'état des branches",
  "Show the count of modified files in the status bar": "Afficher le nombre de fichiers modifiés dans la barre d'état",
  "Commit author": "Auteur du commit",
  "Author name for commit": "Nom d'auteur pour le commit",
  "Author email for commit": "Email d'auteur pour le commit",
  "Advanced": "Avancé",
  "These settings usually don't need to be changed, but may be requried for special setups.": "Ces paramètres n'ont généralement pas besoin d'être modifiés, mais peuvent être nécessaires pour des configurations spéciales.",
  "Update submodules": "Mettre à jour les sous-modules",
  "\"Commit-and-sync\" and \"pull\" takes care of submodules. Missing features: Conflicted files, count of pulled/pushed/committed files. Tracking branch needs to be set for each submodule.": "\"Valider-et-synchroniser\" et \"tirer\" gèrent les sous-modules. Fonctionnalités manquantes : Fichiers en conflit, comptage des fichiers tirés/poussés/validés. La branche de suivi doit être définie pour chaque sous-module.",
  "Custom Git binary path": "Chemin binaire Git personnalisé",
  "Additional environment variables": "Variables d'environnement supplémentaires",
  "Use each line for a new environment variable in the format KEY=VALUE .": "Utilisez chaque ligne pour une nouvelle variable d'environnement au format CLÉ=VALEUR .",
  "Additional PATH environment variable paths": "Chemins de variable d'environnement PATH supplémentaires",
  "Use each line for one path": "Utilisez une ligne par chemin",
  "Reload with new environment variables": "Recharger avec les nouvelles variables d'environnement",
  "Removing previously added environment variables will not take effect until Obsidian is restarted.": "La suppression des variables d'environnement précédemment ajoutées ne prendra effet qu'après le redémarrage d'Obsidian.",
  "Reload": "Recharger",
  "Custom base path (Git repository path)": "Chemin de base personnalisé (chemin du dépôt Git)",
  "Sets the relative path to the vault from which the Git binary should be executed.\n             Mostly used to set the path to the Git repository, which is only required if the Git repository is below the vault root directory. Use \"\\\" instead of \"/\" on Windows.": "Définit le chemin relatif vers le coffre-fort depuis lequel le binaire Git doit être exécuté.\n             Principalement utilisé pour définir le chemin vers le dépôt Git, ce qui n'est requis que si le dépôt Git est sous le répertoire racine du coffre-fort. Utilisez \"\\\" au lieu de \"/\" sous Windows.",
  "Custom Git directory path (Instead of '.git')": "Chemin de répertoire Git personnalisé (Au lieu de '.git')",
  "Requires restart of Obsidian to take effect. Use \"\\\" instead of \"/\" on Windows.": "Nécessite un redémarrage d'Obsidian pour prendre effet. Utilisez \"\\\" au lieu de \"/\" sous Windows.",
  "Disable on this device": "Désactiver sur cet appareil",
  "Disables the plugin on this device. This setting is not synced.": "Désactive le plugin sur cet appareil. Ce paramètre n'est pas synchronisé.",
  "Support": "Support",
  "Donate": "Faire un don",
  "If you like this Plugin, consider donating to support continued development.": "Si vous aimez ce plugin, envisagez de faire un don pour soutenir son développement continu.",
  "Copy Debug Information": "Copier les informations de débogage",
  "Debugging and logging:\nYou can always see the logs of this and every other plugin by opening the console with": "Débogage et journalisation :\nVous pouvez toujours voir les journaux de ce plugin et de tous les autres en ouvrant la console avec",
  "CTRL + SHIFT + I": "CTRL + SHIFT + I",
  "Tags": "Étiquettes",
  "Move tags to card footer": "Déplacer les étiquettes vers le pied de carte",
  "When toggled, tags will be displayed in the card's footer instead of the card's body.": "Lorsque activé, les étiquettes seront affichées dans le pied de la carte au lieu du corps de la carte.",
  "Tag click action": "Action au clic sur l'étiquette",
  "This setting controls whether clicking the tags displayed below the card title opens the Obsidian search or the Kanban board search.": "Ce paramètre contrôle si le clic sur les étiquettes affichées sous le titre de la carte ouvre la recherche Obsidian ou la recherche du tableau Kanban.",
  "Search Kanban Board": "Rechercher dans le tableau Kanban",
  "Search Obsidian Vault": "Rechercher dans le coffre-fort Obsidian",
  "Tag sort order": "Ordre de tri des étiquettes",
  "Set an explicit sort order for the specified tags.": "Définir un ordre de tri explicite pour les étiquettes spécifiées.",
  "Add tag": "Ajouter une étiquette",
  "Tag colors": "Couleurs des étiquettes",
  "Set colors for tags displayed in cards.": "Définir les couleurs pour les étiquettes affichées dans les cartes.",
  "Add tag color": "Ajouter une couleur d'étiquette",
  "Move dates to card footer": "Déplacer les dates vers le pied de carte",
  "When toggled, dates will be displayed in the card's footer instead of the card's body.": "Lorsque activé, les dates seront affichées dans le pied de la carte au lieu du corps de la carte.",
  "When toggled, cards will display the distance between today and the card's date. eg. 'In 3 days', 'A month ago'. Relative dates will not be shown for dates from the Tasks and Dataview plugins.": "Lorsque activé, les cartes afficheront la distance entre aujourd'hui et la date de la carte. ex. 'Dans 3 jours', 'Il y a un mois'. Les dates relatives ne seront pas affichées pour les dates des plugins Tasks et Dataview.",
  "Display date colors": "Afficher les couleurs des dates",
  "Set colors for dates displayed in cards based on the rules below.": "Définir les couleurs pour les dates affichées dans les cartes selon les règles ci-dessous.",
  "Add date color": "Ajouter une couleur de date",
  "Add archive date/time after card title": "Ajouter la date/heure d'archivage après le titre de la carte",
  "When toggled, the archived date/time will be added after the card title, e.g.- [ ] My card title 2021-05-14 10:00am. By default, it is inserted before the title.": "Lorsque activé, la date/heure d'archivage sera ajoutée après le titre de la carte, ex.- [ ] Mon titre de carte 2021-05-14 10:00. Par défaut, elle est insérée avant le titre.",
  "Inline Metadata": "Métadonnées en ligne",
  "Inline metadata position": "Position des métadonnées en ligne",
  "Controls where the inline metadata (from the Dataview plugin) will be displayed.": "Contrôle où les métadonnées en ligne (du plugin Dataview) seront affichées.",
  "Card body": "Corps de la carte",
  "Card footer": "Pied de la carte",
  "Merge with linked page metadata": "Fusionner avec les métadonnées de la page liée",
  "Move task data to card footer": "Déplacer les données de tâche vers le pied de carte",
  "When toggled, task data (from the Tasks plugin) will be displayed in the card's footer instead of the card's body.": "Lorsque activé, les données de tâche (du plugin Tasks) seront affichées dans le pied de la carte au lieu du corps de la carte.",
  "Board view": "Vue tableau",
  "Command settings": "Paramètres des commandes",
  "General": "Général",
  "Autoselect upon creating a link": "Sélection automatique lors de la création d'un lien",
  "Autoselect a word under the cursor when creating a link.": "Sélectionner automatiquement un mot sous le curseur lors de la création d'un lien.",
  "Skip Frontmatter": "Ignorer le frontmatter",
  "Skip Frontmatter in note wide commands.": "Ignorer le frontmatter dans les commandes étendues aux notes.",
  "Title separator": "Séparateur de titre",
  "String used as headings separator in 'Set link text' command.": "Chaîne utilisée comme séparateur de titres dans la commande 'Définir le texte du lien'.",
  "Remove links from headings": "Supprimer les liens des titres",
  "Internal wikilink without text": "Lien wiki interne sans texte",
  "Remove": "Supprimer",
  "Replace with destination": "Remplacer par la destination",
  "Replace with lowest heading": "Remplacer par le titre le plus bas",
  "Delete link": "Supprimer le lien",
  "Delete unreferenced link target": "Supprimer la cible du lien non référencée",
  "Convert to Markdown link": "Convertir en lien Markdown",
  "Append .md extension": "Ajouter l'extension .md",
  "docs": "docs",
  "Context menu": "Menu contextuel",
  "Edit link text": "Modifier le texte du lien",
  "Set link text": "Définir le texte du lien",
  "Set link text from clipboard": "Définir le texte du lien depuis le presse-papiers",
  "Edit link destination": "Modifier la destination du lien",
  "Set link destination from clipboard": "Définir la destination du lien depuis le presse-papiers",
  "Copy link": "Copier le lien",
  "Cut link": "Couper le lien",
  "Copy link destination": "Copier la destination du lien",
  "Copy link to element": "Copier le lien vers l'élément",
  "Unlink": "Délier",
  "Convert to wikilink": "Convertir en wikilink",
  "Convert to autolink": "Convertir en lien automatique",
  "Convert to markdown link": "Convertir en lien markdown",
  "Convert to HTML link": "Convertir en lien HTML",
  "Embed/Unembed": "Intégrer/Désintégrer",
  "Delete": "Supprimer",
  "Create link": "Créer un lien",
  "Create link from clipboard": "Créer un lien depuis le presse-papiers",
  "Convert all links to Markdown links": "Convertir tous les liens en liens Markdown",
  "Convert Wikilinks to Markdown links": "Convertir les Wikilinks en liens Markdown",
  "Convert URLs to Markdown links": "Convertir les URLs en liens Markdown",
  "Convert Autolinks to Markdown links": "Convertir les liens automatiques en liens Markdown",
  "Convert HTML links to Markdown links": "Convertir les liens HTML en liens Markdown",
  "Extract section": "Extraire la section",
  "Early access features": "Fonctionnalités en accès anticipé",
  "Almost finished features with some": "Fonctionnalités presque terminées avec quelques",
  "to be fixed.": "à corriger.",
  "Insider features": "Fonctionnalités Insider",
  "Incomplete features currently under development. Enable these features to": "Fonctionnalités incomplètes en cours de développement. Activez ces fonctionnalités pour",
  "provide your input": "donner votre avis",
  "and influence the direction of development.": "et influencer la direction du développement.",
  "Convert links in a folder": "Convertir les liens dans un dossier",
  "Obsidian URL support": "Support des URLs Obsidian",
  "Chetachi 👩🏽‍💻": "Chetachi 👩🏽‍💻",
  "Notification Settings": "Paramètres de notification",
  "Reminder Time": "Heure de rappel",
  "Time when a reminder with no time part will show": "Heure à laquelle un rappel sans partie horaire s'affichera",
  "Remind me later": "Me le rappeler plus tard",
  "Line-separated list of remind me later items": "Liste d'éléments 'me le rappeler plus tard' séparés par des lignes",
  "Use system notification": "Utiliser la notification système",
  "Use system notification for reminder notifications": "Utiliser la notification système pour les notifications de rappel",
  "Calendar popup trigger": "Déclencheur de popup calendrier",
  "Trigger text to show calendar popup": "Texte déclencheur pour afficher le popup calendrier",
  "Popup is enabled": "Le popup est activé",
  "Primary reminder format": "Format de rappel principal",
  "Reminder format for generated reminder by calendar popup": "Format de rappel pour les rappels générés par le popup calendrier",
  "Reminder plugin format - (@2021-09-08)": "Format du plugin de rappel - (@2021-09-08)",
  "Tasks plugin format - 📅 2021-09-08": "Format du plugin de tâches - 📅 2021-09-08",
  "Kanban plugin format - @{2021-09-08}": "Format du plugin Kanban - @{2021-09-08}",
  "Reminder Format - Reminder Plugin": "Format de rappel - Plugin de rappel",
  "Enable Reminder plugin format": "Activer le format du plugin de rappel",
  "Example: - [ ] Task 1(@2025-01-05 12:21)": "Exemple : - [ ] Tâche 1(@2025-01-05 12:21)",
  "Date format": "Format de date",
  "moment style date format: https://momentjs.com/docs/#/displaying/format/": "format de date style moment : https://momentjs.com/docs/#/displaying/format/",
  "Date and time format": "Format de date et heure",
  "moment() style date time format: https://momentjs.com/docs/#/displaying/format/": "format de date et heure style moment() : https://momentjs.com/docs/#/displaying/format/",
  "Strict Date format": "Format de date strict",
  "Strictly parse the date and time": "Analyser strictement la date et l'heure",
  "Link dates to daily notes": "Lier les dates aux notes quotidiennes",
  "When toggled, Dates link to daily notes.": "Lorsque activé, les dates sont liées aux notes quotidiennes.",
  "Reminder Format - Tasks Plugin": "Format de rappel - Plugin de tâches",
  "Enable Tasks plugin format": "Activer le format du plugin de tâches",
  "Example: - [ ] Task 1 📅 2025-01-05": "Exemple : - [ ] Tâche 1 📅 2025-01-05",
  "Distinguish between reminder date and due date": "Distinguer entre date de rappel et date d'échéance",
  "Use custom emoji ⏰ instead of 📅 and distinguish between reminder date/time and Tasks Plugin's due date.": "Utiliser l'emoji personnalisé ⏰ au lieu de 📅 et distinguer entre la date/heure de rappel et la date d'échéance du plugin de tâches.",
  "Remove tags from reminder title": "Supprimer les tags du titre du rappel",
  "If checked, tags(#xxx) are removed from the reminder list view and notification.": "Si coché, les tags (#xxx) sont supprimés de la vue liste des rappels et de la notification.",
  "Reminder Format - Kanban Plugin": "Format de rappel - Plugin Kanban",
  "Enable Kanban plugin format": "Activer le format du plugin Kanban",
  "Example: - [ ] Task 1 @{2025-01-05} @@{12:21}": "Exemple : - [ ] Tâche 1 @{2025-01-05} @@{12:21}",
  "Edit Detection Time": "Temps de détection d'édition",
  "The minimum amount of time (in seconds) after a key is typed that it will be identified as notifiable.": "Le temps minimum (en secondes) après qu'une touche est tapée pour qu'elle soit identifiée comme notifiable.",
  "Reminder check interval": "Intervalle de vérification des rappels",
  "Interval(in seconds) to periodically check whether or not you should be notified of reminders.  You will need to restart Obsidian for this setting to take effect.": "Intervalle (en secondes) pour vérifier périodiquement si vous devez être notifié des rappels. Vous devrez redémarrer Obsidian pour que ce paramètre prenne effet.",
  "Import": "Importer",
  "Export": "Exporter",
  "Separate desktop/mobile configuration": "Configuration bureau/mobile séparée",
  "Enable this if you want to have different settings depending whether you're using a desktop or mobile device. All of the settings below can be configured differently on desktop and mobile. You're currently using the desktop/global settings.": "Activez ceci si vous souhaitez avoir des paramètres différents selon que vous utilisez un appareil de bureau ou mobile. Tous les paramètres ci-dessous peuvent être configurés différemment sur bureau et mobile. Vous utilisez actuellement les paramètres bureau/globaux.",
  "Lazy Loader settings": "Paramètres du chargeur paresseux",
  "Short delay (seconds)": "Court délai (secondes)",
  "Long delay (seconds)": "Long délai (secondes)",
  "Default startup type for new plugins": "Type de démarrage par défaut pour les nouveaux plugins",
  "Nothing configured": "Rien de configuré",
  "⛔ Disable plugin": "⛔ Désactiver le plugin",
  "⚡ Instant": "⚡ Instantané",
  "⌚ Short delay": "⌚ Court délai",
  "💤 Long delay": "💤 Long délai",
  "Show plugin descriptions": "Afficher les descriptions des plugins",
  "Set the delay for all plugins at once": "Définir le délai pour tous les plugins en une fois",
  "Set all plugins to be:": "Définir tous les plugins comme :",
  "Plugins": "Plugins",
  "All": "Tout",
  "AttachFlow": "AttachFlow",
  "This nifty plugin enables seamless management of attachments and referenced links directly from your documents. Taking advantage of an intuitive right-click menu, you can efficiently handle resources in both LIVE and READ modes.": "Ce plugin astucieux permet une gestion transparente des pièces jointes et des liens référencés directement depuis vos documents. Profitant d'un menu contextuel intuitif, vous pouvez gérer efficacement les ressources en modes LIVE et LECTURE.",
  "Right-click menu for attachments": "Menu contextuel pour les pièces jointes",
  "Deleted attachment destination": "Destination des pièces jointes supprimées",
  "Move file to...": "Déplacer le fichier vers...",
  "Add a \"Move to...\" option to the right-click menu for attachments": "Ajouter une option \"Déplacer vers...\" au menu contextuel pour les pièces jointes",
  "Click to view images": "Cliquer pour voir les images",
  "Click the right half of the image to view the image in detail.": "Cliquez sur la moitié droite de l'image pour la voir en détail.",
  "Adaptive image display ratio based on window size": "Ratio d'affichage d'image adaptatif basé sur la taille de la fenêtre",
  "When the image exceeds the window size, the image is displayed adaptively according to the window size.": "Lorsque l'image dépasse la taille de la fenêtre, l'image est affichée de manière adaptative selon la taille de la fenêtre.",
  "Drag to resize images": "Glisser pour redimensionner les images",
  "Turn on to enable drag to resize images.": "Activer pour permettre le redimensionnement des images par glissement.",
  "Resize interval": "Intervalle de redimensionnement",
  "Debug": "Débogage",
  "Debug mode": "Mode débogage",
  "Print debug information in console": "Imprimer les informations de débogage dans la console",
  "Folder overview": "Aperçu du dossier",
  "Exclude folders": "Exclure les dossiers",
  "File explorer": "Explorateur de fichiers",
  "Path": "Chemin",
  "Folder note name": "Nom de la note de dossier",
  "{{folder_name}} will be replaced with the name of the folder": "{{folder_name}} sera remplacé par le nom du dossier",
  "Rename existing folder notes": "Renommer les notes de dossier existantes",
  "Default folder note type for new folder notes": "Type de note de dossier par défaut pour les nouvelles notes",
  "Choose the default file type for new folder notes. (canvas, markdown, ...)": "Choisissez le type de fichier par défaut pour les nouvelles notes de dossier. (canvas, markdown, ...)",
  "ask for file type": "demander le type de fichier",
  "Supported file types for folder notes": "Types de fichiers pris en charge pour les notes de dossier",
  "Custom extension": "Extension personnalisée",
  "Template path": "Chemin du modèle",
  "Restart after changing the template path": "Redémarrer après avoir changé le chemin du modèle",
  "Storage location": "Emplacement de stockage",
  "Choose where to store the folder notes": "Choisir où stocker les notes de dossier",
  "Inside the folder": "Dans le dossier",
  "In the parent folder": "Dans le dossier parent",
  "Switch to new storage location": "Passer au nouvel emplacement de stockage",
  "Move all folder notes to the new storage location": "Déplacer toutes les notes de dossier vers le nouvel emplacement",
  "Switch": "Basculer",
  "Key for creating folder note": "Touche pour créer une note de dossier",
  "The key combination to create a folder note": "La combinaison de touches pour créer une note de dossier",
  "Ctrl + Click": "Ctrl + Clic",
  "Alt + Click": "Alt + Clic",
  "Key for opening folder note": "Touche pour ouvrir une note de dossier",
  "Select the combination to open a folder note": "Sélectionner la combinaison pour ouvrir une note de dossier",
  "Mouse Click": "Clic de souris",
  "Sync folder name": "Synchroniser le nom du dossier",
  "Automatically rename the folder note when the folder name is changed": "Renommer automatiquement la note de dossier lorsque le nom du dossier est modifié",
  "Confirm folder note deletion": "Confirmer la suppression de la note de dossier",
  "Ask for confirmation before deleting a folder note": "Demander confirmation avant de supprimer une note de dossier",
  "Deleted folder notes": "Notes de dossier supprimées",
  "What happens to the folder note after you delete it": "Ce qui arrive à la note de dossier après sa suppression",
  "Move to system trash": "Déplacer vers la corbeille système",
  "Move to Obsidian trash (.trash folder)": "Déplacer vers la corbeille Obsidian (dossier .trash)",
  "Delete permanently": "Supprimer définitivement",
  "Open folder note in a new tab by default": "Ouvrir la note de dossier dans un nouvel onglet par défaut",
  "Always open folder notes in a new tab (except when you try to open the same note) instead of having to use ctrl/cmd + click to open in a new tab": "Toujours ouvrir les notes de dossier dans un nouvel onglet (sauf quand vous essayez d'ouvrir la même note) au lieu d'avoir à utiliser ctrl/cmd + clic pour ouvrir dans un nouvel onglet",
  "Automatically create folder notes": "Créer automatiquement des notes de dossier",
  "Automatically create a folder note when a new folder is created": "Créer automatiquement une note de dossier lorsqu'un nouveau dossier est créé",
  "Enable front matter title plugin integration": "Activer l'intégration du plugin de titre front matter",
  "Automatically rename a folder name when the folder note is renamed": "Renommer automatiquement un nom de dossier lorsque la note de dossier est renommée",
  "Create folder note for every folder": "Créer une note de dossier pour chaque dossier",
  "Create a folder note for every folder in the vault": "Créer une note de dossier pour chaque dossier dans le coffre",
  "Manage folder overview defaults": "Gérer les paramètres par défaut de l'aperçu des dossiers",
  "Manage the default settings for the folder overview plugin": "Gérer les paramètres par défaut du plugin d'aperçu des dossiers",
  "Manage": "Gérer",
  "Manage excluded folders": "Gérer les dossiers exclus",
  "Exclude folder default settings": "Paramètres par défaut d'exclusion de dossier",
  "Exclude pattern default settings": "Paramètres par défaut du motif d'exclusion",
  "Add excluded folder": "Ajouter un dossier exclu",
  "Hide folder note": "Masquer la note de dossier",
  "Hide the folder note in the file explorer": "Masquer la note de dossier dans l'explorateur de fichiers",
  "Don't open folder notes by clicking on the name (on mobile)": "Ne pas ouvrir les notes de dossier en cliquant sur le nom (sur mobile)",
  "Folder notes don't open when clicking on the name of the folder (on mobile)": "Les notes de dossier ne s'ouvrent pas en cliquant sur le nom du dossier (sur mobile)",
  "Only open folder notes through the name": "Ouvrir les notes de dossier uniquement via le nom",
  "Only open folder notes in the file explorer by clicking on the folder name": "Ouvrir les notes de dossier uniquement dans l'explorateur de fichiers en cliquant sur le nom du dossier",
  "Disable folder collapsing": "Désactiver le repliement des dossiers",
  "Disable the ability to collapse folders by clicking exactly on the folder name": "Désactiver la possibilité de replier les dossiers en cliquant exactement sur le nom du dossier",
  "Use submenus": "Utiliser les sous-menus",
  "Use submenus for file/folder commands": "Utiliser les sous-menus pour les commandes de fichier/dossier",
  "Style settings": "Paramètres de style",
  "Hide collapse icon": "Masquer l'icône de repliement",
  "Hide the collapse icon in the file explorer next to the name of a folder when a folder only contains a folder note": "Masquer l'icône de repliement dans l'explorateur de fichiers à côté du nom d'un dossier lorsqu'un dossier ne contient qu'une note de dossier",
  "Underline the name of folder notes": "Souligner le nom des notes de dossier",
  "Add an underline to folders that have a folder note in the file explorer": "Ajouter un soulignement aux dossiers qui ont une note de dossier dans l'explorateur de fichiers",
  "Bold the name of folder notes": "Mettre en gras le nom des notes de dossier",
  "Make the folder name bold in the file explorer": "Mettre en gras le nom du dossier dans l'explorateur de fichiers",
  "Cursive the name of folder notes": "Mettre en italique le nom des notes de dossier",
  "Make the folder name cursive in the file explorer": "Mettre en italique le nom du dossier dans l'explorateur de fichiers",
  "Open folder note through path": "Ouvrir la note de dossier via le chemin",
  "Open a folder note when clicking on a folder name in the path if it is a folder note": "Ouvrir une note de dossier en cliquant sur un nom de dossier dans le chemin s'il s'agit d'une note de dossier",
  "Change folder name in the path": "Changer le nom du dossier dans le chemin",
  "Automatically rename a folder name in the path above a note when the folder note is renamed": "Renommer automatiquement un nom de dossier dans le chemin au-dessus d'une note lorsque la note de dossier est renommée",
  "Underline folders in the path": "Souligner les dossiers dans le chemin",
  "Add an underline to folders that have a folder note in the path above a note": "Ajouter un soulignement aux dossiers qui ont une note de dossier dans le chemin au-dessus d'une note",
  "Bold folders in the path": "Mettre en gras les dossiers dans le chemin",
  "Make the folder name bold in the path above a note": "Mettre en gras le nom du dossier dans le chemin au-dessus d'une note",
  "Cursive the name of folder notes in the path": "Mettre en italique le nom des notes de dossier dans le chemin",
  "Make the folder name cursive in the path above a note": "Mettre en italique le nom du dossier dans le chemin au-dessus d'une note",
  "Add {regex} at the beginning of the folder name to use a regex pattern.": "Ajouter {regex} au début du nom du dossier pour utiliser un motif regex.",
  "Use * before and after to exclude folders that include the name between the *s.": "Utiliser * avant et après pour exclure les dossiers qui incluent le nom entre les *.",
  "Use * before the folder name to exclude folders that end with the folder name.": "Utiliser * avant le nom du dossier pour exclure les dossiers qui se terminent par le nom du dossier.",
  "Use * after the folder name to exclude folders that start with the folder name.": "Utiliser * après le nom du dossier pour exclure les dossiers qui commencent par le nom du dossier.",
  "The regexes and wildcards are only for the folder name, not the path.": "Les regex et caractères génériques ne concernent que le nom du dossier, pas le chemin.",
  "If you want to switch to a folder path delete the pattern first.": "Si vous voulez passer à un chemin de dossier, supprimez d'abord le motif.",
  "Choose the file types that should be supported for folder notes. (e.g. if you click on a folder name it searches for all file extensions that are supported)": "Choisissez les types de fichiers qui doivent être pris en charge pour les notes de dossier. (par ex. si vous cliquez sur un nom de dossier, il recherche toutes les extensions de fichier prises en charge)",
  "Adding more file types may cause performance issues becareful when adding more file types and don't add too many.": "L'ajout de plus de types de fichiers peut causer des problèmes de performance, soyez prudent lors de l'ajout de types de fichiers et n'en ajoutez pas trop.",
  "Requires a restart to take effect": "Nécessite un redémarrage pour prendre effet",
  "Chameleon": "Chameleon",
  "Chameleon: A translation plugin for Obsidian that provides multilingual support.": "Chameleon : Un plugin de traduction pour Obsidian qui fournit un support multilingue.",
  "Folder notes": "Notes de dossier",
  "Create notes within folders that can be accessed without collapsing the folder, similar to the functionality offered in Notion.": "Créer des notes dans des dossiers qui peuvent être accessibles sans replier le dossier, similaire à la fonctionnalité offerte dans Notion.",
  "Smart Second Brain": "Second cerveau intelligent",
  "Interact with your privacy focused assistant, leveraging Ollama or OpenAI, making your second brain even smarter.": "Interagissez avec votre assistant axé sur la confidentialité, utilisant Ollama ou OpenAI, rendant votre second cerveau encore plus intelligent.",
  "Expand lists to full width in list view": "Étendre les listes à la pleine largeur en vue liste",
  "Lazy Plugin Loader": "Chargeur de plugins paresseux",
  "Load plugins with a delay on startup, so that you can get your app startup down into the sub-second loading time.": "Charger les plugins avec un délai au démarrage, pour que vous puissiez obtenir un temps de démarrage de votre application inférieur à la seconde.",
  "Specify custom date format. E.g. \"YYYY-MM-DD HH:mm:ss. See": "Spécifier un format de date personnalisé. Par ex. \"YYYY-MM-DD HH:mm:ss. Voir",
  "for more formats.": "pour plus de formats.",
  "The commit hash, author name and authoring date can all be individually toggled.": "Le hash du commit, le nom de l'auteur et la date de création peuvent tous être basculés individuellement.",
  "Hide everything, to only show the age-colored sidebar.": "Masquer tout, pour n'afficher que la barre latérale colorée selon l'âge.",
  "Diff view style": "Style de vue des différences",
  "Split": "Divisé",
  "Unified": "Unifié",
  "Set the style for the diff view. Note that the actual diff in \"Split\" mode is not generated by Git, but the editor itself instead so it may differ from the diff generated by Git. One advantage of this is that you can edit the text in that view.": "Définir le style pour la vue des différences. Notez que la différence réelle en mode \"Divisé\" n'est pas générée par Git, mais par l'éditeur lui-même, donc elle peut différer de la différence générée par Git. Un avantage est que vous pouvez modifier le texte dans cette vue.",
  "Theme Info": "Informations sur le thème",
  "Components": "Composants",
  "Appearance (light mode)": "Apparence (mode clair)",
  "Appearance (dark mode)": "Apparence (mode sombre)",
  "Mobile": "Mobile",
  "Plugin": "Plugin",
  "Editor": "Éditeur"
}