{
  "Reminder plugin for Obsidian. This plugin adds feature to manage TODOs with reminder.": "Плагин напоминаний для Obsidian. Этот плагин добавляет функцию управления задачами с напоминаниями.",
  "AidenLx's Folder Note": "Заметки папок AidenLx",
  "Add description, summary and more info to folders with folder notes.": "Добавляйте описание, сводку и дополнительную информацию к папкам с помощью заметок папок.",
  "AidenLx's Folder Note - folderv component": "Заметки папок AidenLx - компонент folderv",
  "Optional `folderv` Component for alx-folder-note": "Дополнительный компонент `folderv` для alx-folder-note",
  "Auto Card Link": "Автоматические карточки ссылок",
  "Automatically fetches metadata from a url and makes it as a card-styled link": "Автоматически получает метаданные из URL и создает ссылку в виде карточки",
  "Auto Link Title": "Автоматические заголовки ссылок",
  "This plugin automatically fetches the titles of links from the web": "Этот плагин автоматически получает заголовки ссылок из интернета",
  "BRAT": "BRAT",
  "Easily install a beta version of a plugin for testing.": "Легко устанавливайте бета-версии плагинов для тестирования.",
  "Editing Toolbar": "Панель редактирования",
  "The Obsidian Editing Toolbar is modified from cmenu, which provides more powerful customization settings and has many built-in editing commands to be a MS Word-like toolbar editing experience.": "Панель редактирования Obsidian модифицирована из cmenu, предоставляет более мощные настройки и множество встроенных команд редактирования для создания опыта редактирования, похожего на MS Word.",
  "Execute Code": "Выполнение кода",
  "Allows to execute code snippets within a note. Supported programming languages:  C, CPP, Dart, Golang, Groovy, Kotlin, Java, JavaScript, TypeScript, Lean, Lua, CSharp, Prolog, Rust, Python, R, Ruby, Wolfram Mathematica, Haskell, Scala, Racket, F#, Batch, Shell & Powershell.": "Позволяет выполнять фрагменты кода в заметке. Поддерживаемые языки программирования: C, CPP, Dart, Golang, Groovy, Kotlin, Java, JavaScript, TypeScript, Lean, Lua, CSharp, Prolog, Rust, Python, R, Ruby, Wolfram Mathematica, Haskell, Scala, Racket, F#, Batch, Shell & Powershell.",
  "Fast Image Cleaner": "Быстрая очистка изображений",
  "This plugin allows you to quickly remove image attachment and referenced link from your documents in both LIVE , READ mode by right-click menu": "Этот плагин позволяет быстро удалять прикрепленные изображения и ссылки из ваших документов в режимах LIVE и READ через контекстное меню",
  "Folder Note Core": "Ядро заметок папок",
  "Provide core features and API for folder notes": "Предоставляет основные функции и API для заметок папок",
  "Git": "Git",
  "Integrate Git version control with automatic backup and other advanced features.": "Интегрирует контроль версий Git с автоматическим резервным копированием и другими расширенными функциями.",
  "Kanban": "Канбан",
  "Create markdown-backed Kanban boards in Obsidian.": "Создавайте канбан-доски на основе markdown в Obsidian.",
  "Links": "Ссылки",
  "Manipulate links": "Управление ссылками",
  "MySnippets": "Мои фрагменты",
  "MySnippets is a plugin that adds a status bar menu allowing the user to quickly toggle their snippets on and off 🖌.": "MySnippets - это плагин, добавляющий меню в строку состояния, позволяющее пользователю быстро включать и выключать свои фрагменты кода 🖌.",
  "proxy github": "прокси github",
  "Reminder": "Напоминания",
  "Style Settings": "Настройки стиля",
  "Offers controls for adjusting theme, plugin, and snippet CSS variables.": "Предоставляет элементы управления для настройки переменных CSS темы, плагина и фрагментов.",
  "Templater": "Шаблонизатор",
  "Create and use templates": "Создание и использование шаблонов",
  "Inside Folder, Index File": "Внутри папки, индексный файл",
  "Inside Folder, With Same Name": "Внутри папки, с тем же именем",
  "Outside Folder, With Same Name": "Вне папки, с тем же именем",
  "Icon Shortcodes v0.5.1+": "Короткие коды иконок v0.5.1+",
  "Ctrl (Cmd in macOS)": "Ctrl (Cmd в macOS)",
  "Ctrl (Ctrl in macOS)": "Ctrl (Ctrl в macOS)",
  "Alt": "Alt",
  "TRACE": "ОТСЛЕЖИВАНИЕ",
  "DEBUG": "ОТЛАДКА",
  "INFO": "ИНФОРМАЦИЯ",
  "WARN": "ПРЕДУПРЕЖДЕНИЕ",
  "ERROR": "ОШИБКА",
  "SILENT": "ТИХИЙ",
  "Notify if startup takes longer than expected": "Уведомлять, если запуск занимает больше времени, чем ожидалось",
  "Diagnose issues with your app by seeing what is causing the app to load slowly.": "Диагностируйте проблемы с вашим приложением, видя, что вызывает медленную загрузку.",
  "Enhance Default Paste": "Улучшенная вставка по умолчанию",
  "Fetch the link title when pasting a link in the editor with the default paste command": "Получать заголовок ссылки при вставке ссылки в редакторе с помощью команды вставки по умолчанию",
  "Enhance Drop Events": "Улучшенные события перетаскивания",
  "Fetch the link title when drag and dropping a link from another program": "Получать заголовок ссылки при перетаскивании ссылки из другой программы",
  "Maximum title length": "Максимальная длина заголовка",
  "Set the maximum length of the title. Set to 0 to disable.": "Установите максимальную длину заголовка. Установите 0 для отключения.",
  "Preserve selection as title": "Сохранять выделение как заголовок",
  "Whether to prefer selected text as title over fetched title when pasting": "Предпочитать ли выделенный текст заголовку, полученному при вставке",
  "Website Blacklist": "Черный список веб-сайтов",
  "List of strings (comma separated) that disable autocompleting website titles. Can be URLs or arbitrary text.": "Список строк (разделенных запятыми), которые отключают автозаполнение заголовков веб-сайтов. Могут быть URL или произвольный текст.",
  "Use New Scraper": "Использовать новый скрапер",
  "Use experimental new scraper, seems to work well on desktop but not mobile.": "Использовать экспериментальный новый скрапер, работает хорошо на компьютере, но не на мобильных устройствах.",
  "Use Better Fetching Placeholder": "Использовать улучшенный заполнитель при получении",
  "Use a more readable placeholder when fetching the title of a link.": "Использовать более читаемый заполнитель при получении заголовка ссылки.",
  "LinkPreview API Key": "API-ключ LinkPreview",
  "API key for the LinkPreview.net service. Get one at https://my.linkpreview.net/access_keys": "API-ключ для сервиса LinkPreview.net. Получите его на https://my.linkpreview.net/access_keys",
  "Auto-enable plugins after installation": "Автоматически включать плагины после установки",
  "If enabled beta plugins will be automatically enabled after installtion by default. Note: you can toggle this on and off for each plugin in the \"Add Plugin\" form.": "Если включено, бета-плагины будут автоматически включаться после установки по умолчанию. Примечание: вы можете включать и выключать это для каждого плагина в форме \"Добавить плагин\".",
  "Auto-update plugins at startup": "Автоматическое обновление плагинов при запуске",
  "If enabled all beta plugins will be checked for updates each time Obsidian starts. Note: this does not update frozen version plugins.": "Если включено, все бета-плагины будут проверяться на обновления при каждом запуске Obsidian. Примечание: это не обновляет плагины с замороженной версией.",
  "Auto-update themes at startup": "Автоматическое обновление тем при запуске",
  "If enabled all beta themes will be checked for updates each time Obsidian starts.": "Если включено, все бета-темы будут проверяться на обновления при каждом запуске Obsidian.",
  "Learn more about my work at:": "Узнайте больше о моей работе на:",
  "Beta plugin list": "Список бета-плагинов",
  "The following is a list of beta plugins added via the command palette \"Add a beta plugin for testing\" or \"Add a beta plugin with frozen version for testing\". A frozen version is a specific release of a plugin based on its release tag.": "Следующий список бета-плагинов добавлен через палитру команд \"Добавить бета-плагин для тестирования\" или \"Добавить бета-плагин с замороженной версией для тестирования\". Замороженная версия - это определенный релиз плагина на основе его тега релиза.",
  "Click the x button next to a plugin to remove it from the list.": "Нажмите кнопку x рядом с плагином, чтобы удалить его из списка.",
  "Note:": "Примечание:",
  "This does not delete the plugin, this should be done from the  Community Plugins tab in Settings.": "Это не удаляет плагин, это должно быть сделано на вкладке Community Plugins в Настройках.",
  "Add Beta plugin": "Добавить бета-плагин",
  "obsidian-canzi/Enhanced-editing": "obsidian-canzi/Enhanced-editing",
  "Add Beta plugin with frozen version": "Добавить бета-плагин с замороженной версией",
  "Beta themes list": "Список бета-тем",
  "Add Beta Theme": "Добавить бета-тему",
  "Monitoring": "Мониторинг",
  "Enable Notifications": "Включить уведомления",
  "BRAT will provide popup notifications for its various activities. Turn this off means  no notifications from BRAT.": "BRAT будет показывать всплывающие уведомления о своих различных действиях. Отключение означает отсутствие уведомлений от BRAT.",
  "Enable Logging": "Включить ведение журнала",
  "Plugin updates will be logged to a file in the log file.": "Обновления плагина будут записываться в файл журнала.",
  "BRAT Log File Location": "Расположение файла журнала BRAT",
  "Logs will be saved to this file. Don't add .md to the file name.": "Журналы будут сохранены в этот файл. Не добавляйте .md к имени файла.",
  "Enable Verbose Logging": "Включить подробное ведение журнала",
  "Get a lot  more information in  the log.": "Получать больше информации в журнале.",
  "Debugging Mode": "Режим отладки",
  "Atomic Bomb level console logging. Can be used for troubleshoting and development.": "Ведение журнала консоли уровня атомной бомбы. Может использоваться для устранения неполадок и разработки.",
  "Personal Access Token": "Персональный токен доступа",
  "If you need to access private repositories, enter the personal access token here.": "Если вам нужен доступ к частным репозиториям, введите здесь персональный токен доступа.",
  "Obsidian Editing Toolbar": "Панель редактирования Obsidian",
  "body": "тело",
  "workspace": "рабочее пространство",
  "glass": "стекло",
  "default": "по умолчанию",
  "tiny": "крошечный",
  "fixed": "фиксированный",
  "following": "следующий",
  "top": "верх",
  "undo editor": "отменить редактор",
  "redo editor": "повторить редактор",
  "Clear text formatting": "Очистить форматирование текста",
  "Header 1": "Заголовок 1",
  "Header 2": "Заголовок 2",
  "Header 3": "Заголовок 3",
  "submenu": "подменю",
  "Header 4": "Заголовок 4",
  "Header 5": "Заголовок 5",
  "Header 6": "Заголовок 6",
  "Toggle bold": "Переключить жирный",
  "Toggle italics": "Переключить курсив",
  "Toggle strikethrough": "Переключить зачеркнутый",
  "Toggle underline": "Переключить подчеркнутый",
  "==Toggle highlight ==": "==Переключить выделение ==",
  "Toggle blockquote": "Переключить цитату",
  "Toggle superscript": "Переключить надстрочный",
  "Toggle subscript": "Переключить подстрочный",
  "inline code": "встроенный код",
  "Toggle codeblock": "Переключить блок кода",
  "insert wikilink [[]]": "вставить вики-ссылку [[]]",
  "insert link []()": "вставить ссылку []()",
  "insert embed ![[]]": "вставить встраивание ![[]]",
  "Horizontal divider": "Горизонтальный разделитель",
  "submenu-list": "подменю-список",
  "numbered list": "нумерованный список",
  "bullet list": "маркированный список",
  "unindent-list": "уменьшить отступ списка",
  "indent list": "увеличить отступ списка",
  "submenu-aligin": "подменю-выравнивание",
  "Settings for the Code Execution Plugin.": "Настройки для плагина выполнения кода.",
  "General Settings": "Общие настройки",
  "Timeout (in seconds)": "Тайм-аут (в секундах)",
  "The time after which a program gets shut down automatically. This is to prevent infinite loops.": "Время, после которого программа автоматически завершается. Это предотвращает бесконечные циклы.",
  "Allow Input": "Разрешить ввод",
  "Whether or not to include a stdin input box when running blocks. In order to apply changes to this, Obsidian must be refreshed.": "Включать ли поле ввода stdin при выполнении блоков. Для применения изменений необходимо обновить Obsidian.",
  "WSL Mode": "Режим WSL",
  "Whether or not to run code in the Windows Subsystem for Linux. If you don't have WSL installed, don't turn this on!": "Запускать ли код в подсистеме Windows для Linux. Если у вас не установлен WSL, не включайте это!",
  "[Experimental] Persistent Output": "[Экспериментально] Постоянный вывод",
  "If enabled, the output of the code block is written into the markdown file. This feature is experimental and may not work as expected.": "Если включено, вывод блока кода записывается в файл markdown. Эта функция экспериментальная и может работать не так, как ожидается.",
  "Language-Specific Settings": "Настройки для конкретных языков",
  "Pick a language to edit its language-specific settings": "Выберите язык для редактирования его специфических настроек",
  "JavaScript / Node Settings": "Настройки JavaScript / Node",
  "Node path": "Путь к Node",
  "Node arguments": "Аргументы Node",
  "Run Javascript blocks in Notebook Mode": "Запускать блоки Javascript в режиме блокнота",
  "Inject Javascript code": "Внедрить код Javascript",
  "Code to add to the top of every Javascript code block before running.": "Код для добавления в начало каждого блока Javascript перед выполнением.",
  "TypeScript Settings": "Настройки TypeScript",
  "ts-node path": "Путь к ts-node",
  "TypeScript arguments": "Аргументы TypeScript",
  "Inject Typescript code": "Внедрить код Typescript",
  "Code to add to the top of every Typescript code block before running.": "Код для добавления в начало каждого блока Typescript перед выполнением.",
  "Lean Settings": "Настройки Lean",
  "lean path": "Путь к Lean",
  "Lean arguments": "Аргументы Lean",
  "Inject Lean code": "Внедрить код Lean",
  "Code to add to the top of every Lean code block before running.": "Код для добавления в начало каждого блока Lean перед выполнением.",
  "Lua Settings": "Настройки Lua",
  "lua path": "Путь к Lua",
  "Lua arguments": "Аргументы Lua",
  "Inject Lua code": "Внедрить код Lua",
  "Code to add to the top of every Lua code block before running.": "Код для добавления в начало каждого блока Lua перед выполнением.",
  "Dart Settings": "Настройки Dart",
  "dart path": "Путь к Dart",
  "Dart arguments": "Аргументы Dart",
  "Inject Dart code": "Внедрить код Dart",
  "Code to add to the top of every Dart code block before running.": "Код для добавления в начало каждого блока Dart перед выполнением.",
  "CSharp Settings": "Настройки CSharp",
  "dotnet path": "Путь к dotnet",
  "CSharp arguments": "Аргументы CSharp",
  "Inject C# code": "Внедрить код C#",
  "Code to add to the top of every C# code block before running.": "Код для добавления в начало каждого блока C# перед выполнением.",
  "Java Settings": "Настройки Java",
  "Java path (Java 11 or higher)": "Путь к Java (Java 11 или выше)",
  "The path to your Java installation.": "Путь к вашей установке Java.",
  "Java arguments": "Аргументы Java",
  "Inject Java code": "Внедрить код Java",
  "Code to add to the top of every Java code block before running.": "Код для добавления в начало каждого блока Java перед выполнением.",
  "Python Settings": "Настройки Python",
  "Embed Python Plots": "Встраивать графики Python",
  "Python path": "Путь к Python",
  "The path to your Python installation.": "Путь к вашей установке Python.",
  "Python arguments": "Аргументы Python",
  "Run Python blocks in Notebook Mode": "Запускать блоки Python в режиме блокнота",
  "Inject Python code": "Внедрить код Python",
  "Code to add to the top of every Python code block before running.": "Код для добавления в начало каждого блока Python перед выполнением.",
  "Golang Settings": "Настройки Golang",
  "Golang Path": "Путь к Golang",
  "The path to your Golang installation.": "Путь к вашей установке Golang.",
  "Inject Golang code": "Внедрить код Golang",
  "Code to add to the top of every Golang code block before running.": "Код для добавления в начало каждого блока Golang перед выполнением.",
  "Rust Settings": "Настройки Rust",
  "Cargo Path": "Путь к Cargo",
  "The path to your Cargo installation.": "Путь к вашей установке Cargo.",
  "Inject Rust code": "Внедрить код Rust",
  "Code to add to the top of every Rust code block before running.": "Code to add to the top of every Rust code block before running.",
  "C++ Settings": "C++ Settings",
  "Cling path":  "Cling path",
  "The path to your Cling installation.": "Путь к вашей установке Cling.",
  "Cling arguments for C++": "Аргументы Cling для C++",
  "Cling std": "Стандарт Cling",
  "C++ 98": "C++ 98",
  "C++ 11": "C++ 11", 
  "C++ 14": "C++ 14",
  "C++ 17": "C++ 17",
  "C++ 20": "C++ 20",
  "Use main function": "Использовать функцию main",
  "If enabled, will use a main() function as the code block entrypoint.": "Если включено, будет использовать функцию main() как точку входа блока кода.",
  "Inject C++ code": "Внедрить код C++",
  "Code to add to the top of every C++ code block before running.": "Код для добавления в начало каждого блока C++ перед выполнением.",
  "C Settings": "Настройки C",
  "gcc / Cling path": "Путь к gcc / Cling",
  "The path to your gcc / Cling installation.": "Путь к вашей установке gcc / Cling.",
  "gcc / Cling arguments for C": "Аргументы gcc / Cling для C",
  "Cling std (ignored for gcc)": "Стандарт Cling (игнорируется для gcc)",
  "Use main function (mandatory for gcc)": "Использовать функцию main (обязательно для gcc)",
  "Inject C code": "Внедрить код C",
  "Code to add to the top of every C code block before running.": "Код для добавления в начало каждого блока C перед выполнением.",
  "Batch Settings": "Настройки Batch",
  "Batch path": "Путь к Batch",
  "The path to the terminal. Default is command prompt.": "Путь к терминалу. По умолчанию - командная строка.",
  "Batch arguments": "Аргументы Batch",
  "Batch file extension": "Расширение файла Batch",
  "Changes the file extension for generated batch scripts. Default is .bat": "Изменяет расширение файла для сгенерированных batch-скриптов. По умолчанию .bat",
  "Inject Batch code": "Внедрить код Batch",
  "Code to add to the top of every Batch code block before running.": "Код для добавления в начало каждого блока Batch перед выполнением.",
  "Shell Settings": "Настройки Shell",
  "Shell path": "Путь к Shell",
  "The path to shell. Default is Bash but you can use any shell you want, e.g. bash, zsh, fish, ...": "Путь к оболочке. По умолчанию Bash, но вы можете использовать любую оболочку, например bash, zsh, fish, ...",
  "Shell arguments": "Аргументы Shell",
  "Shell file extension": "Расширение файла Shell",
  "Changes the file extension for generated shell scripts. This is useful if you want to use a shell other than bash.": "Изменяет расширение файла для сгенерированных shell-скриптов. Это полезно, если вы хотите использовать оболочку, отличную от bash.",
  "Shell WSL mode": "Режим Shell WSL",
  "Run the shell script in Windows Subsystem for Linux. This option is used if the global \"WSL Mode\" is disabled.": "Запускать shell-скрипт в подсистеме Windows для Linux. Эта опция используется, если глобальный \"Режим WSL\" отключен.",
  "Inject Shell code": "Внедрить код Shell",
  "Code to add to the top of every Shell code block before running.": "Код для добавления в начало каждого блока Shell перед выполнением.",
  "Powershell Settings": "Настройки Powershell",
  "Powershell path": "Путь к Powershell",
  "The path to Powershell.": "Путь к Powershell.",
  "Powershell arguments": "Аргументы Powershell",
  "Powershell file extension": "Расширение файла Powershell",
  "Changes the file extension for generated shell scripts. This is useful if you don't want to use PowerShell.": "Изменяет расширение файла для сгенерированных shell-скриптов. Это полезно, если вы не хотите использовать PowerShell.",
  "PowerShell script encoding": "Кодировка скрипта PowerShell",
  "Windows still uses windows-1252 as default encoding on most systems for legacy reasons. If you change your encodings systemwide to UTF-8, you can change this setting to UTF-8 as well. Only use one of the following encodings: \"ascii\", \"utf8\", \"utf-8\", \"utf16le\", \"ucs2\", \"ucs-2\", \"base64\", \"latin1\", \"binary\", \"hex\" (default: \"latin1\")": "Windows по-прежнему использует windows-1252 как кодировку по умолчанию на большинстве систем по историческим причинам. Если вы измените кодировки системы на UTF-8, вы также можете изменить эту настройку на UTF-8. Используйте только одну из следующих кодировок: \"ascii\", \"utf8\", \"utf-8\", \"utf16le\", \"ucs2\", \"ucs-2\", \"base64\", \"latin1\", \"binary\", \"hex\" (по умолчанию: \"latin1\")",
  "Inject Powershell code": "Внедрить код Powershell",
  "Code to add to the top of every Powershell code block before running.": "Код для добавления в начало каждого блока Powershell перед выполнением.",
  "Prolog Settings": "Настройки Prolog",
  "Prolog Answer Limit": "Лимит ответов Prolog",
  "Maximal number of answers to be returned by the Prolog engine. tab is to prevent creating too huge texts in the notebook.": "Максимальное количество ответов, возвращаемых движком Prolog. Вкладка предотвращает создание слишком больших текстов в блокноте.",
  "Inject Prolog code": "Внедрить код Prolog",
  "Code to add to the top of every Prolog code block before running.": "Код для добавления в начало каждого блока Prolog перед выполнением.",
  "Groovy Settings": "Настройки Groovy",
  "Groovy path": "Путь к Groovy",
  "The path to your Groovy installation.": "Путь к вашей установке Groovy.",
  "Groovy arguments": "Аргументы Groovy",
  "Inject Groovy code": "Внедрить код Groovy",
  "Code to add to the top of every Groovy code block before running.": "Код для добавления в начало каждого блока Groovy перед выполнением.",
  "R Settings": "Настройки R",
  "Embed R Plots created via `plot()` into Notes": "Встраивать графики R, созданные через `plot()`, в заметки",
  "Rscript path": "Путь к Rscript",
  "The path to your Rscript installation. Ensure you provide the Rscript binary instead of the ordinary R binary.": "Путь к вашей установке Rscript. Убедитесь, что вы указываете бинарный файл Rscript, а не обычный бинарный файл R.",
  "R arguments": "Аргументы R",
  "Run R blocks in Notebook Mode": "Запускать блоки R в режиме блокнота",
  "Inject R code": "Внедрить код R",
  "Code to add to the top of every R code block before running.": "Код для добавления в начало каждого блока R перед выполнением.",
  "Kotlin Settings": "Настройки Kotlin",
  "Kotlin path": "Путь к Kotlin",
  "The path to your Kotlin installation.": "Путь к вашей установке Kotlin.",
  "Kotlin arguments": "Аргументы Kotlin",
  "Inject Kotlin code": "Внедрить код Kotlin",
  "Code to add to the top of every Kotlin code block before running.": "Код для добавления в начало каждого блока Kotlin перед выполнением.",
  "Wolfram Mathematica Settings": "Настройки Wolfram Mathematica",
  "Mathematica path": "Путь к Mathematica",
  "The path to your Mathematica installation.": "Путь к вашей установке Mathematica.",
  "Mathematica arguments": "Аргументы Mathematica",
  "Inject Mathematica code": "Внедрить код Mathematica",
  "Code to add to the top of every Mathematica code block before running.": "Код для добавления в начало каждого блока Mathematica перед выполнением.",
  "Haskell Settings": "Настройки Haskell",
  "Use Ghci": "Использовать Ghci",
  "Run haskell code with ghci instead of runghc": "Запускать код Haskell с помощью ghci вместо runghc",
  "Ghci path": "Путь к Ghci",
  "The path to your ghci installation.": "Путь к вашей установке ghci.",
  "Rungch path": "Путь к Rungch",
  "The path to your runghc installation.": "Путь к вашей установке runghc.",
  "Ghc path": "Путь к Ghc",
  "The Ghc path your runghc installation will call.": "Путь к Ghc, который будет вызывать ваша установка runghc.",
  "Inject Haskell code": "Внедрить код Haskell",
  "Code to add to the top of every Haskell code block before running.": "Код для добавления в начало каждого блока Haskell перед выполнением.",
  "Scala Settings": "Настройки Scala",
  "scala path": "Путь к Scala",
  "Path to your scala installation": "Путь к вашей установке Scala",
  "Scala arguments": "Аргументы Scala",
  "Inject Scala code": "Внедрить код Scala",
  "Code to add to the top of every Scala code block before running.": "Код для добавления в начало каждого блока Scala перед выполнением.",
  "Swift Settings": "Настройки Swift",
  "Swift path": "Путь к Swift",
  "The path to your Swift installation.": "Путь к вашей установке Swift.",
  "Swift arguments": "Аргументы Swift",
  "Inject Swift code": "Внедрить код Swift",
  "Code to add to the top of every Swift code block before running.": "Код для добавления в начало каждого блока Swift перед выполнением.",
  "Racket Settings": "Настройки Racket",
  "racket path": "Путь к Racket",
  "Path to your racket installation": "Путь к вашей установке Racket",
  "Racket arguments": "Аргументы Racket",
  "Inject Racket code": "Внедрить код Racket",
  "Code to add to the top of every Racket code block before running.": "Код для добавления в начало каждого блока Racket перед выполнением.",
  "F# Settings": "Настройки F#",
  "F# path": "Путь к F#",
  "The path to dotnet.": "Путь к dotnet.",
  "F# arguments": "Аргументы F#",
  "F# file extension": "Расширение файла F#",
  "Changes the file extension for generated F# scripts.": "Изменяет расширение файла для сгенерированных скриптов F#.",
  "Inject F# code": "Внедрить код F#",
  "Code to add to the top of every F# code block before running.": "Код для добавления в начало каждого блока F# перед выполнением.",
  "Ruby Settings": "Настройки Ruby",
  "ruby path": "Путь к Ruby",
  "Path to your ruby installation": "Путь к вашей установке Ruby",
  "ruby arguments": "Аргументы Ruby",
  "Inject Ruby code": "Внедрить код Ruby",
  "Code to add to the top of every Ruby code block before running.": "Код для добавления в начало каждого блока Ruby перед выполнением.",
  "SQL Settings": "Настройки SQL",
  "SQL path": "Путь к SQL",
  "Path to your SQL installation. You can select the SQL dialect you prefer but you need to set the right arguments by yourself.": "Путь к вашей установке SQL. Вы можете выбрать предпочитаемый диалект SQL, но вам нужно самостоятельно установить правильные аргументы.",
  "SQL arguments": "Аргументы SQL",
  "Set the right arguments for your database.": "Установите правильные аргументы для вашей базы данных.",
  "Inject SQL code": "Внедрить код SQL",
  "Code to add to the top of every SQL code block before running.": "Код для добавления в начало каждого блока SQL перед выполнением.",
  "Octave Settings": "Настройки Octave",
  "Octave path": "Путь к Octave",
  "The path to your Octave installation.": "Путь к вашей установке Octave.",
  "Octave arguments": "Аргументы Octave",
  "Inject Octave code": "Внедрить код Octave",
  "Code to add to the top of every Octave code block before running.": "Код для добавления в начало каждого блока Octave перед выполнением.",
  "Maxima Settings": "Настройки Maxima",
  "Maxima path": "Путь к Maxima",
  "The path to your Maxima installation.": "Путь к вашей установке Maxima.",
  "Maxima arguments": "Аргументы Maxima",
  "Inject Maxima code": "Внедрить код Maxima",
  "Code to add to the top of every Maxima code block before running.": "Код для добавления в начало каждого блока Maxima перед выполнением.",
  "Applescript Settings": "Настройки Applescript",
  "Osascript path": "Путь к Osascript",
  "The path to your osascript installation (only available on MacOS).": "Путь к вашей установке osascript (доступно только на MacOS).",
  "Applescript arguments": "Аргументы Applescript",
  "Inject Applescript code": "Внедрить код Applescript",
  "Code to add to the top of every Applescript code block before running.": "Код для добавления в начало каждого блока Applescript перед выполнением.",
  "Zig Settings": "Настройки Zig",
  "zig path": "Путь к Zig",
  "Path to your zig installation": "Путь к вашей установке Zig",
  "zig arguments": "Аргументы Zig",
  "Inject Zig code": "Внедрить код Zig",
  "Code to add to the top of every Zig code block before running.": "Код для добавления в начало каждого блока Zig перед выполнением.",
  "OCaml Settings": "Настройки OCaml",
  "ocaml path": "Путь к OCaml",
  "Path to your ocaml installation": "Путь к вашей установке OCaml",
  "ocaml arguments": "Аргументы OCaml",
  "Inject OCaml code": "Внедрить код OCaml",
  "Code to add to the top of every OCaml code block before running.": "Код для добавления в начало каждого блока OCaml перед выполнением.",
  "PHP Settings": "Настройки PHP",
  "php path": "Путь к PHP",
  "Path to your php installation": "Путь к вашей установке PHP",
  "php arguments": "Аргументы PHP",
  "Inject PHP code": "Внедрить код PHP",
  "Code to add to the top of every PHP code block before running.": "Код для добавления в начало каждого блока PHP перед выполнением.",
  "Fast Attachment Cleaner Settings": "Настройки быстрой очистки вложений",
  "Deleted Attachment Destination": "Место назначения удаленных вложений",
  "Select where you want Attachments to be moved once they are deleted": "Выберите, куда должны перемещаться вложения после их удаления",
  "Delete Permanently": "Удалить навсегда",
  "Move to Obsidian Trash": "Переместить в корзину Obsidian",
  "Move to System Trash": "Переместить в системную корзину",
  "Automatic": "Автоматически",
  "Split timers for automatic commit and sync": "Разделить таймеры для автоматического коммита и синхронизации",
  "Enable to use one interval for commit and another for sync.": "Включить использование одного интервала для коммита и другого для синхронизации.",
  "Auto commit interval (minutes)": "Интервал автоматического коммита (минуты)",
  "Commit changes every X minutes. Set to 0 (default) to disable. (See below setting for further configuration!)": "Коммитить изменения каждые X минут. Установите 0 (по умолчанию) для отключения. (Смотрите настройку ниже для дальнейшей конфигурации!)",
  "Auto commit after stopping file edits": "Автоматический коммит после прекращения редактирования файлов",
  "Requires the commit interval not to be 0.\n                        If turned on, do auto commit every 30 minutes after stopping file edits.\n                        This also prevents auto commit while editing a file. If turned off, it's independent from the last file edit.": "Требует, чтобы интервал коммита не был 0.\n                        Если включено, выполняет автоматический коммит каждые 30 минут после прекращения редактирования файлов.\n                        Это также предотвращает автоматический коммит во время редактирования файла. Если выключено, это не зависит от последнего редактирования файла.",
  "Auto commit after latest commit": "Автоматический коммит после последнего коммита",
  "If turned on, sets last auto commit timestamp to the latest commit timestamp. This reduces the frequency of auto commit when doing manual commits.": "Если включено, устанавливает временную метку последнего автоматического коммита на временную метку последнего коммита. Это уменьшает частоту автоматических коммитов при выполнении ручных коммитов.",
  "Auto push interval (minutes)": "Интервал автоматического push (минуты)",
  "Push commits every X minutes. Set to 0 (default) to disable.": "Отправлять коммиты каждые X минут. Установите 0 (по умолчанию) для отключения.",
  "Auto pull interval (minutes)": "Интервал автоматического pull (минуты)",
  "Pull changes every X minutes. Set to 0 (default) to disable.": "Получать изменения каждые X минут. Установите 0 (по умолчанию) для отключения.",
  "Specify custom commit message on auto commit": "Указать пользовательское сообщение коммита при автоматическом коммите",
  "You will get a pop up to specify your message.": "Вы получите всплывающее окно для указания вашего сообщения.",
  "Commit message on auto commit": "Сообщение коммита при автоматическом коммите",
  "Available placeholders: {{date}} (see below), {{hostname}} (see below), {{numFiles}} (number of changed files in the commit) and {{files}} (changed files in commit message).": "Доступные заполнители: {{date}} (см. ниже), {{hostname}} (см. ниже), {{numFiles}} (количество измененных файлов в коммите) и {{files}} (измененные файлы в сообщении коммита).",
  "Commit message": "Сообщение коммита",
  "Commit message on manual commit": "Сообщение коммита при ручном коммите",
  "{{date}} placeholder format": "Формат заполнителя {{date}}",
  "Moment.js": "Moment.js",
  "{{hostname}} placeholder replacement": "Замена заполнителя {{hostname}}",
  "Specify custom hostname for every device.": "Указать пользовательское имя хоста для каждого устройства.",
  "Preview commit message": "Предварительный просмотр сообщения коммита",
  "Preview": "Предварительный просмотр",
  "List filenames affected by commit in the commit body": "Список файлов, затронутых коммитом, в теле коммита",
  "Pull": "Получить",
  "Merge strategy": "Стратегия слияния",
  "Decide how to integrate commits from your remote branch into your local branch.": "Выберите способ интеграции коммитов из удаленной ветки в локальную ветку.",
  "Merge": "Слияние",
  "Rebase": "Перебазирование",
  "Other sync service (Only updates the HEAD without touching the working directory)": "Другой сервис синхронизации (Обновляет только HEAD без изменения рабочей директории)",
  "Pull on startup": "Получать изменения при запуске",
  "Automatically pull commits when Obsidian starts.": "Автоматически получать коммиты при запуске Obsidian.",
  "Commit-and-sync": "Коммит и синхронизация",
  "Commit-and-sync with default settings means staging everything -> committing -> pulling -> pushing. Ideally this is a single action that you do regularly to keep your local and remote repository in sync.": "Коммит и синхронизация с настройками по умолчанию означает индексацию всего -> коммит -> получение -> отправку. В идеале это единое действие, которое вы выполняете регулярно для синхронизации локального и удаленного репозитория.",
  "Push on commit-and-sync": "Отправлять при коммите и синхронизации",
  "Most of the time you want to push after committing. Turning this off turns a commit-and-sync action into commit only. It will still be called commit-and-sync.": "В большинстве случаев вы хотите отправить изменения после коммита. Отключение этой опции превращает действие коммита и синхронизации только в коммит. Оно все равно будет называться коммит и синхронизация.",
  "Pull on commit-and-sync": "Получать при коммите и синхронизации",
  "On commit-and-sync, pull commits as well. Turning this off turns a commit-and-sync action into commit only.": "При коммите и синхронизации также получать коммиты. Отключение этой опции превращает действие коммита и синхронизации только в коммит.",
  "Line author information": "Информация об авторе строки",
  "Show commit authoring information next to each line": "Показывать информацию об авторстве коммита рядом с каждой строкой",
  "Feature guide and quick examples": "Руководство по функциям и быстрые примеры",
  "History view": "Просмотр истории",
  "Show Author": "Показать автора",
  "Show the author of the commit in the history view.": "Показывать автора коммита в просмотре истории.",
  "Hide": "Скрыть",
  "Full": "Полностью",
  "Initials": "Инициалы",
  "Show Date": "Показать дату",
  "Show the date of the commit in the history view. The {{date}} placeholder format is used to display the date.": "Показывать дату коммита в просмотре истории. Для отображения даты используется формат заполнителя {{date}}.",
  "Source control view": "Просмотр контроля версий",
  "Automatically refresh source control view on file changes": "Автоматически обновлять просмотр контроля версий при изменении файлов",
  "On slower machines this may cause lags. If so, just disable this option.": "На более медленных машинах это может вызвать задержки. В таком случае просто отключите эту опцию.",
  "Source control view refresh interval": "Интервал обновления просмотра контроля версий",
  "Milliseconds to wait after file change before refreshing the Source Control View.": "Количество миллисекунд ожидания после изменения файла перед обновлением просмотра контроля версий.",
  "Miscellaneous": "Разное",
  "Disable notifications": "Отключить уведомления",
  "Disable notifications for git operations to minimize distraction (refer to status bar for updates). Errors are still shown as notifications even if you enable this setting.": "Отключить уведомления для операций git, чтобы минимизировать отвлечение (обращайтесь к строке состояния для обновлений). Ошибки все равно будут показываться как уведомления, даже если вы включите эту настройку.",
  "Hide notifications for no changes": "Скрыть уведомления при отсутствии изменений",
  "Don't show notifications when there are no changes to commit or push.": "Не показывать уведомления, когда нет изменений для коммита или отправки.",
  "Show status bar": "Показать строку состояния",
  "Obsidian must be restarted for the changes to take affect.": "Для применения изменений необходимо перезапустить Obsidian.",
  "Show stage/unstage button in file menu": "Показать кнопку добавления/удаления из индекса в меню файла",
  "Show branch status bar": "Показать строку состояния ветки",
  "Show the count of modified files in the status bar": "Показать количество измененных файлов в строке состояния",
  "Commit author": "Автор коммита",
  "Author name for commit": "Имя автора для коммита",
  "Author email for commit": "Email автора для коммита",
  "Advanced": "Расширенные",
  "These settings usually don't need to be changed, but may be requried for special setups.": "Эти настройки обычно не требуют изменений, но могут потребоваться для специальных конфигураций.",
  "Update submodules": "Обновить подмодули",
  "\"Commit-and-sync\" and \"pull\" takes care of submodules. Missing features: Conflicted files, count of pulled/pushed/committed files. Tracking branch needs to be set for each submodule.": "\"Коммит и синхронизация\" и \"получение\" заботятся о подмодулях. Отсутствующие функции: Конфликтующие файлы, количество полученных/отправленных/зафиксированных файлов. Отслеживаемая ветка должна быть установлена для каждого подмодуля.",
  "Custom Git binary path": "Пользовательский путь к исполняемому файлу Git",
  "Additional environment variables": "Дополнительные переменные окружения",
  "Use each line for a new environment variable in the format KEY=VALUE .": "Используйте каждую строку для новой переменной окружения в формате КЛЮЧ=ЗНАЧЕНИЕ .",
  "Additional PATH environment variable paths": "Дополнительные пути переменной окружения PATH",
  "Use each line for one path": "Используйте каждую строку для одного пути",
  "Reload with new environment variables": "Перезагрузить с новыми переменными окружения",
  "Removing previously added environment variables will not take effect until Obsidian is restarted.": "Удаление ранее добавленных переменных окружения не вступит в силу до перезапуска Obsidian.",
  "Reload": "Перезагрузить",
  "Custom base path (Git repository path)": "Пользовательский базовый путь (путь к репозиторию Git)",
  "Sets the relative path to the vault from which the Git binary should be executed.\n             Mostly used to set the path to the Git repository, which is only required if the Git repository is below the vault root directory. Use \"\\\" instead of \"/\" on Windows.": "Устанавливает относительный путь к хранилищу, из которого должен выполняться исполняемый файл Git.\n             В основном используется для установки пути к репозиторию Git, что требуется только если репозиторий Git находится ниже корневой директории хранилища. Используйте \"\\\" вместо \"/\" в Windows.",
  "Custom Git directory path (Instead of '.git')": "Пользовательский путь к директории Git (вместо '.git')",
  "Requires restart of Obsidian to take effect. Use \"\\\" instead of \"/\" on Windows.": "Требуется перезапуск Obsidian для применения. Используйте \"\\\" вместо \"/\" в Windows.",
  "Disable on this device": "Отключить на этом устройстве",
  "Disables the plugin on this device. This setting is not synced.": "Отключает плагин на этом устройстве. Эта настройка не синхронизируется.",
  "Support": "Поддержка",
  "Donate": "Пожертвовать",
  "If you like this Plugin, consider donating to support continued development.": "Если вам нравится этот плагин, рассмотрите возможность пожертвования для поддержки дальнейшей разработки.",
  "Copy Debug Information": "Копировать отладочную информацию",
  "Debugging and logging:\nYou can always see the logs of this and every other plugin by opening the console with": "Отладка и логирование:\nВы всегда можете увидеть логи этого и любого другого плагина, открыв консоль с помощью",
  "CTRL + SHIFT + I": "CTRL + SHIFT + I",
  "Tags": "Теги",
  "Move tags to card footer": "Переместить теги в подвал карточки",
  "When toggled, tags will be displayed in the card's footer instead of the card's body.": "При включении теги будут отображаться в подвале карточки вместо тела карточки.",
  "Tag click action": "Действие при клике на тег",
  "This setting controls whether clicking the tags displayed below the card title opens the Obsidian search or the Kanban board search.": "Эта настройка определяет, открывает ли клик по тегам, отображаемым под заголовком карточки, поиск Obsidian или поиск доски Канбан.",
  "Search Kanban Board": "Поиск по доске Канбан",
  "Search Obsidian Vault": "Поиск по хранилищу Obsidian",
  "Tag sort order": "Порядок сортировки тегов",
  "Set an explicit sort order for the specified tags.": "Установить явный порядок сортировки для указанных тегов.",
  "Add tag": "Добавить тег",
  "Tag colors": "Цвета тегов",
  "Set colors for tags displayed in cards.": "Установить цвета для тегов, отображаемых в карточках.",
  "Add tag color": "Добавить цвет тега",
  "Move dates to card footer": "Переместить даты в подвал карточки",
  "When toggled, dates will be displayed in the card's footer instead of the card's body.": "При включении даты будут отображаться в подвале карточки вместо тела карточки.",
  "When toggled, cards will display the distance between today and the card's date. eg. 'In 3 days', 'A month ago'. Relative dates will not be shown for dates from the Tasks and Dataview plugins.": "При включении карточки будут отображать расстояние между сегодняшним днем и датой карточки. Например, 'Через 3 дня', 'Месяц назад'. Относительные даты не будут показываться для дат из плагинов Tasks и Dataview.",
  "Display date colors": "Отображать цвета дат",
  "Set colors for dates displayed in cards based on the rules below.": "Установить цвета для дат, отображаемых в карточках, на основе правил ниже.",
  "Add date color": "Добавить цвет даты",
  "Add archive date/time after card title": "Добавить дату/время архивации после заголовка карточки",
  "When toggled, the archived date/time will be added after the card title, e.g.- [ ] My card title 2021-05-14 10:00am. By default, it is inserted before the title.": "При включении дата/время архивации будет добавлена после заголовка карточки, например - [ ] Мой заголовок карточки 2021-05-14 10:00am. По умолчанию она вставляется перед заголовком.",
  "Inline Metadata": "Встроенные метаданные",
  "Inline metadata position": "Позиция встроенных метаданных",
  "Controls where the inline metadata (from the Dataview plugin) will be displayed.": "Определяет, где будут отображаться встроенные метаданные (из плагина Dataview).",
  "Card body": "Тело карточки",
  "Card footer": "Подвал карточки",
  "Merge with linked page metadata": "Объединить с метаданными связанной страницы",
  "Move task data to card footer": "Переместить данные задачи в подвал карточки",
  "When toggled, task data (from the Tasks plugin) will be displayed in the card's footer instead of the card's body.": "При включении данные задачи (из плагина Tasks) будут отображаться в подвале карточки вместо тела карточки.",
  "Board view": "Просмотр доски",
  "Command settings": "Настройки команд",
  "General": "Общие",
  "Autoselect upon creating a link": "Автовыбор при создании ссылки",
  "Autoselect a word under the cursor when creating a link.": "Автоматически выбирать слово под курсором при создании ссылки.",
  "Skip Frontmatter": "Пропустить Frontmatter",
  "Skip Frontmatter in note wide commands.": "Пропустить Frontmatter в командах для всей заметки.",
  "Title separator": "Разделитель заголовков",
  "String used as headings separator in 'Set link text' command.": "Строка, используемая как разделитель заголовков в команде 'Установить текст ссылки'.",
  "Remove links from headings": "Удалить ссылки из заголовков",
  "Internal wikilink without text": "Внутренняя вики-ссылка без текста",
  "Remove": "Удалить",
  "Replace with destination": "Заменить на целевой текст",
  "Replace with lowest heading": "Заменить на нижний заголовок",
  "Delete link": "Удалить ссылку",
  "Delete unreferenced link target": "Удалить неиспользуемую цель ссылки",
  "Convert to Markdown link": "Преобразовать в Markdown-ссылку",
  "Append .md extension": "Добавить расширение .md",
  "docs": "документация",
  "Context menu": "Контекстное меню",
  "Edit link text": "Редактировать текст ссылки",
  "Set link text": "Установить текст ссылки",
  "Set link text from clipboard": "Установить текст ссылки из буфера обмена",
  "Edit link destination": "Редактировать назначение ссылки",
  "Set link destination from clipboard": "Установить назначение ссылки из буфера обмена",
  "Copy link": "Копировать ссылку",
  "Cut link": "Вырезать ссылку",
  "Copy link destination": "Копировать назначение ссылки",
  "Copy link to element": "Копировать ссылку на элемент",
  "Unlink": "Удалить ссылку",
  "Convert to wikilink": "Преобразовать в вики-ссылку",
  "Convert to autolink": "Преобразовать в автоссылку",
  "Convert to markdown link": "Преобразовать в markdown-ссылку",
  "Convert to HTML link": "Преобразовать в HTML-ссылку",
  "Embed/Unembed": "Встроить/Отменить встраивание",
  "Delete": "Удалить",
  "Create link": "Создать ссылку",
  "Create link from clipboard": "Создать ссылку из буфера обмена",
  "Convert all links to Markdown links": "Преобразовать все ссылки в Markdown-ссылки",
  "Convert Wikilinks to Markdown links": "Преобразовать вики-ссылки в Markdown-ссылки",
  "Convert URLs to Markdown links": "Преобразовать URL в Markdown-ссылки",
  "Convert Autolinks to Markdown links": "Преобразовать автоссылки в Markdown-ссылки",
  "Convert HTML links to Markdown links": "Преобразовать HTML-ссылки в Markdown-ссылки",
  "Extract section": "Извлечь раздел",
  "Early access features": "Функции раннего доступа",
  "Almost finished features with some": "Почти завершенные функции с некоторыми",
  "to be fixed.": "исправлениями.",
  "Insider features": "Инсайдерские функции",
  "Incomplete features currently under development. Enable these features to": "Незавершенные функции в разработке. Включите эти функции, чтобы",
  "provide your input": "предоставить свой отзыв",
  "and influence the direction of development.": "и повлиять на направление разработки.",
  "Convert links in a folder": "Преобразовать ссылки в папке",
  "Obsidian URL support": "Поддержка URL Obsidian",
  "Chetachi 👩🏽‍💻": "Четачи 👩🏽‍💻",
  "Notification Settings": "Настройки уведомлений",
  "Reminder Time": "Время напоминания",
  "Time when a reminder with no time part will show": "Время, когда будет показано напоминание без указания времени",
  "Remind me later": "Напомнить позже",
  "Line-separated list of remind me later items": "Список элементов 'напомнить позже', разделенных строками",
  "Use system notification": "Использовать системные уведомления",
  "Use system notification for reminder notifications": "Использовать системные уведомления для напоминаний",
  "Calendar popup trigger": "Триггер всплывающего календаря",
  "Trigger text to show calendar popup": "Текст триггера для показа всплывающего календаря",
  "Popup is enabled": "Всплывающее окно включено",
  "Primary reminder format": "Основной формат напоминания",
  "Reminder format for generated reminder by calendar popup": "Формат напоминания для генерируемого напоминания всплывающим календарем",
  "Reminder plugin format - (@2021-09-08)": "Формат плагина напоминаний - (@2021-09-08)",
  "Tasks plugin format - 📅 2021-09-08": "Формат плагина задач - 📅 2021-09-08",
  "Kanban plugin format - @{2021-09-08}": "Формат плагина Kanban - @{2021-09-08}",
  "Reminder Format - Reminder Plugin": "Формат напоминания - Плагин напоминаний",
  "Enable Reminder plugin format": "Включить формат плагина напоминаний",
  "Example: - [ ] Task 1(@2025-01-05 12:21)": "Пример: - [ ] Задача 1(@2025-01-05 12:21)",
  "Date format": "Формат даты",
  "moment style date format: https://momentjs.com/docs/#/displaying/format/": "формат даты в стиле moment: https://momentjs.com/docs/#/displaying/format/",
  "Date and time format": "Формат даты и времени",
  "moment() style date time format: https://momentjs.com/docs/#/displaying/format/": "формат даты и времени в стиле moment(): https://momentjs.com/docs/#/displaying/format/",
  "Strict Date format": "Строгий формат даты",
  "Strictly parse the date and time": "Строго анализировать дату и время",
  "Link dates to daily notes": "Связать даты с ежедневными заметками",
  "When toggled, Dates link to daily notes.": "При включении даты связываются с ежедневными заметками.",
  "Reminder Format - Tasks Plugin": "Формат напоминания - Плагин задач",
  "Enable Tasks plugin format": "Включить формат плагина задач",
  "Example: - [ ] Task 1 📅 2025-01-05": "Пример: - [ ] Задача 1 📅 2025-01-05",
  "Distinguish between reminder date and due date": "Различать дату напоминания и срок выполнения",
  "Use custom emoji ⏰ instead of 📅 and distinguish between reminder date/time and Tasks Plugin's due date.": "Использовать пользовательский эмодзи ⏰ вместо 📅 и различать дату/время напоминания и срок выполнения плагина задач.",
  "Remove tags from reminder title": "Удалить теги из заголовка напоминания",
  "If checked, tags(#xxx) are removed from the reminder list view and notification.": "Если отмечено, теги (#xxx) удаляются из списка напоминаний и уведомлений.",
  "Reminder Format - Kanban Plugin": "Формат напоминания - Плагин Kanban",
  "Enable Kanban plugin format": "Включить формат плагина Kanban",
  "Example: - [ ] Task 1 @{2025-01-05} @@{12:21}": "Пример: - [ ] Задача 1 @{2025-01-05} @@{12:21}",
  "Edit Detection Time": "Время обнаружения редактирования",
  "The minimum amount of time (in seconds) after a key is typed that it will be identified as notifiable.": "Минимальное время (в секундах) после ввода клавиши, когда оно будет определено как уведомляемое.",
  "Reminder check interval": "Интервал проверки напоминаний",
  "Interval(in seconds) to periodically check whether or not you should be notified of reminders.  You will need to restart Obsidian for this setting to take effect.": "Интервал (в секундах) для периодической проверки необходимости уведомления о напоминаниях. Для применения этой настройки необходимо перезапустить Obsidian.",
  "Import": "Импорт",
  "Export": "Экспорт",
  "Separate desktop/mobile configuration": "Отдельная конфигурация для компьютера/мобильных устройств",
  "Enable this if you want to have different settings depending whether you're using a desktop or mobile device. All of the settings below can be configured differently on desktop and mobile. You're currently using the desktop/global settings.": "Включите это, если хотите иметь разные настройки в зависимости от того, используете ли вы компьютер или мобильное устройство. Все настройки ниже могут быть настроены по-разному для компьютера и мобильных устройств. Сейчас вы используете настройки компьютера/глобальные настройки.",
  "Lazy Loader settings": "Настройки ленивой загрузки",
  "Short delay (seconds)": "Короткая задержка (секунды)",
  "Long delay (seconds)": "Длинная задержка (секунды)",
  "Default startup type for new plugins": "Тип запуска по умолчанию для новых плагинов",
  "Nothing configured": "Ничего не настроено",
  "⛔ Disable plugin": "⛔ Отключить плагин",
  "⚡ Instant": "⚡ Мгновенно",
  "⌚ Short delay": "⌚ Короткая задержка",
  "💤 Long delay": "💤 Длинная задержка",
  "Show plugin descriptions": "Показать описания плагинов",
  "Set the delay for all plugins at once": "Установить задержку для всех плагинов сразу",
  "Set all plugins to be:": "Установить все плагины как:",
  "Plugins": "Плагины",
  "All": "Все",
  "AttachFlow": "AttachFlow",
  "This nifty plugin enables seamless management of attachments and referenced links directly from your documents. Taking advantage of an intuitive right-click menu, you can efficiently handle resources in both LIVE and READ modes.": "Этот удобный плагин обеспечивает беспрепятственное управление вложениями и ссылками прямо из ваших документов. Используя интуитивно понятное контекстное меню, вы можете эффективно управлять ресурсами как в режиме LIVE, так и в режиме READ.",
  "Right-click menu for attachments": "Контекстное меню для вложений",
  "Deleted attachment destination": "Место назначения удаленных вложений",
  "Move file to...": "Переместить файл в...",
  "Add a \"Move to...\" option to the right-click menu for attachments": "Добавить опцию \"Переместить в...\" в контекстное меню для вложений",
  "Click to view images": "Нажмите для просмотра изображений",
  "Click the right half of the image to view the image in detail.": "Нажмите на правую половину изображения для детального просмотра.",
  "Adaptive image display ratio based on window size": "Адаптивное соотношение сторон изображения в зависимости от размера окна",
  "When the image exceeds the window size, the image is displayed adaptively according to the window size.": "Когда изображение превышает размер окна, оно отображается адаптивно в соответствии с размером окна.",
  "Drag to resize images": "Перетащите для изменения размера изображений",
  "Turn on to enable drag to resize images.": "Включите для возможности изменения размера изображений перетаскиванием.",
  "Resize interval": "Интервал изменения размера",
  "Debug": "Отладка",
  "Debug mode": "Режим отладки",
  "Print debug information in console": "Вывод отладочной информации в консоль",
  "Folder overview": "Обзор папок",
  "Exclude folders": "Исключить папки",
  "File explorer": "Проводник файлов",
  "Path": "Путь",
  "Folder note name": "Имя заметки папки",
  "{{folder_name}} will be replaced with the name of the folder": "{{folder_name}} будет заменено на имя папки",
  "Rename existing folder notes": "Переименовать существующие заметки папок",
  "Default folder note type for new folder notes": "Тип заметки папки по умолчанию для новых заметок",
  "Choose the default file type for new folder notes. (canvas, markdown, ...)": "Выберите тип файла по умолчанию для новых заметок папок. (canvas, markdown, ...)",
  "ask for file type": "спросить тип файла",
  "Supported file types for folder notes": "Поддерживаемые типы файлов для заметок папок",
  "Custom extension": "Пользовательское расширение",
  "Template path": "Путь к шаблону",
  "Restart after changing the template path": "Перезапустить после изменения пути к шаблону",
  "Storage location": "Место хранения",
  "Choose where to store the folder notes": "Выберите, где хранить заметки папок",
  "Inside the folder": "Внутри папки",
  "In the parent folder": "В родительской папке",
  "Switch to new storage location": "Переключиться на новое место хранения",
  "Move all folder notes to the new storage location": "Переместить все заметки папок в новое место хранения",
  "Switch": "Переключить",
  "Key for creating folder note": "Клавиша для создания заметки папки",
  "The key combination to create a folder note": "Комбинация клавиш для создания заметки папки",
  "Ctrl + Click": "Ctrl + Клик",
  "Alt + Click": "Alt + Клик",
  "Key for opening folder note": "Клавиша для открытия заметки папки",
  "Select the combination to open a folder note": "Выберите комбинацию для открытия заметки папки",
  "Mouse Click": "Клик мышью",
  "Sync folder name": "Синхронизировать имя папки",
  "Automatically rename the folder note when the folder name is changed": "Автоматически переименовывать заметку папки при изменении имени папки",
  "Confirm folder note deletion": "Подтверждать удаление заметки папки",
  "Ask for confirmation before deleting a folder note": "Запрашивать подтверждение перед удалением заметки папки",
  "Deleted folder notes": "Удаленные заметки папок",
  "What happens to the folder note after you delete it": "Что происходит с заметкой папки после удаления",
  "Move to system trash": "Переместить в корзину системы",
  "Move to Obsidian trash (.trash folder)": "Переместить в корзину Obsidian (папка .trash)",
  "Delete permanently": "Удалить навсегда",
  "Open folder note in a new tab by default": "Открывать заметку папки в новой вкладке по умолчанию",
  "Always open folder notes in a new tab (except when you try to open the same note) instead of having to use ctrl/cmd + click to open in a new tab": "Всегда открывать заметки папок в новой вкладке (кроме случаев, когда вы пытаетесь открыть ту же заметку) вместо использования ctrl/cmd + клик для открытия в новой вкладке",
  "Automatically create folder notes": "Автоматически создавать заметки папок",
  "Automatically create a folder note when a new folder is created": "Автоматически создавать заметку папки при создании новой папки",
  "Enable front matter title plugin integration": "Включить интеграцию плагина front matter title",
  "Automatically rename a folder name when the folder note is renamed": "Автоматически переименовывать имя папки при переименовании заметки папки",
  "Create folder note for every folder": "Создать заметку папки для каждой папки",
  "Create a folder note for every folder in the vault": "Создать заметку папки для каждой папки в хранилище",
  "Manage folder overview defaults": "Управление настройками обзора папок по умолчанию",
  "Manage the default settings for the folder overview plugin": "Управление настройками по умолчанию для плагина обзора папок",
  "Manage": "Управление",
  "Manage excluded folders": "Управление исключенными папками",
  "Exclude folder default settings": "Настройки исключения папок по умолчанию",
  "Exclude pattern default settings": "Настройки шаблона исключения по умолчанию",
  "Add excluded folder": "Добавить исключенную папку",
  "Hide folder note": "Скрыть заметку папки",
  "Hide the folder note in the file explorer": "Скрыть заметку папки в проводнике файлов",
  "Don't open folder notes by clicking on the name (on mobile)": "Не открывать заметки папок при нажатии на имя (на мобильных устройствах)",
  "Folder notes don't open when clicking on the name of the folder (on mobile)": "Заметки папок не открываются при нажатии на имя папки (на мобильных устройствах)",
  "Only open folder notes through the name": "Открывать заметки папок только через имя",
  "Only open folder notes in the file explorer by clicking on the folder name": "Открывать заметки папок в проводнике файлов только при нажатии на имя папки",
  "Disable folder collapsing": "Отключить сворачивание папок",
  "Disable the ability to collapse folders by clicking exactly on the folder name": "Отключить возможность сворачивания папок при нажатии точно на имя папки",
  "Use submenus": "Использовать подменю",
  "Use submenus for file/folder commands": "Использовать подменю для команд файлов/папок",
  "Style settings": "Настройки стиля",
  "Hide collapse icon": "Скрыть значок сворачивания",
  "Hide the collapse icon in the file explorer next to the name of a folder when a folder only contains a folder note": "Скрыть значок сворачивания в проводнике файлов рядом с именем папки, когда папка содержит только заметку папки",
  "Underline the name of folder notes": "Подчеркнуть имена заметок папок",
  "Add an underline to folders that have a folder note in the file explorer": "Добавить подчеркивание к папкам, имеющим заметку папки в проводнике файлов",
  "Bold the name of folder notes": "Сделать имена заметок папок жирными",
  "Make the folder name bold in the file explorer": "Сделать имя папки жирным в проводнике файлов",
  "Cursive the name of folder notes": "Сделать имена заметок папок курсивными",
  "Make the folder name cursive in the file explorer": "Сделать имя папки курсивным в проводнике файлов",
  "Open folder note through path": "Открыть заметку папки через путь",
  "Open a folder note when clicking on a folder name in the path if it is a folder note": "Открыть заметку папки при нажатии на имя папки в пути, если это заметка папки",
  "Change folder name in the path": "Изменить имя папки в пути",
  "Automatically rename a folder name in the path above a note when the folder note is renamed": "Автоматически переименовывать имя папки в пути над заметкой при переименовании заметки папки",
  "Underline folders in the path": "Подчеркнуть папки в пути",
  "Add an underline to folders that have a folder note in the path above a note": "Добавить подчеркивание к папкам, имеющим заметку папки в пути над заметкой",
  "Bold folders in the path": "Жирные папки в пути",
  "Make the folder name bold in the path above a note": "Сделать имя папки жирным в пути над заметкой",
  "Cursive the name of folder notes in the path": "Курсивные имена заметок папок в пути",
  "Make the folder name cursive in the path above a note": "Сделать имя папки курсивным в пути над заметкой",
  "Add {regex} at the beginning of the folder name to use a regex pattern.": "Добавьте {regex} в начало имени папки для использования шаблона регулярного выражения.",
  "Use * before and after to exclude folders that include the name between the *s.": "Используйте * до и после для исключения папок, содержащих имя между *.",
  "Use * before the folder name to exclude folders that end with the folder name.": "Используйте * перед именем папки для исключения папок, заканчивающихся именем папки.",
  "Use * after the folder name to exclude folders that start with the folder name.": "Используйте * после имени папки для исключения папок, начинающихся с имени папки.",
  "The regexes and wildcards are only for the folder name, not the path.": "Регулярные выражения и подстановочные знаки применяются только к имени папки, не к пути.",
  "If you want to switch to a folder path delete the pattern first.": "Если вы хотите переключиться на путь к папке, сначала удалите шаблон.",
  "Choose the file types that should be supported for folder notes. (e.g. if you click on a folder name it searches for all file extensions that are supported)": "Выберите типы файлов, которые должны поддерживаться для заметок папок. (например, если вы нажмете на имя папки, будет выполнен поиск всех поддерживаемых расширений файлов)",
  "Adding more file types may cause performance issues becareful when adding more file types and don't add too many.": "Добавление большего количества типов файлов может вызвать проблемы с производительностью, будьте осторожны при добавлении новых типов файлов и не добавляйте слишком много.",
  "Requires a restart to take effect": "Требуется перезапуск для применения изменений",
  "Chameleon": "Хамелеон",
  "Chameleon: A translation plugin for Obsidian that provides multilingual support.": "Хамелеон: плагин перевода для Obsidian, обеспечивающий многоязычную поддержку.",
  "Folder notes": "Заметки папок",
  "Create notes within folders that can be accessed without collapsing the folder, similar to the functionality offered in Notion.": "Создавайте заметки в папках, доступ к которым возможен без сворачивания папки, аналогично функциональности в Notion.",
  "Smart Second Brain": "Умный второй мозг",
  "Interact with your privacy focused assistant, leveraging Ollama or OpenAI, making your second brain even smarter.": "Взаимодействуйте с вашим ассистентом, ориентированным на конфиденциальность, используя Ollama или OpenAI, делая ваш второй мозг еще умнее.",
  "Expand lists to full width in list view": "Расширить списки на полную ширину в режиме списка",
  "Lazy Plugin Loader": "Ленивый загрузчик плагинов",
  "Load plugins with a delay on startup, so that you can get your app startup down into the sub-second loading time.": "Загружайте плагины с задержкой при запуске, чтобы время запуска приложения сократилось до долей секунды.",
  "Specify custom date format. E.g. \"YYYY-MM-DD HH:mm:ss. See": "Укажите пользовательский формат даты. Например, \"YYYY-MM-DD HH:mm:ss. Смотрите",
  "for more formats.": "для других форматов.",
  "The commit hash, author name and authoring date can all be individually toggled.": "Хеш коммита, имя автора и дата создания могут быть включены/выключены по отдельности.",
  "Hide everything, to only show the age-colored sidebar.": "Скрыть все, чтобы показывать только боковую панель с цветовой индикацией возраста.",
  "Diff view style": "Стиль просмотра различий",
  "Split": "Разделенный",
  "Unified": "Объединенный",
  "Set the style for the diff view. Note that the actual diff in \"Split\" mode is not generated by Git, but the editor itself instead so it may differ from the diff generated by Git. One advantage of this is that you can edit the text in that view.": "Установите стиль для просмотра различий. Обратите внимание, что фактические различия в режиме \"Разделенный\" генерируются не Git, а самим редактором, поэтому они могут отличаться от различий, сгенерированных Git. Одно из преимуществ этого в том, что вы можете редактировать текст в этом представлении.",
  "Theme Info": "Информация о теме",
  "Components": "Компоненты",
  "Appearance (light mode)": "Внешний вид (светлый режим)",
  "Appearance (dark mode)": "Внешний вид (темный режим)", 
  "Mobile": "Мобильный",
  "Plugin": "Плагин",
  "Editor": "Редактор"
}